Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxDmu_bf.h
/** \brief  Length for Ifx_DMU_HF_CONFIRM0_Bits.PROINBMHD0C */
#define IFX_DMU_HF_CONFIRM0_PROINBMHD0C_LEN (2u)

/** \brief  Mask for Ifx_DMU_HF_CONFIRM0_Bits.PROINBMHD0C */
#define IFX_DMU_HF_CONFIRM0_PROINBMHD0C_MSK (0x3u)

/** \brief  Offset for Ifx_DMU_HF_CONFIRM0_Bits.PROINBMHD0C */
#define IFX_DMU_HF_CONFIRM0_PROINBMHD0C_OFF (16u)

/** \brief  Length for Ifx_DMU_HF_CONFIRM0_Bits.PROINBMHD0O */
#define IFX_DMU_HF_CONFIRM0_PROINBMHD0O_LEN (2u)

/** \brief  Mask for Ifx_DMU_HF_CONFIRM0_Bits.PROINBMHD0O */
#define IFX_DMU_HF_CONFIRM0_PROINBMHD0O_MSK (0x3u)

/** \brief  Offset for Ifx_DMU_HF_CONFIRM0_Bits.PROINBMHD0O */
#define IFX_DMU_HF_CONFIRM0_PROINBMHD0O_OFF (0u)

/** \brief  Length for Ifx_DMU_HF_CONFIRM0_Bits.PROINBMHD1C */
#define IFX_DMU_HF_CONFIRM0_PROINBMHD1C_LEN (2u)

/** \brief  Mask for Ifx_DMU_HF_CONFIRM0_Bits.PROINBMHD1C */
#define IFX_DMU_HF_CONFIRM0_PROINBMHD1C_MSK (0x3u)

/** \brief  Offset for Ifx_DMU_HF_CONFIRM0_Bits.PROINBMHD1C */
#define IFX_DMU_HF_CONFIRM0_PROINBMHD1C_OFF (18u)

/** \brief  Length for Ifx_DMU_HF_CONFIRM0_Bits.PROINBMHD1O */
#define IFX_DMU_HF_CONFIRM0_PROINBMHD1O_LEN (2u)

/** \brief  Mask for Ifx_DMU_HF_CONFIRM0_Bits.PROINBMHD1O */
#define IFX_DMU_HF_CONFIRM0_PROINBMHD1O_MSK (0x3u)

/** \brief  Offset for Ifx_DMU_HF_CONFIRM0_Bits.PROINBMHD1O */
#define IFX_DMU_HF_CONFIRM0_PROINBMHD1O_OFF (2u)

/** \brief  Length for Ifx_DMU_HF_CONFIRM0_Bits.PROINBMHD2C */
#define IFX_DMU_HF_CONFIRM0_PROINBMHD2C_LEN (2u)

/** \brief  Mask for Ifx_DMU_HF_CONFIRM0_Bits.PROINBMHD2C */
#define IFX_DMU_HF_CONFIRM0_PROINBMHD2C_MSK (0x3u)

/** \brief  Offset for Ifx_DMU_HF_CONFIRM0_Bits.PROINBMHD2C */
#define IFX_DMU_HF_CONFIRM0_PROINBMHD2C_OFF (20u)

/** \brief  Length for Ifx_DMU_HF_CONFIRM0_Bits.PROINBMHD2O */
#define IFX_DMU_HF_CONFIRM0_PROINBMHD2O_LEN (2u)

/** \brief  Mask for Ifx_DMU_HF_CONFIRM0_Bits.PROINBMHD2O */
#define IFX_DMU_HF_CONFIRM0_PROINBMHD2O_MSK (0x3u)

/** \brief  Offset for Ifx_DMU_HF_CONFIRM0_Bits.PROINBMHD2O */
#define IFX_DMU_HF_CONFIRM0_PROINBMHD2O_OFF (4u)

/** \brief  Length for Ifx_DMU_HF_CONFIRM0_Bits.PROINBMHD3C */
#define IFX_DMU_HF_CONFIRM0_PROINBMHD3C_LEN (2u)

/** \brief  Mask for Ifx_DMU_HF_CONFIRM0_Bits.PROINBMHD3C */
#define IFX_DMU_HF_CONFIRM0_PROINBMHD3C_MSK (0x3u)

/** \brief  Offset for Ifx_DMU_HF_CONFIRM0_Bits.PROINBMHD3C */
#define IFX_DMU_HF_CONFIRM0_PROINBMHD3C_OFF (22u)

/** \brief  Length for Ifx_DMU_HF_CONFIRM0_Bits.PROINBMHD3O */
#define IFX_DMU_HF_CONFIRM0_PROINBMHD3O_LEN (2u)

/** \brief  Mask for Ifx_DMU_HF_CONFIRM0_Bits.PROINBMHD3O */
#define IFX_DMU_HF_CONFIRM0_PROINBMHD3O_MSK (0x3u)

/** \brief  Offset for Ifx_DMU_HF_CONFIRM0_Bits.PROINBMHD3O */
#define IFX_DMU_HF_CONFIRM0_PROINBMHD3O_OFF (6u)

/** \brief  Length for Ifx_DMU_HF_CONFIRM0_Bits.PROINHSMCFG */
#define IFX_DMU_HF_CONFIRM0_PROINHSMCFG_LEN (2u)

/** \brief  Mask for Ifx_DMU_HF_CONFIRM0_Bits.PROINHSMCFG */
#define IFX_DMU_HF_CONFIRM0_PROINHSMCFG_MSK (0x3u)

/** \brief  Offset for Ifx_DMU_HF_CONFIRM0_Bits.PROINHSMCFG */
#define IFX_DMU_HF_CONFIRM0_PROINHSMCFG_OFF (14u)

/** \brief  Length for Ifx_DMU_HF_CONFIRM0_Bits.PROINSRT */
#define IFX_DMU_HF_CONFIRM0_PROINSRT_LEN (2u)

/** \brief  Mask for Ifx_DMU_HF_CONFIRM0_Bits.PROINSRT */
#define IFX_DMU_HF_CONFIRM0_PROINSRT_MSK (0x3u)

/** \brief  Offset for Ifx_DMU_HF_CONFIRM0_Bits.PROINSRT */
#define IFX_DMU_HF_CONFIRM0_PROINSRT_OFF (30u)

/** \brief  Length for Ifx_DMU_HF_CONFIRM0_Bits.PROINSSW */
#define IFX_DMU_HF_CONFIRM0_PROINSSW_LEN (2u)

/** \brief  Mask for Ifx_DMU_HF_CONFIRM0_Bits.PROINSSW */
#define IFX_DMU_HF_CONFIRM0_PROINSSW_MSK (0x3u)

/** \brief  Offset for Ifx_DMU_HF_CONFIRM0_Bits.PROINSSW */
#define IFX_DMU_HF_CONFIRM0_PROINSSW_OFF (8u)

/** \brief  Length for Ifx_DMU_HF_CONFIRM0_Bits.PROINTEST */
#define IFX_DMU_HF_CONFIRM0_PROINTEST_LEN (2u)

/** \brief  Mask for Ifx_DMU_HF_CONFIRM0_Bits.PROINTEST */
#define IFX_DMU_HF_CONFIRM0_PROINTEST_MSK (0x3u)

/** \brief  Offset for Ifx_DMU_HF_CONFIRM0_Bits.PROINTEST */
#define IFX_DMU_HF_CONFIRM0_PROINTEST_OFF (12u)

/** \brief  Length for Ifx_DMU_HF_CONFIRM0_Bits.PROINUSER */
#define IFX_DMU_HF_CONFIRM0_PROINUSER_LEN (2u)

/** \brief  Mask for Ifx_DMU_HF_CONFIRM0_Bits.PROINUSER */
#define IFX_DMU_HF_CONFIRM0_PROINUSER_MSK (0x3u)

/** \brief  Offset for Ifx_DMU_HF_CONFIRM0_Bits.PROINUSER */
#define IFX_DMU_HF_CONFIRM0_PROINUSER_OFF (10u)

/** \brief  Length for Ifx_DMU_HF_CONFIRM1_Bits.PROINDBGC */
#define IFX_DMU_HF_CONFIRM1_PROINDBGC_LEN (2u)

/** \brief  Mask for Ifx_DMU_HF_CONFIRM1_Bits.PROINDBGC */
#define IFX_DMU_HF_CONFIRM1_PROINDBGC_MSK (0x3u)

/** \brief  Offset for Ifx_DMU_HF_CONFIRM1_Bits.PROINDBGC */
#define IFX_DMU_HF_CONFIRM1_PROINDBGC_OFF (20u)

/** \brief  Length for Ifx_DMU_HF_CONFIRM1_Bits.PROINDBGO */
#define IFX_DMU_HF_CONFIRM1_PROINDBGO_LEN (2u)

/** \brief  Mask for Ifx_DMU_HF_CONFIRM1_Bits.PROINDBGO */
#define IFX_DMU_HF_CONFIRM1_PROINDBGO_MSK (0x3u)

/** \brief  Offset for Ifx_DMU_HF_CONFIRM1_Bits.PROINDBGO */
#define IFX_DMU_HF_CONFIRM1_PROINDBGO_OFF (4u)

/** \brief  Length for Ifx_DMU_HF_CONFIRM1_Bits.PROINDC */
#define IFX_DMU_HF_CONFIRM1_PROINDC_LEN (2u)

/** \brief  Mask for Ifx_DMU_HF_CONFIRM1_Bits.PROINDC */
#define IFX_DMU_HF_CONFIRM1_PROINDC_MSK (0x3u)

/** \brief  Offset for Ifx_DMU_HF_CONFIRM1_Bits.PROINDC */
#define IFX_DMU_HF_CONFIRM1_PROINDC_OFF (18u)

/** \brief  Length for Ifx_DMU_HF_CONFIRM1_Bits.PROINDO */
#define IFX_DMU_HF_CONFIRM1_PROINDO_LEN (2u)

/** \brief  Mask for Ifx_DMU_HF_CONFIRM1_Bits.PROINDO */
#define IFX_DMU_HF_CONFIRM1_PROINDO_MSK (0x3u)

/** \brief  Offset for Ifx_DMU_HF_CONFIRM1_Bits.PROINDO */
#define IFX_DMU_HF_CONFIRM1_PROINDO_OFF (2u)

/** \brief  Length for Ifx_DMU_HF_CONFIRM1_Bits.PROINHSMC */
#define IFX_DMU_HF_CONFIRM1_PROINHSMC_LEN (2u)

/** \brief  Mask for Ifx_DMU_HF_CONFIRM1_Bits.PROINHSMC */
#define IFX_DMU_HF_CONFIRM1_PROINHSMC_MSK (0x3u)

/** \brief  Offset for Ifx_DMU_HF_CONFIRM1_Bits.PROINHSMC */
#define IFX_DMU_HF_CONFIRM1_PROINHSMC_OFF (22u)

/** \brief  Length for Ifx_DMU_HF_CONFIRM1_Bits.PROINHSMCOTP0C */
#define IFX_DMU_HF_CONFIRM1_PROINHSMCOTP0C_LEN (2u)

/** \brief  Mask for Ifx_DMU_HF_CONFIRM1_Bits.PROINHSMCOTP0C */
#define IFX_DMU_HF_CONFIRM1_PROINHSMCOTP0C_MSK (0x3u)

/** \brief  Offset for Ifx_DMU_HF_CONFIRM1_Bits.PROINHSMCOTP0C */
#define IFX_DMU_HF_CONFIRM1_PROINHSMCOTP0C_OFF (24u)

/** \brief  Length for Ifx_DMU_HF_CONFIRM1_Bits.PROINHSMCOTP0O */
#define IFX_DMU_HF_CONFIRM1_PROINHSMCOTP0O_LEN (2u)

/** \brief  Mask for Ifx_DMU_HF_CONFIRM1_Bits.PROINHSMCOTP0O */
#define IFX_DMU_HF_CONFIRM1_PROINHSMCOTP0O_MSK (0x3u)

/** \brief  Offset for Ifx_DMU_HF_CONFIRM1_Bits.PROINHSMCOTP0O */
#define IFX_DMU_HF_CONFIRM1_PROINHSMCOTP0O_OFF (8u)

/** \brief  Length for Ifx_DMU_HF_CONFIRM1_Bits.PROINHSMCOTP1C */
#define IFX_DMU_HF_CONFIRM1_PROINHSMCOTP1C_LEN (2u)

/** \brief  Mask for Ifx_DMU_HF_CONFIRM1_Bits.PROINHSMCOTP1C */
#define IFX_DMU_HF_CONFIRM1_PROINHSMCOTP1C_MSK (0x3u)

/** \brief  Offset for Ifx_DMU_HF_CONFIRM1_Bits.PROINHSMCOTP1C */
#define IFX_DMU_HF_CONFIRM1_PROINHSMCOTP1C_OFF (26u)

/** \brief  Length for Ifx_DMU_HF_CONFIRM1_Bits.PROINHSMCOTP1O */
#define IFX_DMU_HF_CONFIRM1_PROINHSMCOTP1O_LEN (2u)

/** \brief  Mask for Ifx_DMU_HF_CONFIRM1_Bits.PROINHSMCOTP1O */
#define IFX_DMU_HF_CONFIRM1_PROINHSMCOTP1O_MSK (0x3u)

/** \brief  Offset for Ifx_DMU_HF_CONFIRM1_Bits.PROINHSMCOTP1O */
#define IFX_DMU_HF_CONFIRM1_PROINHSMCOTP1O_OFF (10u)

/** \brief  Length for Ifx_DMU_HF_CONFIRM1_Bits.PROINHSMO */
#define IFX_DMU_HF_CONFIRM1_PROINHSMO_LEN (2u)

/** \brief  Mask for Ifx_DMU_HF_CONFIRM1_Bits.PROINHSMO */
#define IFX_DMU_HF_CONFIRM1_PROINHSMO_MSK (0x3u)

/** \brief  Offset for Ifx_DMU_HF_CONFIRM1_Bits.PROINHSMO */
#define IFX_DMU_HF_CONFIRM1_PROINHSMO_OFF (6u)

/** \brief  Length for Ifx_DMU_HF_CONFIRM1_Bits.PROINPC */
#define IFX_DMU_HF_CONFIRM1_PROINPC_LEN (2u)

/** \brief  Mask for Ifx_DMU_HF_CONFIRM1_Bits.PROINPC */
#define IFX_DMU_HF_CONFIRM1_PROINPC_MSK (0x3u)

/** \brief  Offset for Ifx_DMU_HF_CONFIRM1_Bits.PROINPC */
#define IFX_DMU_HF_CONFIRM1_PROINPC_OFF (16u)

/** \brief  Length for Ifx_DMU_HF_CONFIRM1_Bits.PROINPO */
#define IFX_DMU_HF_CONFIRM1_PROINPO_LEN (2u)

/** \brief  Mask for Ifx_DMU_HF_CONFIRM1_Bits.PROINPO */
#define IFX_DMU_HF_CONFIRM1_PROINPO_MSK (0x3u)

/** \brief  Offset for Ifx_DMU_HF_CONFIRM1_Bits.PROINPO */
#define IFX_DMU_HF_CONFIRM1_PROINPO_OFF (0u)

/** \brief  Length for Ifx_DMU_HF_CONFIRM2_Bits.PROINOTP0C */
#define IFX_DMU_HF_CONFIRM2_PROINOTP0C_LEN (2u)

/** \brief  Mask for Ifx_DMU_HF_CONFIRM2_Bits.PROINOTP0C */
#define IFX_DMU_HF_CONFIRM2_PROINOTP0C_MSK (0x3u)

/** \brief  Offset for Ifx_DMU_HF_CONFIRM2_Bits.PROINOTP0C */
#define IFX_DMU_HF_CONFIRM2_PROINOTP0C_OFF (16u)

/** \brief  Length for Ifx_DMU_HF_CONFIRM2_Bits.PROINOTP0O */
#define IFX_DMU_HF_CONFIRM2_PROINOTP0O_LEN (2u)

/** \brief  Mask for Ifx_DMU_HF_CONFIRM2_Bits.PROINOTP0O */
#define IFX_DMU_HF_CONFIRM2_PROINOTP0O_MSK (0x3u)

/** \brief  Offset for Ifx_DMU_HF_CONFIRM2_Bits.PROINOTP0O */
#define IFX_DMU_HF_CONFIRM2_PROINOTP0O_OFF (0u)

/** \brief  Length for Ifx_DMU_HF_CONFIRM2_Bits.PROINOTP1C */
#define IFX_DMU_HF_CONFIRM2_PROINOTP1C_LEN (2u)

/** \brief  Mask for Ifx_DMU_HF_CONFIRM2_Bits.PROINOTP1C */
#define IFX_DMU_HF_CONFIRM2_PROINOTP1C_MSK (0x3u)

/** \brief  Offset for Ifx_DMU_HF_CONFIRM2_Bits.PROINOTP1C */
#define IFX_DMU_HF_CONFIRM2_PROINOTP1C_OFF (18u)

/** \brief  Length for Ifx_DMU_HF_CONFIRM2_Bits.PROINOTP1O */
#define IFX_DMU_HF_CONFIRM2_PROINOTP1O_LEN (2u)

/** \brief  Mask for Ifx_DMU_HF_CONFIRM2_Bits.PROINOTP1O */
#define IFX_DMU_HF_CONFIRM2_PROINOTP1O_MSK (0x3u)

/** \brief  Offset for Ifx_DMU_HF_CONFIRM2_Bits.PROINOTP1O */
#define IFX_DMU_HF_CONFIRM2_PROINOTP1O_OFF (2u)

/** \brief  Length for Ifx_DMU_HF_CONFIRM2_Bits.PROINOTP2C */
#define IFX_DMU_HF_CONFIRM2_PROINOTP2C_LEN (2u)

/** \brief  Mask for Ifx_DMU_HF_CONFIRM2_Bits.PROINOTP2C */
#define IFX_DMU_HF_CONFIRM2_PROINOTP2C_MSK (0x3u)

/** \brief  Offset for Ifx_DMU_HF_CONFIRM2_Bits.PROINOTP2C */
#define IFX_DMU_HF_CONFIRM2_PROINOTP2C_OFF (20u)

/** \brief  Length for Ifx_DMU_HF_CONFIRM2_Bits.PROINOTP2O */
#define IFX_DMU_HF_CONFIRM2_PROINOTP2O_LEN (2u)

/** \brief  Mask for Ifx_DMU_HF_CONFIRM2_Bits.PROINOTP2O */
#define IFX_DMU_HF_CONFIRM2_PROINOTP2O_MSK (0x3u)

/** \brief  Offset for Ifx_DMU_HF_CONFIRM2_Bits.PROINOTP2O */
#define IFX_DMU_HF_CONFIRM2_PROINOTP2O_OFF (4u)

/** \brief  Length for Ifx_DMU_HF_CONFIRM2_Bits.PROINOTP3C */
#define IFX_DMU_HF_CONFIRM2_PROINOTP3C_LEN (2u)

/** \brief  Mask for Ifx_DMU_HF_CONFIRM2_Bits.PROINOTP3C */
#define IFX_DMU_HF_CONFIRM2_PROINOTP3C_MSK (0x3u)

/** \brief  Offset for Ifx_DMU_HF_CONFIRM2_Bits.PROINOTP3C */
#define IFX_DMU_HF_CONFIRM2_PROINOTP3C_OFF (22u)

/** \brief  Length for Ifx_DMU_HF_CONFIRM2_Bits.PROINOTP3O */
#define IFX_DMU_HF_CONFIRM2_PROINOTP3O_LEN (2u)

/** \brief  Mask for Ifx_DMU_HF_CONFIRM2_Bits.PROINOTP3O */
#define IFX_DMU_HF_CONFIRM2_PROINOTP3O_MSK (0x3u)

/** \brief  Offset for Ifx_DMU_HF_CONFIRM2_Bits.PROINOTP3O */
#define IFX_DMU_HF_CONFIRM2_PROINOTP3O_OFF (6u)

/** \brief  Length for Ifx_DMU_HF_CONFIRM2_Bits.PROINOTP4C */
#define IFX_DMU_HF_CONFIRM2_PROINOTP4C_LEN (2u)

/** \brief  Mask for Ifx_DMU_HF_CONFIRM2_Bits.PROINOTP4C */
#define IFX_DMU_HF_CONFIRM2_PROINOTP4C_MSK (0x3u)

/** \brief  Offset for Ifx_DMU_HF_CONFIRM2_Bits.PROINOTP4C */
#define IFX_DMU_HF_CONFIRM2_PROINOTP4C_OFF (24u)

/** \brief  Length for Ifx_DMU_HF_CONFIRM2_Bits.PROINOTP4O */
#define IFX_DMU_HF_CONFIRM2_PROINOTP4O_LEN (2u)

/** \brief  Mask for Ifx_DMU_HF_CONFIRM2_Bits.PROINOTP4O */
#define IFX_DMU_HF_CONFIRM2_PROINOTP4O_MSK (0x3u)

/** \brief  Offset for Ifx_DMU_HF_CONFIRM2_Bits.PROINOTP4O */
#define IFX_DMU_HF_CONFIRM2_PROINOTP4O_OFF (8u)

/** \brief  Length for Ifx_DMU_HF_CONFIRM2_Bits.PROINOTP5C */
#define IFX_DMU_HF_CONFIRM2_PROINOTP5C_LEN (2u)

/** \brief  Mask for Ifx_DMU_HF_CONFIRM2_Bits.PROINOTP5C */
#define IFX_DMU_HF_CONFIRM2_PROINOTP5C_MSK (0x3u)

/** \brief  Offset for Ifx_DMU_HF_CONFIRM2_Bits.PROINOTP5C */
#define IFX_DMU_HF_CONFIRM2_PROINOTP5C_OFF (26u)

/** \brief  Length for Ifx_DMU_HF_CONFIRM2_Bits.PROINOTP5O */
#define IFX_DMU_HF_CONFIRM2_PROINOTP5O_LEN (2u)

/** \brief  Mask for Ifx_DMU_HF_CONFIRM2_Bits.PROINOTP5O */
#define IFX_DMU_HF_CONFIRM2_PROINOTP5O_MSK (0x3u)

/** \brief  Offset for Ifx_DMU_HF_CONFIRM2_Bits.PROINOTP5O */
#define IFX_DMU_HF_CONFIRM2_PROINOTP5O_OFF (10u)

/** \brief  Length for Ifx_DMU_HF_CONFIRM2_Bits.PROINOTP6C */
#define IFX_DMU_HF_CONFIRM2_PROINOTP6C_LEN (2u)

/** \brief  Mask for Ifx_DMU_HF_CONFIRM2_Bits.PROINOTP6C */
#define IFX_DMU_HF_CONFIRM2_PROINOTP6C_MSK (0x3u)

/** \brief  Offset for Ifx_DMU_HF_CONFIRM2_Bits.PROINOTP6C */
#define IFX_DMU_HF_CONFIRM2_PROINOTP6C_OFF (28u)

/** \brief  Length for Ifx_DMU_HF_CONFIRM2_Bits.PROINOTP6O */
#define IFX_DMU_HF_CONFIRM2_PROINOTP6O_LEN (2u)

/** \brief  Mask for Ifx_DMU_HF_CONFIRM2_Bits.PROINOTP6O */
#define IFX_DMU_HF_CONFIRM2_PROINOTP6O_MSK (0x3u)

/** \brief  Offset for Ifx_DMU_HF_CONFIRM2_Bits.PROINOTP6O */
#define IFX_DMU_HF_CONFIRM2_PROINOTP6O_OFF (12u)

/** \brief  Length for Ifx_DMU_HF_CONFIRM2_Bits.PROINOTP7C */
#define IFX_DMU_HF_CONFIRM2_PROINOTP7C_LEN (2u)

/** \brief  Mask for Ifx_DMU_HF_CONFIRM2_Bits.PROINOTP7C */
#define IFX_DMU_HF_CONFIRM2_PROINOTP7C_MSK (0x3u)

/** \brief  Offset for Ifx_DMU_HF_CONFIRM2_Bits.PROINOTP7C */
#define IFX_DMU_HF_CONFIRM2_PROINOTP7C_OFF (30u)

/** \brief  Length for Ifx_DMU_HF_CONFIRM2_Bits.PROINOTP7O */
#define IFX_DMU_HF_CONFIRM2_PROINOTP7O_LEN (2u)

/** \brief  Mask for Ifx_DMU_HF_CONFIRM2_Bits.PROINOTP7O */
#define IFX_DMU_HF_CONFIRM2_PROINOTP7O_MSK (0x3u)

/** \brief  Offset for Ifx_DMU_HF_CONFIRM2_Bits.PROINOTP7O */
#define IFX_DMU_HF_CONFIRM2_PROINOTP7O_OFF (14u)

