Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxDmu_bf.h
/** \brief  Length for Ifx_DMU_HF_CONTROL_Bits.CERASE */
#define IFX_DMU_HF_CONTROL_CERASE_LEN (1u)

/** \brief  Mask for Ifx_DMU_HF_CONTROL_Bits.CERASE */
#define IFX_DMU_HF_CONTROL_CERASE_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HF_CONTROL_Bits.CERASE */
#define IFX_DMU_HF_CONTROL_CERASE_OFF (17u)

/** \brief  Length for Ifx_DMU_HF_CONTROL_Bits.CPROG */
#define IFX_DMU_HF_CONTROL_CPROG_LEN (1u)

/** \brief  Mask for Ifx_DMU_HF_CONTROL_Bits.CPROG */
#define IFX_DMU_HF_CONTROL_CPROG_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HF_CONTROL_Bits.CPROG */
#define IFX_DMU_HF_CONTROL_CPROG_OFF (16u)

/** \brief  Length for Ifx_DMU_HF_CONTROL_Bits.CUSER */
#define IFX_DMU_HF_CONTROL_CUSER_LEN (1u)

/** \brief  Mask for Ifx_DMU_HF_CONTROL_Bits.CUSER */
#define IFX_DMU_HF_CONTROL_CUSER_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HF_CONTROL_Bits.CUSER */
#define IFX_DMU_HF_CONTROL_CUSER_OFF (18u)

/** \brief  Length for Ifx_DMU_HF_CONTROL_Bits.DDFD */
#define IFX_DMU_HF_CONTROL_DDFD_LEN (1u)

/** \brief  Mask for Ifx_DMU_HF_CONTROL_Bits.DDFD */
#define IFX_DMU_HF_CONTROL_DDFD_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HF_CONTROL_Bits.DDFD */
#define IFX_DMU_HF_CONTROL_DDFD_OFF (9u)

/** \brief  Length for Ifx_DMU_HF_CONTROL_Bits.DDFP */
#define IFX_DMU_HF_CONTROL_DDFP_LEN (1u)

/** \brief  Mask for Ifx_DMU_HF_CONTROL_Bits.DDFP */
#define IFX_DMU_HF_CONTROL_DDFP_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HF_CONTROL_Bits.DDFP */
#define IFX_DMU_HF_CONTROL_DDFP_OFF (8u)

/** \brief  Length for Ifx_DMU_HF_CONTROL_Bits.FSIENPE */
#define IFX_DMU_HF_CONTROL_FSIENPE_LEN (2u)

/** \brief  Mask for Ifx_DMU_HF_CONTROL_Bits.FSIENPE */
#define IFX_DMU_HF_CONTROL_FSIENPE_MSK (0x3u)

/** \brief  Offset for Ifx_DMU_HF_CONTROL_Bits.FSIENPE */
#define IFX_DMU_HF_CONTROL_FSIENPE_OFF (4u)

/** \brief  Length for Ifx_DMU_HF_CONTROL_Bits.FSISTART */
#define IFX_DMU_HF_CONTROL_FSISTART_LEN (3u)

/** \brief  Mask for Ifx_DMU_HF_CONTROL_Bits.FSISTART */
#define IFX_DMU_HF_CONTROL_FSISTART_MSK (0x7u)

/** \brief  Offset for Ifx_DMU_HF_CONTROL_Bits.FSISTART */
#define IFX_DMU_HF_CONTROL_FSISTART_OFF (0u)

/** \brief  Length for Ifx_DMU_HF_DSIZE_Bits.DF0 */
#define IFX_DMU_HF_DSIZE_DF0_LEN (4u)

/** \brief  Mask for Ifx_DMU_HF_DSIZE_Bits.DF0 */
#define IFX_DMU_HF_DSIZE_DF0_MSK (0xfu)

/** \brief  Offset for Ifx_DMU_HF_DSIZE_Bits.DF0 */
#define IFX_DMU_HF_DSIZE_DF0_OFF (5u)

/** \brief  Length for Ifx_DMU_HF_DSIZE_Bits.DF1 */
#define IFX_DMU_HF_DSIZE_DF1_LEN (1u)

/** \brief  Mask for Ifx_DMU_HF_DSIZE_Bits.DF1 */
#define IFX_DMU_HF_DSIZE_DF1_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HF_DSIZE_Bits.DF1 */
#define IFX_DMU_HF_DSIZE_DF1_OFF (21u)

/** \brief  Length for Ifx_DMU_HF_DWAIT_Bits.RECC */
#define IFX_DMU_HF_DWAIT_RECC_LEN (3u)

/** \brief  Mask for Ifx_DMU_HF_DWAIT_Bits.RECC */
#define IFX_DMU_HF_DWAIT_RECC_MSK (0x7u)

/** \brief  Offset for Ifx_DMU_HF_DWAIT_Bits.RECC */
#define IFX_DMU_HF_DWAIT_RECC_OFF (16u)

/** \brief  Length for Ifx_DMU_HF_DWAIT_Bits.RFLASH1 */
#define IFX_DMU_HF_DWAIT_RFLASH1_LEN (8u)

/** \brief  Mask for Ifx_DMU_HF_DWAIT_Bits.RFLASH1 */
#define IFX_DMU_HF_DWAIT_RFLASH1_MSK (0xffu)

/** \brief  Offset for Ifx_DMU_HF_DWAIT_Bits.RFLASH1 */
#define IFX_DMU_HF_DWAIT_RFLASH1_OFF (0u)

/** \brief  Length for Ifx_DMU_HF_DWAIT_Bits.RFLASH2 */
#define IFX_DMU_HF_DWAIT_RFLASH2_LEN (8u)

/** \brief  Mask for Ifx_DMU_HF_DWAIT_Bits.RFLASH2 */
#define IFX_DMU_HF_DWAIT_RFLASH2_MSK (0xffu)

/** \brief  Offset for Ifx_DMU_HF_DWAIT_Bits.RFLASH2 */
#define IFX_DMU_HF_DWAIT_RFLASH2_OFF (8u)

/** \brief  Length for Ifx_DMU_HF_ECCC_Bits.CLR */
#define IFX_DMU_HF_ECCC_CLR_LEN (2u)

/** \brief  Mask for Ifx_DMU_HF_ECCC_Bits.CLR */
#define IFX_DMU_HF_ECCC_CLR_MSK (0x3u)

/** \brief  Offset for Ifx_DMU_HF_ECCC_Bits.CLR */
#define IFX_DMU_HF_ECCC_CLR_OFF (0u)

/** \brief  Length for Ifx_DMU_HF_ECCC_Bits.ECCCORDIS */
#define IFX_DMU_HF_ECCC_ECCCORDIS_LEN (2u)

/** \brief  Mask for Ifx_DMU_HF_ECCC_Bits.ECCCORDIS */
#define IFX_DMU_HF_ECCC_ECCCORDIS_MSK (0x3u)

/** \brief  Offset for Ifx_DMU_HF_ECCC_Bits.ECCCORDIS */
#define IFX_DMU_HF_ECCC_ECCCORDIS_OFF (28u)

/** \brief  Length for Ifx_DMU_HF_ECCC_Bits.TRAPDIS */
#define IFX_DMU_HF_ECCC_TRAPDIS_LEN (2u)

/** \brief  Mask for Ifx_DMU_HF_ECCC_Bits.TRAPDIS */
#define IFX_DMU_HF_ECCC_TRAPDIS_MSK (0x3u)

/** \brief  Offset for Ifx_DMU_HF_ECCC_Bits.TRAPDIS */
#define IFX_DMU_HF_ECCC_TRAPDIS_OFF (30u)

/** \brief  Length for Ifx_DMU_HF_ECCR_Bits.RCODE */
#define IFX_DMU_HF_ECCR_RCODE_LEN (22u)

/** \brief  Mask for Ifx_DMU_HF_ECCR_Bits.RCODE */
#define IFX_DMU_HF_ECCR_RCODE_MSK (0x3fffffu)

/** \brief  Offset for Ifx_DMU_HF_ECCR_Bits.RCODE */
#define IFX_DMU_HF_ECCR_RCODE_OFF (0u)

/** \brief  Length for Ifx_DMU_HF_ECCR_Bits.RED */
#define IFX_DMU_HF_ECCR_RED_LEN (2u)

/** \brief  Mask for Ifx_DMU_HF_ECCR_Bits.RED */
#define IFX_DMU_HF_ECCR_RED_MSK (0x3u)

/** \brief  Offset for Ifx_DMU_HF_ECCR_Bits.RED */
#define IFX_DMU_HF_ECCR_RED_OFF (22u)

/** \brief  Length for Ifx_DMU_HF_ECCS_Bits.ABLANKA */
#define IFX_DMU_HF_ECCS_ABLANKA_LEN (1u)

/** \brief  Mask for Ifx_DMU_HF_ECCS_Bits.ABLANKA */
#define IFX_DMU_HF_ECCS_ABLANKA_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HF_ECCS_Bits.ABLANKA */
#define IFX_DMU_HF_ECCS_ABLANKA_OFF (25u)

/** \brief  Length for Ifx_DMU_HF_ECCS_Bits.ABLANKD */
#define IFX_DMU_HF_ECCS_ABLANKD_LEN (1u)

/** \brief  Mask for Ifx_DMU_HF_ECCS_Bits.ABLANKD */
#define IFX_DMU_HF_ECCS_ABLANKD_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HF_ECCS_Bits.ABLANKD */
#define IFX_DMU_HF_ECCS_ABLANKD_OFF (24u)

/** \brief  Length for Ifx_DMU_HF_ECCS_Bits.AER1 */
#define IFX_DMU_HF_ECCS_AER1_LEN (1u)

/** \brief  Mask for Ifx_DMU_HF_ECCS_Bits.AER1 */
#define IFX_DMU_HF_ECCS_AER1_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HF_ECCS_Bits.AER1 */
#define IFX_DMU_HF_ECCS_AER1_OFF (16u)

/** \brief  Length for Ifx_DMU_HF_ECCS_Bits.AER2 */
#define IFX_DMU_HF_ECCS_AER2_LEN (1u)

/** \brief  Mask for Ifx_DMU_HF_ECCS_Bits.AER2 */
#define IFX_DMU_HF_ECCS_AER2_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HF_ECCS_Bits.AER2 */
#define IFX_DMU_HF_ECCS_AER2_OFF (17u)

