Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxDmu_bf.h
/** \brief  Length for Ifx_DMU_HF_ECCS_Bits.AER3 */
#define IFX_DMU_HF_ECCS_AER3_LEN (1u)

/** \brief  Mask for Ifx_DMU_HF_ECCS_Bits.AER3 */
#define IFX_DMU_HF_ECCS_AER3_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HF_ECCS_Bits.AER3 */
#define IFX_DMU_HF_ECCS_AER3_OFF (18u)

/** \brief  Length for Ifx_DMU_HF_ECCS_Bits.AERANY */
#define IFX_DMU_HF_ECCS_AERANY_LEN (1u)

/** \brief  Mask for Ifx_DMU_HF_ECCS_Bits.AERANY */
#define IFX_DMU_HF_ECCS_AERANY_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HF_ECCS_Bits.AERANY */
#define IFX_DMU_HF_ECCS_AERANY_OFF (23u)

/** \brief  Length for Ifx_DMU_HF_ECCS_Bits.AERM */
#define IFX_DMU_HF_ECCS_AERM_LEN (1u)

/** \brief  Mask for Ifx_DMU_HF_ECCS_Bits.AERM */
#define IFX_DMU_HF_ECCS_AERM_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HF_ECCS_Bits.AERM */
#define IFX_DMU_HF_ECCS_AERM_OFF (19u)

/** \brief  Length for Ifx_DMU_HF_ECCS_Bits.BLANKA */
#define IFX_DMU_HF_ECCS_BLANKA_LEN (1u)

/** \brief  Mask for Ifx_DMU_HF_ECCS_Bits.BLANKA */
#define IFX_DMU_HF_ECCS_BLANKA_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HF_ECCS_Bits.BLANKA */
#define IFX_DMU_HF_ECCS_BLANKA_OFF (9u)

/** \brief  Length for Ifx_DMU_HF_ECCS_Bits.BLANKD */
#define IFX_DMU_HF_ECCS_BLANKD_LEN (1u)

/** \brief  Mask for Ifx_DMU_HF_ECCS_Bits.BLANKD */
#define IFX_DMU_HF_ECCS_BLANKD_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HF_ECCS_Bits.BLANKD */
#define IFX_DMU_HF_ECCS_BLANKD_OFF (8u)

/** \brief  Length for Ifx_DMU_HF_ECCS_Bits.ERR1 */
#define IFX_DMU_HF_ECCS_ERR1_LEN (1u)

/** \brief  Mask for Ifx_DMU_HF_ECCS_Bits.ERR1 */
#define IFX_DMU_HF_ECCS_ERR1_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HF_ECCS_Bits.ERR1 */
#define IFX_DMU_HF_ECCS_ERR1_OFF (0u)

/** \brief  Length for Ifx_DMU_HF_ECCS_Bits.ERR2 */
#define IFX_DMU_HF_ECCS_ERR2_LEN (1u)

/** \brief  Mask for Ifx_DMU_HF_ECCS_Bits.ERR2 */
#define IFX_DMU_HF_ECCS_ERR2_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HF_ECCS_Bits.ERR2 */
#define IFX_DMU_HF_ECCS_ERR2_OFF (1u)

/** \brief  Length for Ifx_DMU_HF_ECCS_Bits.ERR3 */
#define IFX_DMU_HF_ECCS_ERR3_LEN (1u)

/** \brief  Mask for Ifx_DMU_HF_ECCS_Bits.ERR3 */
#define IFX_DMU_HF_ECCS_ERR3_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HF_ECCS_Bits.ERR3 */
#define IFX_DMU_HF_ECCS_ERR3_OFF (2u)

/** \brief  Length for Ifx_DMU_HF_ECCS_Bits.ERRANY */
#define IFX_DMU_HF_ECCS_ERRANY_LEN (1u)

/** \brief  Mask for Ifx_DMU_HF_ECCS_Bits.ERRANY */
#define IFX_DMU_HF_ECCS_ERRANY_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HF_ECCS_Bits.ERRANY */
#define IFX_DMU_HF_ECCS_ERRANY_OFF (7u)

/** \brief  Length for Ifx_DMU_HF_ECCS_Bits.ERRM */
#define IFX_DMU_HF_ECCS_ERRM_LEN (1u)

/** \brief  Mask for Ifx_DMU_HF_ECCS_Bits.ERRM */
#define IFX_DMU_HF_ECCS_ERRM_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HF_ECCS_Bits.ERRM */
#define IFX_DMU_HF_ECCS_ERRM_OFF (3u)

/** \brief  Length for Ifx_DMU_HF_ECCW_Bits.DECENCDIS */
#define IFX_DMU_HF_ECCW_DECENCDIS_LEN (2u)

/** \brief  Mask for Ifx_DMU_HF_ECCW_Bits.DECENCDIS */
#define IFX_DMU_HF_ECCW_DECENCDIS_MSK (0x3u)

/** \brief  Offset for Ifx_DMU_HF_ECCW_Bits.DECENCDIS */
#define IFX_DMU_HF_ECCW_DECENCDIS_OFF (30u)

/** \brief  Length for Ifx_DMU_HF_ECCW_Bits.PECENCDIS */
#define IFX_DMU_HF_ECCW_PECENCDIS_LEN (2u)

/** \brief  Mask for Ifx_DMU_HF_ECCW_Bits.PECENCDIS */
#define IFX_DMU_HF_ECCW_PECENCDIS_MSK (0x3u)

/** \brief  Offset for Ifx_DMU_HF_ECCW_Bits.PECENCDIS */
#define IFX_DMU_HF_ECCW_PECENCDIS_OFF (28u)

/** \brief  Length for Ifx_DMU_HF_ECCW_Bits.WCODE */
#define IFX_DMU_HF_ECCW_WCODE_LEN (22u)

/** \brief  Mask for Ifx_DMU_HF_ECCW_Bits.WCODE */
#define IFX_DMU_HF_ECCW_WCODE_MSK (0x3fffffu)

/** \brief  Offset for Ifx_DMU_HF_ECCW_Bits.WCODE */
#define IFX_DMU_HF_ECCW_WCODE_OFF (0u)

/** \brief  Length for Ifx_DMU_HF_EER_Bits.EOBM */
#define IFX_DMU_HF_EER_EOBM_LEN (1u)

/** \brief  Mask for Ifx_DMU_HF_EER_Bits.EOBM */
#define IFX_DMU_HF_EER_EOBM_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HF_EER_Bits.EOBM */
#define IFX_DMU_HF_EER_EOBM_OFF (31u)

/** \brief  Length for Ifx_DMU_HF_EER_Bits.EVERM */
#define IFX_DMU_HF_EER_EVERM_LEN (1u)

/** \brief  Mask for Ifx_DMU_HF_EER_Bits.EVERM */
#define IFX_DMU_HF_EER_EVERM_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HF_EER_Bits.EVERM */
#define IFX_DMU_HF_EER_EVERM_OFF (4u)

/** \brief  Length for Ifx_DMU_HF_EER_Bits.OPERM */
#define IFX_DMU_HF_EER_OPERM_LEN (1u)

/** \brief  Mask for Ifx_DMU_HF_EER_Bits.OPERM */
#define IFX_DMU_HF_EER_OPERM_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HF_EER_Bits.OPERM */
#define IFX_DMU_HF_EER_OPERM_OFF (0u)

/** \brief  Length for Ifx_DMU_HF_EER_Bits.PROERM */
#define IFX_DMU_HF_EER_PROERM_LEN (1u)

/** \brief  Mask for Ifx_DMU_HF_EER_Bits.PROERM */
#define IFX_DMU_HF_EER_PROERM_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HF_EER_Bits.PROERM */
#define IFX_DMU_HF_EER_PROERM_OFF (2u)

/** \brief  Length for Ifx_DMU_HF_EER_Bits.PVERM */
#define IFX_DMU_HF_EER_PVERM_LEN (1u)

/** \brief  Mask for Ifx_DMU_HF_EER_Bits.PVERM */
#define IFX_DMU_HF_EER_PVERM_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HF_EER_Bits.PVERM */
#define IFX_DMU_HF_EER_PVERM_OFF (3u)

/** \brief  Length for Ifx_DMU_HF_EER_Bits.SQERM */
#define IFX_DMU_HF_EER_SQERM_LEN (1u)

/** \brief  Mask for Ifx_DMU_HF_EER_Bits.SQERM */
#define IFX_DMU_HF_EER_SQERM_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HF_EER_Bits.SQERM */
#define IFX_DMU_HF_EER_SQERM_OFF (1u)

/** \brief  Length for Ifx_DMU_HF_ERRSR_Bits.ADER */
#define IFX_DMU_HF_ERRSR_ADER_LEN (1u)

/** \brief  Mask for Ifx_DMU_HF_ERRSR_Bits.ADER */
#define IFX_DMU_HF_ERRSR_ADER_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HF_ERRSR_Bits.ADER */
#define IFX_DMU_HF_ERRSR_ADER_OFF (5u)

/** \brief  Length for Ifx_DMU_HF_ERRSR_Bits.EVER */
#define IFX_DMU_HF_ERRSR_EVER_LEN (1u)

/** \brief  Mask for Ifx_DMU_HF_ERRSR_Bits.EVER */
#define IFX_DMU_HF_ERRSR_EVER_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HF_ERRSR_Bits.EVER */
#define IFX_DMU_HF_ERRSR_EVER_OFF (4u)

/** \brief  Length for Ifx_DMU_HF_ERRSR_Bits.OPER */
#define IFX_DMU_HF_ERRSR_OPER_LEN (1u)

/** \brief  Mask for Ifx_DMU_HF_ERRSR_Bits.OPER */
#define IFX_DMU_HF_ERRSR_OPER_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HF_ERRSR_Bits.OPER */
#define IFX_DMU_HF_ERRSR_OPER_OFF (0u)

