Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxDmu_bf.h
/** \brief  Length for Ifx_DMU_HF_ERRSR_Bits.ORIER */
#define IFX_DMU_HF_ERRSR_ORIER_LEN (1u)

/** \brief  Mask for Ifx_DMU_HF_ERRSR_Bits.ORIER */
#define IFX_DMU_HF_ERRSR_ORIER_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HF_ERRSR_Bits.ORIER */
#define IFX_DMU_HF_ERRSR_ORIER_OFF (6u)

/** \brief  Length for Ifx_DMU_HF_ERRSR_Bits.PROER */
#define IFX_DMU_HF_ERRSR_PROER_LEN (1u)

/** \brief  Mask for Ifx_DMU_HF_ERRSR_Bits.PROER */
#define IFX_DMU_HF_ERRSR_PROER_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HF_ERRSR_Bits.PROER */
#define IFX_DMU_HF_ERRSR_PROER_OFF (2u)

/** \brief  Length for Ifx_DMU_HF_ERRSR_Bits.PVER */
#define IFX_DMU_HF_ERRSR_PVER_LEN (1u)

/** \brief  Mask for Ifx_DMU_HF_ERRSR_Bits.PVER */
#define IFX_DMU_HF_ERRSR_PVER_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HF_ERRSR_Bits.PVER */
#define IFX_DMU_HF_ERRSR_PVER_OFF (3u)

/** \brief  Length for Ifx_DMU_HF_ERRSR_Bits.PWRER */
#define IFX_DMU_HF_ERRSR_PWRER_LEN (1u)

/** \brief  Mask for Ifx_DMU_HF_ERRSR_Bits.PWRER */
#define IFX_DMU_HF_ERRSR_PWRER_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HF_ERRSR_Bits.PWRER */
#define IFX_DMU_HF_ERRSR_PWRER_OFF (7u)

/** \brief  Length for Ifx_DMU_HF_ERRSR_Bits.SQER */
#define IFX_DMU_HF_ERRSR_SQER_LEN (1u)

/** \brief  Mask for Ifx_DMU_HF_ERRSR_Bits.SQER */
#define IFX_DMU_HF_ERRSR_SQER_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HF_ERRSR_Bits.SQER */
#define IFX_DMU_HF_ERRSR_SQER_OFF (1u)

/** \brief  Length for Ifx_DMU_HF_ID_Bits.FLASH_REV */
#define IFX_DMU_HF_ID_FLASH_REV_LEN (8u)

/** \brief  Mask for Ifx_DMU_HF_ID_Bits.FLASH_REV */
#define IFX_DMU_HF_ID_FLASH_REV_MSK (0xffu)

/** \brief  Offset for Ifx_DMU_HF_ID_Bits.FLASH_REV */
#define IFX_DMU_HF_ID_FLASH_REV_OFF (24u)

/** \brief  Length for Ifx_DMU_HF_ID_Bits.MOD_NUMBER */
#define IFX_DMU_HF_ID_MOD_NUMBER_LEN (8u)

/** \brief  Mask for Ifx_DMU_HF_ID_Bits.MOD_NUMBER */
#define IFX_DMU_HF_ID_MOD_NUMBER_MSK (0xffu)

/** \brief  Offset for Ifx_DMU_HF_ID_Bits.MOD_NUMBER */
#define IFX_DMU_HF_ID_MOD_NUMBER_OFF (16u)

/** \brief  Length for Ifx_DMU_HF_ID_Bits.MOD_REV */
#define IFX_DMU_HF_ID_MOD_REV_LEN (8u)

/** \brief  Mask for Ifx_DMU_HF_ID_Bits.MOD_REV */
#define IFX_DMU_HF_ID_MOD_REV_MSK (0xffu)

/** \brief  Offset for Ifx_DMU_HF_ID_Bits.MOD_REV */
#define IFX_DMU_HF_ID_MOD_REV_OFF (0u)

/** \brief  Length for Ifx_DMU_HF_ID_Bits.MOD_TYPE */
#define IFX_DMU_HF_ID_MOD_TYPE_LEN (8u)

/** \brief  Mask for Ifx_DMU_HF_ID_Bits.MOD_TYPE */
#define IFX_DMU_HF_ID_MOD_TYPE_MSK (0xffu)

/** \brief  Offset for Ifx_DMU_HF_ID_Bits.MOD_TYPE */
#define IFX_DMU_HF_ID_MOD_TYPE_OFF (8u)

/** \brief  Length for Ifx_DMU_HF_MARGIN_Bits.HMARGIN */
#define IFX_DMU_HF_MARGIN_HMARGIN_LEN (1u)

/** \brief  Mask for Ifx_DMU_HF_MARGIN_Bits.HMARGIN */
#define IFX_DMU_HF_MARGIN_HMARGIN_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HF_MARGIN_Bits.HMARGIN */
#define IFX_DMU_HF_MARGIN_HMARGIN_OFF (8u)

/** \brief  Length for Ifx_DMU_HF_MARGIN_Bits.SELD0 */
#define IFX_DMU_HF_MARGIN_SELD0_LEN (2u)

/** \brief  Mask for Ifx_DMU_HF_MARGIN_Bits.SELD0 */
#define IFX_DMU_HF_MARGIN_SELD0_MSK (0x3u)

/** \brief  Offset for Ifx_DMU_HF_MARGIN_Bits.SELD0 */
#define IFX_DMU_HF_MARGIN_SELD0_OFF (0u)

/** \brief  Length for Ifx_DMU_HF_OPERATION_Bits.BOOTSTAT */
#define IFX_DMU_HF_OPERATION_BOOTSTAT_LEN (3u)

/** \brief  Mask for Ifx_DMU_HF_OPERATION_Bits.BOOTSTAT */
#define IFX_DMU_HF_OPERATION_BOOTSTAT_MSK (0x7u)

/** \brief  Offset for Ifx_DMU_HF_OPERATION_Bits.BOOTSTAT */
#define IFX_DMU_HF_OPERATION_BOOTSTAT_OFF (8u)

/** \brief  Length for Ifx_DMU_HF_OPERATION_Bits.ERASE */
#define IFX_DMU_HF_OPERATION_ERASE_LEN (1u)

/** \brief  Mask for Ifx_DMU_HF_OPERATION_Bits.ERASE */
#define IFX_DMU_HF_OPERATION_ERASE_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HF_OPERATION_Bits.ERASE */
#define IFX_DMU_HF_OPERATION_ERASE_OFF (1u)

/** \brief  Length for Ifx_DMU_HF_OPERATION_Bits.PROG */
#define IFX_DMU_HF_OPERATION_PROG_LEN (1u)

/** \brief  Mask for Ifx_DMU_HF_OPERATION_Bits.PROG */
#define IFX_DMU_HF_OPERATION_PROG_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HF_OPERATION_Bits.PROG */
#define IFX_DMU_HF_OPERATION_PROG_OFF (0u)

/** \brief  Length for Ifx_DMU_HF_OPERATION_Bits.USER */
#define IFX_DMU_HF_OPERATION_USER_LEN (1u)

/** \brief  Mask for Ifx_DMU_HF_OPERATION_Bits.USER */
#define IFX_DMU_HF_OPERATION_USER_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HF_OPERATION_Bits.USER */
#define IFX_DMU_HF_OPERATION_USER_OFF (2u)

/** \brief  Length for Ifx_DMU_HF_PCONTROL_Bits.DEMAND */
#define IFX_DMU_HF_PCONTROL_DEMAND_LEN (2u)

/** \brief  Mask for Ifx_DMU_HF_PCONTROL_Bits.DEMAND */
#define IFX_DMU_HF_PCONTROL_DEMAND_MSK (0x3u)

/** \brief  Offset for Ifx_DMU_HF_PCONTROL_Bits.DEMAND */
#define IFX_DMU_HF_PCONTROL_DEMAND_OFF (10u)

/** \brief  Length for Ifx_DMU_HF_PCONTROL_Bits.ESLDIS */
#define IFX_DMU_HF_PCONTROL_ESLDIS_LEN (2u)

/** \brief  Mask for Ifx_DMU_HF_PCONTROL_Bits.ESLDIS */
#define IFX_DMU_HF_PCONTROL_ESLDIS_MSK (0x3u)

/** \brief  Offset for Ifx_DMU_HF_PCONTROL_Bits.ESLDIS */
#define IFX_DMU_HF_PCONTROL_ESLDIS_OFF (16u)

/** \brief  Length for Ifx_DMU_HF_PCONTROL_Bits.IDLE */
#define IFX_DMU_HF_PCONTROL_IDLE_LEN (2u)

/** \brief  Mask for Ifx_DMU_HF_PCONTROL_Bits.IDLE */
#define IFX_DMU_HF_PCONTROL_IDLE_MSK (0x3u)

/** \brief  Offset for Ifx_DMU_HF_PCONTROL_Bits.IDLE */
#define IFX_DMU_HF_PCONTROL_IDLE_OFF (8u)

/** \brief  Length for Ifx_DMU_HF_PCONTROL_Bits.PR5V */
#define IFX_DMU_HF_PCONTROL_PR5V_LEN (2u)

/** \brief  Mask for Ifx_DMU_HF_PCONTROL_Bits.PR5V */
#define IFX_DMU_HF_PCONTROL_PR5V_MSK (0x3u)

/** \brief  Offset for Ifx_DMU_HF_PCONTROL_Bits.PR5V */
#define IFX_DMU_HF_PCONTROL_PR5V_OFF (30u)

/** \brief  Length for Ifx_DMU_HF_PCONTROL_Bits.SLEEP */
#define IFX_DMU_HF_PCONTROL_SLEEP_LEN (2u)

/** \brief  Mask for Ifx_DMU_HF_PCONTROL_Bits.SLEEP */
#define IFX_DMU_HF_PCONTROL_SLEEP_MSK (0x3u)

/** \brief  Offset for Ifx_DMU_HF_PCONTROL_Bits.SLEEP */
#define IFX_DMU_HF_PCONTROL_SLEEP_OFF (0u)

/** \brief  Length for Ifx_DMU_HF_PROCONDBG_Bits.DBGIFLCK */
#define IFX_DMU_HF_PROCONDBG_DBGIFLCK_LEN (1u)

/** \brief  Mask for Ifx_DMU_HF_PROCONDBG_Bits.DBGIFLCK */
#define IFX_DMU_HF_PROCONDBG_DBGIFLCK_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HF_PROCONDBG_Bits.DBGIFLCK */
#define IFX_DMU_HF_PROCONDBG_DBGIFLCK_OFF (1u)

/** \brief  Length for Ifx_DMU_HF_PROCONDBG_Bits.EDM */
#define IFX_DMU_HF_PROCONDBG_EDM_LEN (2u)

/** \brief  Mask for Ifx_DMU_HF_PROCONDBG_Bits.EDM */
#define IFX_DMU_HF_PROCONDBG_EDM_MSK (0x3u)

/** \brief  Offset for Ifx_DMU_HF_PROCONDBG_Bits.EDM */
#define IFX_DMU_HF_PROCONDBG_EDM_OFF (2u)

/** \brief  Length for Ifx_DMU_HF_PROCONDBG_Bits.OCDSDIS */
#define IFX_DMU_HF_PROCONDBG_OCDSDIS_LEN (1u)

/** \brief  Mask for Ifx_DMU_HF_PROCONDBG_Bits.OCDSDIS */
#define IFX_DMU_HF_PROCONDBG_OCDSDIS_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HF_PROCONDBG_Bits.OCDSDIS */
#define IFX_DMU_HF_PROCONDBG_OCDSDIS_OFF (0u)

/** \brief  Length for Ifx_DMU_HF_PROCONDBG_Bits.TIC */
#define IFX_DMU_HF_PROCONDBG_TIC_LEN (4u)

/** \brief  Mask for Ifx_DMU_HF_PROCONDBG_Bits.TIC */
#define IFX_DMU_HF_PROCONDBG_TIC_MSK (0xfu)

/** \brief  Offset for Ifx_DMU_HF_PROCONDBG_Bits.TIC */
#define IFX_DMU_HF_PROCONDBG_TIC_OFF (8u)

/** \brief  Length for Ifx_DMU_HF_PROCONDBG_Bits.UCB */
#define IFX_DMU_HF_PROCONDBG_UCB_LEN (4u)

/** \brief  Mask for Ifx_DMU_HF_PROCONDBG_Bits.UCB */
#define IFX_DMU_HF_PROCONDBG_UCB_MSK (0xfu)

/** \brief  Offset for Ifx_DMU_HF_PROCONDBG_Bits.UCB */
#define IFX_DMU_HF_PROCONDBG_UCB_OFF (4u)

