Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxDmu_bf.h
/** \brief  Length for Ifx_DMU_HF_PROCONDF_Bits.APREN */
#define IFX_DMU_HF_PROCONDF_APREN_LEN (1u)

/** \brief  Mask for Ifx_DMU_HF_PROCONDF_Bits.APREN */
#define IFX_DMU_HF_PROCONDF_APREN_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HF_PROCONDF_Bits.APREN */
#define IFX_DMU_HF_PROCONDF_APREN_OFF (11u)

/** \brief  Length for Ifx_DMU_HF_PROCONDF_Bits.CAP0EN */
#define IFX_DMU_HF_PROCONDF_CAP0EN_LEN (1u)

/** \brief  Mask for Ifx_DMU_HF_PROCONDF_Bits.CAP0EN */
#define IFX_DMU_HF_PROCONDF_CAP0EN_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HF_PROCONDF_Bits.CAP0EN */
#define IFX_DMU_HF_PROCONDF_CAP0EN_OFF (12u)

/** \brief  Length for Ifx_DMU_HF_PROCONDF_Bits.CAP1EN */
#define IFX_DMU_HF_PROCONDF_CAP1EN_LEN (1u)

/** \brief  Mask for Ifx_DMU_HF_PROCONDF_Bits.CAP1EN */
#define IFX_DMU_HF_PROCONDF_CAP1EN_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HF_PROCONDF_Bits.CAP1EN */
#define IFX_DMU_HF_PROCONDF_CAP1EN_OFF (13u)

/** \brief  Length for Ifx_DMU_HF_PROCONDF_Bits.CAP2EN */
#define IFX_DMU_HF_PROCONDF_CAP2EN_LEN (1u)

/** \brief  Mask for Ifx_DMU_HF_PROCONDF_Bits.CAP2EN */
#define IFX_DMU_HF_PROCONDF_CAP2EN_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HF_PROCONDF_Bits.CAP2EN */
#define IFX_DMU_HF_PROCONDF_CAP2EN_OFF (14u)

/** \brief  Length for Ifx_DMU_HF_PROCONDF_Bits.CAP3EN */
#define IFX_DMU_HF_PROCONDF_CAP3EN_LEN (1u)

/** \brief  Mask for Ifx_DMU_HF_PROCONDF_Bits.CAP3EN */
#define IFX_DMU_HF_PROCONDF_CAP3EN_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HF_PROCONDF_Bits.CAP3EN */
#define IFX_DMU_HF_PROCONDF_CAP3EN_OFF (15u)

/** \brief  Length for Ifx_DMU_HF_PROCONDF_Bits.ESR0CNT */
#define IFX_DMU_HF_PROCONDF_ESR0CNT_LEN (12u)

/** \brief  Mask for Ifx_DMU_HF_PROCONDF_Bits.ESR0CNT */
#define IFX_DMU_HF_PROCONDF_ESR0CNT_MSK (0xfffu)

/** \brief  Offset for Ifx_DMU_HF_PROCONDF_Bits.ESR0CNT */
#define IFX_DMU_HF_PROCONDF_ESR0CNT_OFF (16u)

/** \brief  Length for Ifx_DMU_HF_PROCONDF_Bits.L */
#define IFX_DMU_HF_PROCONDF_L_LEN (1u)

/** \brief  Mask for Ifx_DMU_HF_PROCONDF_Bits.L */
#define IFX_DMU_HF_PROCONDF_L_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HF_PROCONDF_Bits.L */
#define IFX_DMU_HF_PROCONDF_L_OFF (0u)

/** \brief  Length for Ifx_DMU_HF_PROCONDF_Bits.MODE */
#define IFX_DMU_HF_PROCONDF_MODE_LEN (2u)

/** \brief  Mask for Ifx_DMU_HF_PROCONDF_Bits.MODE */
#define IFX_DMU_HF_PROCONDF_MODE_MSK (0x3u)

/** \brief  Offset for Ifx_DMU_HF_PROCONDF_Bits.MODE */
#define IFX_DMU_HF_PROCONDF_MODE_OFF (9u)

/** \brief  Length for Ifx_DMU_HF_PROCONDF_Bits.OSCCFG */
#define IFX_DMU_HF_PROCONDF_OSCCFG_LEN (1u)

/** \brief  Mask for Ifx_DMU_HF_PROCONDF_Bits.OSCCFG */
#define IFX_DMU_HF_PROCONDF_OSCCFG_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HF_PROCONDF_Bits.OSCCFG */
#define IFX_DMU_HF_PROCONDF_OSCCFG_OFF (8u)

/** \brief  Length for Ifx_DMU_HF_PROCONDF_Bits.RPRO */
#define IFX_DMU_HF_PROCONDF_RPRO_LEN (1u)

/** \brief  Mask for Ifx_DMU_HF_PROCONDF_Bits.RPRO */
#define IFX_DMU_HF_PROCONDF_RPRO_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HF_PROCONDF_Bits.RPRO */
#define IFX_DMU_HF_PROCONDF_RPRO_OFF (31u)

/** \brief  Length for Ifx_DMU_HF_PROCONDF_Bits.UCB */
#define IFX_DMU_HF_PROCONDF_UCB_LEN (3u)

/** \brief  Mask for Ifx_DMU_HF_PROCONDF_Bits.UCB */
#define IFX_DMU_HF_PROCONDF_UCB_MSK (0x7u)

/** \brief  Offset for Ifx_DMU_HF_PROCONDF_Bits.UCB */
#define IFX_DMU_HF_PROCONDF_UCB_OFF (28u)

/** \brief  Length for Ifx_DMU_HF_PROCONPF_Bits.RPRO */
#define IFX_DMU_HF_PROCONPF_RPRO_LEN (1u)

/** \brief  Mask for Ifx_DMU_HF_PROCONPF_Bits.RPRO */
#define IFX_DMU_HF_PROCONPF_RPRO_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HF_PROCONPF_Bits.RPRO */
#define IFX_DMU_HF_PROCONPF_RPRO_OFF (31u)

/** \brief  Length for Ifx_DMU_HF_PROCONPF_Bits.UCB */
#define IFX_DMU_HF_PROCONPF_UCB_LEN (31u)

/** \brief  Mask for Ifx_DMU_HF_PROCONPF_Bits.UCB */
#define IFX_DMU_HF_PROCONPF_UCB_MSK (0x7fffffffu)

/** \brief  Offset for Ifx_DMU_HF_PROCONPF_Bits.UCB */
#define IFX_DMU_HF_PROCONPF_UCB_OFF (0u)

/** \brief  Length for Ifx_DMU_HF_PROCONRAM_Bits.LMUINSEL */
#define IFX_DMU_HF_PROCONRAM_LMUINSEL_LEN (7u)

/** \brief  Mask for Ifx_DMU_HF_PROCONRAM_Bits.LMUINSEL */
#define IFX_DMU_HF_PROCONRAM_LMUINSEL_MSK (0x7fu)

/** \brief  Offset for Ifx_DMU_HF_PROCONRAM_Bits.LMUINSEL */
#define IFX_DMU_HF_PROCONRAM_LMUINSEL_OFF (24u)

/** \brief  Length for Ifx_DMU_HF_PROCONRAM_Bits.RAMIN */
#define IFX_DMU_HF_PROCONRAM_RAMIN_LEN (2u)

/** \brief  Mask for Ifx_DMU_HF_PROCONRAM_Bits.RAMIN */
#define IFX_DMU_HF_PROCONRAM_RAMIN_MSK (0x3u)

/** \brief  Offset for Ifx_DMU_HF_PROCONRAM_Bits.RAMIN */
#define IFX_DMU_HF_PROCONRAM_RAMIN_OFF (0u)

/** \brief  Length for Ifx_DMU_HF_PROCONRAM_Bits.RAMINSEL */
#define IFX_DMU_HF_PROCONRAM_RAMINSEL_LEN (6u)

/** \brief  Mask for Ifx_DMU_HF_PROCONRAM_Bits.RAMINSEL */
#define IFX_DMU_HF_PROCONRAM_RAMINSEL_MSK (0x3fu)

/** \brief  Offset for Ifx_DMU_HF_PROCONRAM_Bits.RAMINSEL */
#define IFX_DMU_HF_PROCONRAM_RAMINSEL_OFF (16u)

/** \brief  Length for Ifx_DMU_HF_PROCONRAM_Bits.UCB */
#define IFX_DMU_HF_PROCONRAM_UCB_LEN (14u)

/** \brief  Mask for Ifx_DMU_HF_PROCONRAM_Bits.UCB */
#define IFX_DMU_HF_PROCONRAM_UCB_MSK (0x3fffu)

/** \brief  Offset for Ifx_DMU_HF_PROCONRAM_Bits.UCB */
#define IFX_DMU_HF_PROCONRAM_UCB_OFF (2u)

/** \brief  Length for Ifx_DMU_HF_PROCONTP_Bits.BML */
#define IFX_DMU_HF_PROCONTP_BML_LEN (2u)

/** \brief  Mask for Ifx_DMU_HF_PROCONTP_Bits.BML */
#define IFX_DMU_HF_PROCONTP_BML_MSK (0x3u)

/** \brief  Offset for Ifx_DMU_HF_PROCONTP_Bits.BML */
#define IFX_DMU_HF_PROCONTP_BML_OFF (8u)

/** \brief  Length for Ifx_DMU_HF_PROCONTP_Bits.TP */
#define IFX_DMU_HF_PROCONTP_TP_LEN (1u)

/** \brief  Mask for Ifx_DMU_HF_PROCONTP_Bits.TP */
#define IFX_DMU_HF_PROCONTP_TP_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HF_PROCONTP_Bits.TP */
#define IFX_DMU_HF_PROCONTP_TP_OFF (0u)

/** \brief  Length for Ifx_DMU_HF_PROCONTP_Bits.UCB */
#define IFX_DMU_HF_PROCONTP_UCB_LEN (7u)

/** \brief  Mask for Ifx_DMU_HF_PROCONTP_Bits.UCB */
#define IFX_DMU_HF_PROCONTP_UCB_MSK (0x7fu)

/** \brief  Offset for Ifx_DMU_HF_PROCONTP_Bits.UCB */
#define IFX_DMU_HF_PROCONTP_UCB_OFF (1u)

/** \brief  Length for Ifx_DMU_HF_PROCONUSR_Bits.MODE */
#define IFX_DMU_HF_PROCONUSR_MODE_LEN (2u)

/** \brief  Mask for Ifx_DMU_HF_PROCONUSR_Bits.MODE */
#define IFX_DMU_HF_PROCONUSR_MODE_MSK (0x3u)

