Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxDmu_bf.h
/** \brief  Offset for Ifx_DMU_HF_PROCONUSR_Bits.MODE */
#define IFX_DMU_HF_PROCONUSR_MODE_OFF (0u)

/** \brief  Length for Ifx_DMU_HF_PROCONUSR_Bits.UCB */
#define IFX_DMU_HF_PROCONUSR_UCB_LEN (30u)

/** \brief  Mask for Ifx_DMU_HF_PROCONUSR_Bits.UCB */
#define IFX_DMU_HF_PROCONUSR_UCB_MSK (0x3fffffffu)

/** \brief  Offset for Ifx_DMU_HF_PROCONUSR_Bits.UCB */
#define IFX_DMU_HF_PROCONUSR_UCB_OFF (2u)

/** \brief  Length for Ifx_DMU_HF_PROTECT_Bits.PRODISD */
#define IFX_DMU_HF_PROTECT_PRODISD_LEN (1u)

/** \brief  Mask for Ifx_DMU_HF_PROTECT_Bits.PRODISD */
#define IFX_DMU_HF_PROTECT_PRODISD_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HF_PROTECT_Bits.PRODISD */
#define IFX_DMU_HF_PROTECT_PRODISD_OFF (1u)

/** \brief  Length for Ifx_DMU_HF_PROTECT_Bits.PRODISDBG */
#define IFX_DMU_HF_PROTECT_PRODISDBG_LEN (1u)

/** \brief  Mask for Ifx_DMU_HF_PROTECT_Bits.PRODISDBG */
#define IFX_DMU_HF_PROTECT_PRODISDBG_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HF_PROTECT_Bits.PRODISDBG */
#define IFX_DMU_HF_PROTECT_PRODISDBG_OFF (2u)

/** \brief  Length for Ifx_DMU_HF_PROTECT_Bits.PRODISP */
#define IFX_DMU_HF_PROTECT_PRODISP_LEN (1u)

/** \brief  Mask for Ifx_DMU_HF_PROTECT_Bits.PRODISP */
#define IFX_DMU_HF_PROTECT_PRODISP_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HF_PROTECT_Bits.PRODISP */
#define IFX_DMU_HF_PROTECT_PRODISP_OFF (0u)

/** \brief  Length for Ifx_DMU_HF_PROTECT_Bits.SRT */
#define IFX_DMU_HF_PROTECT_SRT_LEN (1u)

/** \brief  Mask for Ifx_DMU_HF_PROTECT_Bits.SRT */
#define IFX_DMU_HF_PROTECT_SRT_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HF_PROTECT_Bits.SRT */
#define IFX_DMU_HF_PROTECT_SRT_OFF (24u)

/** \brief  Length for Ifx_DMU_HF_PSIZE_Bits.SIZE */
#define IFX_DMU_HF_PSIZE_SIZE_LEN (2u)

/** \brief  Mask for Ifx_DMU_HF_PSIZE_Bits.SIZE */
#define IFX_DMU_HF_PSIZE_SIZE_MSK (0x3u)

/** \brief  Offset for Ifx_DMU_HF_PSIZE_Bits.SIZE */
#define IFX_DMU_HF_PSIZE_SIZE_OFF (6u)

/** \brief  Length for Ifx_DMU_HF_PSTATUS_Bits.DEMAND */
#define IFX_DMU_HF_PSTATUS_DEMAND_LEN (1u)

/** \brief  Mask for Ifx_DMU_HF_PSTATUS_Bits.DEMAND */
#define IFX_DMU_HF_PSTATUS_DEMAND_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HF_PSTATUS_Bits.DEMAND */
#define IFX_DMU_HF_PSTATUS_DEMAND_OFF (2u)

/** \brief  Length for Ifx_DMU_HF_PSTATUS_Bits.IDLE */
#define IFX_DMU_HF_PSTATUS_IDLE_LEN (1u)

/** \brief  Mask for Ifx_DMU_HF_PSTATUS_Bits.IDLE */
#define IFX_DMU_HF_PSTATUS_IDLE_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HF_PSTATUS_Bits.IDLE */
#define IFX_DMU_HF_PSTATUS_IDLE_OFF (1u)

/** \brief  Length for Ifx_DMU_HF_PSTATUS_Bits.SLEEP */
#define IFX_DMU_HF_PSTATUS_SLEEP_LEN (1u)

/** \brief  Mask for Ifx_DMU_HF_PSTATUS_Bits.SLEEP */
#define IFX_DMU_HF_PSTATUS_SLEEP_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HF_PSTATUS_Bits.SLEEP */
#define IFX_DMU_HF_PSTATUS_SLEEP_OFF (0u)

/** \brief  Length for Ifx_DMU_HF_PWAIT_Bits.CECC */
#define IFX_DMU_HF_PWAIT_CECC_LEN (3u)

/** \brief  Mask for Ifx_DMU_HF_PWAIT_Bits.CECC */
#define IFX_DMU_HF_PWAIT_CECC_MSK (0x7u)

/** \brief  Offset for Ifx_DMU_HF_PWAIT_Bits.CECC */
#define IFX_DMU_HF_PWAIT_CECC_OFF (24u)

/** \brief  Length for Ifx_DMU_HF_PWAIT_Bits.CFLASH */
#define IFX_DMU_HF_PWAIT_CFLASH_LEN (6u)

/** \brief  Mask for Ifx_DMU_HF_PWAIT_Bits.CFLASH */
#define IFX_DMU_HF_PWAIT_CFLASH_MSK (0x3fu)

/** \brief  Offset for Ifx_DMU_HF_PWAIT_Bits.CFLASH */
#define IFX_DMU_HF_PWAIT_CFLASH_OFF (16u)

/** \brief  Length for Ifx_DMU_HF_PWAIT_Bits.RECC */
#define IFX_DMU_HF_PWAIT_RECC_LEN (3u)

/** \brief  Mask for Ifx_DMU_HF_PWAIT_Bits.RECC */
#define IFX_DMU_HF_PWAIT_RECC_MSK (0x7u)

/** \brief  Offset for Ifx_DMU_HF_PWAIT_Bits.RECC */
#define IFX_DMU_HF_PWAIT_RECC_OFF (8u)

/** \brief  Length for Ifx_DMU_HF_PWAIT_Bits.RFLASH */
#define IFX_DMU_HF_PWAIT_RFLASH_LEN (6u)

/** \brief  Mask for Ifx_DMU_HF_PWAIT_Bits.RFLASH */
#define IFX_DMU_HF_PWAIT_RFLASH_MSK (0x3fu)

/** \brief  Offset for Ifx_DMU_HF_PWAIT_Bits.RFLASH */
#define IFX_DMU_HF_PWAIT_RFLASH_OFF (0u)

/** \brief  Length for Ifx_DMU_HF_STATUS_Bits.CFS */
#define IFX_DMU_HF_STATUS_CFS_LEN (2u)

/** \brief  Mask for Ifx_DMU_HF_STATUS_Bits.CFS */
#define IFX_DMU_HF_STATUS_CFS_MSK (0x3u)

/** \brief  Offset for Ifx_DMU_HF_STATUS_Bits.CFS */
#define IFX_DMU_HF_STATUS_CFS_OFF (24u)

/** \brief  Length for Ifx_DMU_HF_STATUS_Bits.D0BUSY */
#define IFX_DMU_HF_STATUS_D0BUSY_LEN (1u)

/** \brief  Mask for Ifx_DMU_HF_STATUS_Bits.D0BUSY */
#define IFX_DMU_HF_STATUS_D0BUSY_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HF_STATUS_Bits.D0BUSY */
#define IFX_DMU_HF_STATUS_D0BUSY_OFF (0u)

/** \brief  Length for Ifx_DMU_HF_STATUS_Bits.D1BUSY */
#define IFX_DMU_HF_STATUS_D1BUSY_LEN (1u)

/** \brief  Mask for Ifx_DMU_HF_STATUS_Bits.D1BUSY */
#define IFX_DMU_HF_STATUS_D1BUSY_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HF_STATUS_Bits.D1BUSY */
#define IFX_DMU_HF_STATUS_D1BUSY_OFF (1u)

/** \brief  Length for Ifx_DMU_HF_STATUS_Bits.DFPAGE */
#define IFX_DMU_HF_STATUS_DFPAGE_LEN (1u)

/** \brief  Mask for Ifx_DMU_HF_STATUS_Bits.DFPAGE */
#define IFX_DMU_HF_STATUS_DFPAGE_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HF_STATUS_Bits.DFPAGE */
#define IFX_DMU_HF_STATUS_DFPAGE_OFF (20u)

/** \brief  Length for Ifx_DMU_HF_STATUS_Bits.FABUSY */
#define IFX_DMU_HF_STATUS_FABUSY_LEN (1u)

/** \brief  Mask for Ifx_DMU_HF_STATUS_Bits.FABUSY */
#define IFX_DMU_HF_STATUS_FABUSY_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HF_STATUS_Bits.FABUSY */
#define IFX_DMU_HF_STATUS_FABUSY_OFF (16u)

/** \brief  Length for Ifx_DMU_HF_STATUS_Bits.FLR */
#define IFX_DMU_HF_STATUS_FLR_LEN (1u)

/** \brief  Mask for Ifx_DMU_HF_STATUS_Bits.FLR */
#define IFX_DMU_HF_STATUS_FLR_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HF_STATUS_Bits.FLR */
#define IFX_DMU_HF_STATUS_FLR_OFF (19u)

/** \brief  Length for Ifx_DMU_HF_STATUS_Bits.FLU */
#define IFX_DMU_HF_STATUS_FLU_LEN (1u)

/** \brief  Mask for Ifx_DMU_HF_STATUS_Bits.FLU */
#define IFX_DMU_HF_STATUS_FLU_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HF_STATUS_Bits.FLU */
#define IFX_DMU_HF_STATUS_FLU_OFF (18u)

/** \brief  Length for Ifx_DMU_HF_STATUS_Bits.FLW */
#define IFX_DMU_HF_STATUS_FLW_LEN (1u)

/** \brief  Mask for Ifx_DMU_HF_STATUS_Bits.FLW */
#define IFX_DMU_HF_STATUS_FLW_MSK (0x1u)

