Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxDmu_bf.h
/** \brief  Offset for Ifx_DMU_HF_STATUS_Bits.FLW */
#define IFX_DMU_HF_STATUS_FLW_OFF (17u)

/** \brief  Length for Ifx_DMU_HF_STATUS_Bits.FRET */
#define IFX_DMU_HF_STATUS_FRET_LEN (1u)

/** \brief  Mask for Ifx_DMU_HF_STATUS_Bits.FRET */
#define IFX_DMU_HF_STATUS_FRET_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HF_STATUS_Bits.FRET */
#define IFX_DMU_HF_STATUS_FRET_OFF (22u)

/** \brief  Length for Ifx_DMU_HF_STATUS_Bits.P0BUSY */
#define IFX_DMU_HF_STATUS_P0BUSY_LEN (1u)

/** \brief  Mask for Ifx_DMU_HF_STATUS_Bits.P0BUSY */
#define IFX_DMU_HF_STATUS_P0BUSY_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HF_STATUS_Bits.P0BUSY */
#define IFX_DMU_HF_STATUS_P0BUSY_OFF (2u)

/** \brief  Length for Ifx_DMU_HF_STATUS_Bits.P1BUSY */
#define IFX_DMU_HF_STATUS_P1BUSY_LEN (1u)

/** \brief  Mask for Ifx_DMU_HF_STATUS_Bits.P1BUSY */
#define IFX_DMU_HF_STATUS_P1BUSY_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HF_STATUS_Bits.P1BUSY */
#define IFX_DMU_HF_STATUS_P1BUSY_OFF (3u)

/** \brief  Length for Ifx_DMU_HF_STATUS_Bits.P2BUSY */
#define IFX_DMU_HF_STATUS_P2BUSY_LEN (1u)

/** \brief  Mask for Ifx_DMU_HF_STATUS_Bits.P2BUSY */
#define IFX_DMU_HF_STATUS_P2BUSY_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HF_STATUS_Bits.P2BUSY */
#define IFX_DMU_HF_STATUS_P2BUSY_OFF (4u)

/** \brief  Length for Ifx_DMU_HF_STATUS_Bits.P3BUSY */
#define IFX_DMU_HF_STATUS_P3BUSY_LEN (1u)

/** \brief  Mask for Ifx_DMU_HF_STATUS_Bits.P3BUSY */
#define IFX_DMU_HF_STATUS_P3BUSY_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HF_STATUS_Bits.P3BUSY */
#define IFX_DMU_HF_STATUS_P3BUSY_OFF (5u)

/** \brief  Length for Ifx_DMU_HF_STATUS_Bits.P4BUSY */
#define IFX_DMU_HF_STATUS_P4BUSY_LEN (1u)

/** \brief  Mask for Ifx_DMU_HF_STATUS_Bits.P4BUSY */
#define IFX_DMU_HF_STATUS_P4BUSY_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HF_STATUS_Bits.P4BUSY */
#define IFX_DMU_HF_STATUS_P4BUSY_OFF (6u)

/** \brief  Length for Ifx_DMU_HF_STATUS_Bits.P5BUSY */
#define IFX_DMU_HF_STATUS_P5BUSY_LEN (1u)

/** \brief  Mask for Ifx_DMU_HF_STATUS_Bits.P5BUSY */
#define IFX_DMU_HF_STATUS_P5BUSY_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HF_STATUS_Bits.P5BUSY */
#define IFX_DMU_HF_STATUS_P5BUSY_OFF (7u)

/** \brief  Length for Ifx_DMU_HF_STATUS_Bits.PFPAGE */
#define IFX_DMU_HF_STATUS_PFPAGE_LEN (1u)

/** \brief  Mask for Ifx_DMU_HF_STATUS_Bits.PFPAGE */
#define IFX_DMU_HF_STATUS_PFPAGE_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HF_STATUS_Bits.PFPAGE */
#define IFX_DMU_HF_STATUS_PFPAGE_OFF (21u)

/** \brief  Length for Ifx_DMU_HF_SUSPEND_Bits.CLR */
#define IFX_DMU_HF_SUSPEND_CLR_LEN (1u)

/** \brief  Mask for Ifx_DMU_HF_SUSPEND_Bits.CLR */
#define IFX_DMU_HF_SUSPEND_CLR_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HF_SUSPEND_Bits.CLR */
#define IFX_DMU_HF_SUSPEND_CLR_OFF (1u)

/** \brief  Length for Ifx_DMU_HF_SUSPEND_Bits.ERR */
#define IFX_DMU_HF_SUSPEND_ERR_LEN (1u)

/** \brief  Mask for Ifx_DMU_HF_SUSPEND_Bits.ERR */
#define IFX_DMU_HF_SUSPEND_ERR_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HF_SUSPEND_Bits.ERR */
#define IFX_DMU_HF_SUSPEND_ERR_OFF (17u)

/** \brief  Length for Ifx_DMU_HF_SUSPEND_Bits.REQ */
#define IFX_DMU_HF_SUSPEND_REQ_LEN (1u)

/** \brief  Mask for Ifx_DMU_HF_SUSPEND_Bits.REQ */
#define IFX_DMU_HF_SUSPEND_REQ_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HF_SUSPEND_Bits.REQ */
#define IFX_DMU_HF_SUSPEND_REQ_OFF (0u)

/** \brief  Length for Ifx_DMU_HF_SUSPEND_Bits.SPND */
#define IFX_DMU_HF_SUSPEND_SPND_LEN (1u)

/** \brief  Mask for Ifx_DMU_HF_SUSPEND_Bits.SPND */
#define IFX_DMU_HF_SUSPEND_SPND_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HF_SUSPEND_Bits.SPND */
#define IFX_DMU_HF_SUSPEND_SPND_OFF (16u)

/** \brief  Length for Ifx_DMU_HP_PROCON_OTP0_Bits.S0ROM */
#define IFX_DMU_HP_PROCON_OTP0_S0ROM_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_OTP0_Bits.S0ROM */
#define IFX_DMU_HP_PROCON_OTP0_S0ROM_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_OTP0_Bits.S0ROM */
#define IFX_DMU_HP_PROCON_OTP0_S0ROM_OFF (0u)

/** \brief  Length for Ifx_DMU_HP_PROCON_OTP0_Bits.S10ROM */
#define IFX_DMU_HP_PROCON_OTP0_S10ROM_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_OTP0_Bits.S10ROM */
#define IFX_DMU_HP_PROCON_OTP0_S10ROM_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_OTP0_Bits.S10ROM */
#define IFX_DMU_HP_PROCON_OTP0_S10ROM_OFF (10u)

/** \brief  Length for Ifx_DMU_HP_PROCON_OTP0_Bits.S11ROM */
#define IFX_DMU_HP_PROCON_OTP0_S11ROM_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_OTP0_Bits.S11ROM */
#define IFX_DMU_HP_PROCON_OTP0_S11ROM_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_OTP0_Bits.S11ROM */
#define IFX_DMU_HP_PROCON_OTP0_S11ROM_OFF (11u)

/** \brief  Length for Ifx_DMU_HP_PROCON_OTP0_Bits.S12ROM */
#define IFX_DMU_HP_PROCON_OTP0_S12ROM_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_OTP0_Bits.S12ROM */
#define IFX_DMU_HP_PROCON_OTP0_S12ROM_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_OTP0_Bits.S12ROM */
#define IFX_DMU_HP_PROCON_OTP0_S12ROM_OFF (12u)

/** \brief  Length for Ifx_DMU_HP_PROCON_OTP0_Bits.S13ROM */
#define IFX_DMU_HP_PROCON_OTP0_S13ROM_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_OTP0_Bits.S13ROM */
#define IFX_DMU_HP_PROCON_OTP0_S13ROM_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_OTP0_Bits.S13ROM */
#define IFX_DMU_HP_PROCON_OTP0_S13ROM_OFF (13u)

/** \brief  Length for Ifx_DMU_HP_PROCON_OTP0_Bits.S14ROM */
#define IFX_DMU_HP_PROCON_OTP0_S14ROM_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_OTP0_Bits.S14ROM */
#define IFX_DMU_HP_PROCON_OTP0_S14ROM_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_OTP0_Bits.S14ROM */
#define IFX_DMU_HP_PROCON_OTP0_S14ROM_OFF (14u)

/** \brief  Length for Ifx_DMU_HP_PROCON_OTP0_Bits.S15ROM */
#define IFX_DMU_HP_PROCON_OTP0_S15ROM_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_OTP0_Bits.S15ROM */
#define IFX_DMU_HP_PROCON_OTP0_S15ROM_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_OTP0_Bits.S15ROM */
#define IFX_DMU_HP_PROCON_OTP0_S15ROM_OFF (15u)

/** \brief  Length for Ifx_DMU_HP_PROCON_OTP0_Bits.S16ROM */
#define IFX_DMU_HP_PROCON_OTP0_S16ROM_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_OTP0_Bits.S16ROM */
#define IFX_DMU_HP_PROCON_OTP0_S16ROM_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_OTP0_Bits.S16ROM */
#define IFX_DMU_HP_PROCON_OTP0_S16ROM_OFF (16u)

/** \brief  Length for Ifx_DMU_HP_PROCON_OTP0_Bits.S17ROM */
#define IFX_DMU_HP_PROCON_OTP0_S17ROM_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_OTP0_Bits.S17ROM */
#define IFX_DMU_HP_PROCON_OTP0_S17ROM_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_OTP0_Bits.S17ROM */
#define IFX_DMU_HP_PROCON_OTP0_S17ROM_OFF (17u)

/** \brief  Length for Ifx_DMU_HP_PROCON_OTP0_Bits.S18ROM */
#define IFX_DMU_HP_PROCON_OTP0_S18ROM_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_OTP0_Bits.S18ROM */
#define IFX_DMU_HP_PROCON_OTP0_S18ROM_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_OTP0_Bits.S18ROM */
#define IFX_DMU_HP_PROCON_OTP0_S18ROM_OFF (18u)

/** \brief  Length for Ifx_DMU_HP_PROCON_OTP0_Bits.S19ROM */
#define IFX_DMU_HP_PROCON_OTP0_S19ROM_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_OTP0_Bits.S19ROM */
#define IFX_DMU_HP_PROCON_OTP0_S19ROM_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_OTP0_Bits.S19ROM */
#define IFX_DMU_HP_PROCON_OTP0_S19ROM_OFF (19u)

/** \brief  Length for Ifx_DMU_HP_PROCON_OTP0_Bits.S1ROM */
#define IFX_DMU_HP_PROCON_OTP0_S1ROM_LEN (1u)

