Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxDmu_bf.h
/** \brief  Mask for Ifx_DMU_HP_PROCON_OTP0_Bits.S1ROM */
#define IFX_DMU_HP_PROCON_OTP0_S1ROM_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_OTP0_Bits.S1ROM */
#define IFX_DMU_HP_PROCON_OTP0_S1ROM_OFF (1u)

/** \brief  Length for Ifx_DMU_HP_PROCON_OTP0_Bits.S20ROM */
#define IFX_DMU_HP_PROCON_OTP0_S20ROM_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_OTP0_Bits.S20ROM */
#define IFX_DMU_HP_PROCON_OTP0_S20ROM_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_OTP0_Bits.S20ROM */
#define IFX_DMU_HP_PROCON_OTP0_S20ROM_OFF (20u)

/** \brief  Length for Ifx_DMU_HP_PROCON_OTP0_Bits.S21ROM */
#define IFX_DMU_HP_PROCON_OTP0_S21ROM_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_OTP0_Bits.S21ROM */
#define IFX_DMU_HP_PROCON_OTP0_S21ROM_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_OTP0_Bits.S21ROM */
#define IFX_DMU_HP_PROCON_OTP0_S21ROM_OFF (21u)

/** \brief  Length for Ifx_DMU_HP_PROCON_OTP0_Bits.S22ROM */
#define IFX_DMU_HP_PROCON_OTP0_S22ROM_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_OTP0_Bits.S22ROM */
#define IFX_DMU_HP_PROCON_OTP0_S22ROM_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_OTP0_Bits.S22ROM */
#define IFX_DMU_HP_PROCON_OTP0_S22ROM_OFF (22u)

/** \brief  Length for Ifx_DMU_HP_PROCON_OTP0_Bits.S23ROM */
#define IFX_DMU_HP_PROCON_OTP0_S23ROM_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_OTP0_Bits.S23ROM */
#define IFX_DMU_HP_PROCON_OTP0_S23ROM_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_OTP0_Bits.S23ROM */
#define IFX_DMU_HP_PROCON_OTP0_S23ROM_OFF (23u)

/** \brief  Length for Ifx_DMU_HP_PROCON_OTP0_Bits.S24ROM */
#define IFX_DMU_HP_PROCON_OTP0_S24ROM_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_OTP0_Bits.S24ROM */
#define IFX_DMU_HP_PROCON_OTP0_S24ROM_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_OTP0_Bits.S24ROM */
#define IFX_DMU_HP_PROCON_OTP0_S24ROM_OFF (24u)

/** \brief  Length for Ifx_DMU_HP_PROCON_OTP0_Bits.S25ROM */
#define IFX_DMU_HP_PROCON_OTP0_S25ROM_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_OTP0_Bits.S25ROM */
#define IFX_DMU_HP_PROCON_OTP0_S25ROM_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_OTP0_Bits.S25ROM */
#define IFX_DMU_HP_PROCON_OTP0_S25ROM_OFF (25u)

/** \brief  Length for Ifx_DMU_HP_PROCON_OTP0_Bits.S26ROM */
#define IFX_DMU_HP_PROCON_OTP0_S26ROM_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_OTP0_Bits.S26ROM */
#define IFX_DMU_HP_PROCON_OTP0_S26ROM_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_OTP0_Bits.S26ROM */
#define IFX_DMU_HP_PROCON_OTP0_S26ROM_OFF (26u)

/** \brief  Length for Ifx_DMU_HP_PROCON_OTP0_Bits.S27ROM */
#define IFX_DMU_HP_PROCON_OTP0_S27ROM_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_OTP0_Bits.S27ROM */
#define IFX_DMU_HP_PROCON_OTP0_S27ROM_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_OTP0_Bits.S27ROM */
#define IFX_DMU_HP_PROCON_OTP0_S27ROM_OFF (27u)

/** \brief  Length for Ifx_DMU_HP_PROCON_OTP0_Bits.S28ROM */
#define IFX_DMU_HP_PROCON_OTP0_S28ROM_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_OTP0_Bits.S28ROM */
#define IFX_DMU_HP_PROCON_OTP0_S28ROM_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_OTP0_Bits.S28ROM */
#define IFX_DMU_HP_PROCON_OTP0_S28ROM_OFF (28u)

/** \brief  Length for Ifx_DMU_HP_PROCON_OTP0_Bits.S29ROM */
#define IFX_DMU_HP_PROCON_OTP0_S29ROM_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_OTP0_Bits.S29ROM */
#define IFX_DMU_HP_PROCON_OTP0_S29ROM_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_OTP0_Bits.S29ROM */
#define IFX_DMU_HP_PROCON_OTP0_S29ROM_OFF (29u)

/** \brief  Length for Ifx_DMU_HP_PROCON_OTP0_Bits.S2ROM */
#define IFX_DMU_HP_PROCON_OTP0_S2ROM_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_OTP0_Bits.S2ROM */
#define IFX_DMU_HP_PROCON_OTP0_S2ROM_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_OTP0_Bits.S2ROM */
#define IFX_DMU_HP_PROCON_OTP0_S2ROM_OFF (2u)

/** \brief  Length for Ifx_DMU_HP_PROCON_OTP0_Bits.S30ROM */
#define IFX_DMU_HP_PROCON_OTP0_S30ROM_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_OTP0_Bits.S30ROM */
#define IFX_DMU_HP_PROCON_OTP0_S30ROM_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_OTP0_Bits.S30ROM */
#define IFX_DMU_HP_PROCON_OTP0_S30ROM_OFF (30u)

/** \brief  Length for Ifx_DMU_HP_PROCON_OTP0_Bits.S31ROM */
#define IFX_DMU_HP_PROCON_OTP0_S31ROM_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_OTP0_Bits.S31ROM */
#define IFX_DMU_HP_PROCON_OTP0_S31ROM_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_OTP0_Bits.S31ROM */
#define IFX_DMU_HP_PROCON_OTP0_S31ROM_OFF (31u)

/** \brief  Length for Ifx_DMU_HP_PROCON_OTP0_Bits.S3ROM */
#define IFX_DMU_HP_PROCON_OTP0_S3ROM_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_OTP0_Bits.S3ROM */
#define IFX_DMU_HP_PROCON_OTP0_S3ROM_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_OTP0_Bits.S3ROM */
#define IFX_DMU_HP_PROCON_OTP0_S3ROM_OFF (3u)

/** \brief  Length for Ifx_DMU_HP_PROCON_OTP0_Bits.S4ROM */
#define IFX_DMU_HP_PROCON_OTP0_S4ROM_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_OTP0_Bits.S4ROM */
#define IFX_DMU_HP_PROCON_OTP0_S4ROM_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_OTP0_Bits.S4ROM */
#define IFX_DMU_HP_PROCON_OTP0_S4ROM_OFF (4u)

/** \brief  Length for Ifx_DMU_HP_PROCON_OTP0_Bits.S5ROM */
#define IFX_DMU_HP_PROCON_OTP0_S5ROM_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_OTP0_Bits.S5ROM */
#define IFX_DMU_HP_PROCON_OTP0_S5ROM_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_OTP0_Bits.S5ROM */
#define IFX_DMU_HP_PROCON_OTP0_S5ROM_OFF (5u)

/** \brief  Length for Ifx_DMU_HP_PROCON_OTP0_Bits.S6ROM */
#define IFX_DMU_HP_PROCON_OTP0_S6ROM_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_OTP0_Bits.S6ROM */
#define IFX_DMU_HP_PROCON_OTP0_S6ROM_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_OTP0_Bits.S6ROM */
#define IFX_DMU_HP_PROCON_OTP0_S6ROM_OFF (6u)

/** \brief  Length for Ifx_DMU_HP_PROCON_OTP0_Bits.S7ROM */
#define IFX_DMU_HP_PROCON_OTP0_S7ROM_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_OTP0_Bits.S7ROM */
#define IFX_DMU_HP_PROCON_OTP0_S7ROM_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_OTP0_Bits.S7ROM */
#define IFX_DMU_HP_PROCON_OTP0_S7ROM_OFF (7u)

/** \brief  Length for Ifx_DMU_HP_PROCON_OTP0_Bits.S8ROM */
#define IFX_DMU_HP_PROCON_OTP0_S8ROM_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_OTP0_Bits.S8ROM */
#define IFX_DMU_HP_PROCON_OTP0_S8ROM_MSK (0x1u)

