Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxDmu_bf.h
/** \brief  Offset for Ifx_DMU_HP_PROCON_OTP0_Bits.S8ROM */
#define IFX_DMU_HP_PROCON_OTP0_S8ROM_OFF (8u)

/** \brief  Length for Ifx_DMU_HP_PROCON_OTP0_Bits.S9ROM */
#define IFX_DMU_HP_PROCON_OTP0_S9ROM_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_OTP0_Bits.S9ROM */
#define IFX_DMU_HP_PROCON_OTP0_S9ROM_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_OTP0_Bits.S9ROM */
#define IFX_DMU_HP_PROCON_OTP0_S9ROM_OFF (9u)

/** \brief  Length for Ifx_DMU_HP_PROCON_OTP1_Bits.S32ROM */
#define IFX_DMU_HP_PROCON_OTP1_S32ROM_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_OTP1_Bits.S32ROM */
#define IFX_DMU_HP_PROCON_OTP1_S32ROM_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_OTP1_Bits.S32ROM */
#define IFX_DMU_HP_PROCON_OTP1_S32ROM_OFF (0u)

/** \brief  Length for Ifx_DMU_HP_PROCON_OTP1_Bits.S33ROM */
#define IFX_DMU_HP_PROCON_OTP1_S33ROM_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_OTP1_Bits.S33ROM */
#define IFX_DMU_HP_PROCON_OTP1_S33ROM_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_OTP1_Bits.S33ROM */
#define IFX_DMU_HP_PROCON_OTP1_S33ROM_OFF (1u)

/** \brief  Length for Ifx_DMU_HP_PROCON_OTP1_Bits.S34ROM */
#define IFX_DMU_HP_PROCON_OTP1_S34ROM_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_OTP1_Bits.S34ROM */
#define IFX_DMU_HP_PROCON_OTP1_S34ROM_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_OTP1_Bits.S34ROM */
#define IFX_DMU_HP_PROCON_OTP1_S34ROM_OFF (2u)

/** \brief  Length for Ifx_DMU_HP_PROCON_OTP1_Bits.S35ROM */
#define IFX_DMU_HP_PROCON_OTP1_S35ROM_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_OTP1_Bits.S35ROM */
#define IFX_DMU_HP_PROCON_OTP1_S35ROM_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_OTP1_Bits.S35ROM */
#define IFX_DMU_HP_PROCON_OTP1_S35ROM_OFF (3u)

/** \brief  Length for Ifx_DMU_HP_PROCON_OTP1_Bits.S36ROM */
#define IFX_DMU_HP_PROCON_OTP1_S36ROM_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_OTP1_Bits.S36ROM */
#define IFX_DMU_HP_PROCON_OTP1_S36ROM_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_OTP1_Bits.S36ROM */
#define IFX_DMU_HP_PROCON_OTP1_S36ROM_OFF (4u)

/** \brief  Length for Ifx_DMU_HP_PROCON_OTP1_Bits.S37ROM */
#define IFX_DMU_HP_PROCON_OTP1_S37ROM_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_OTP1_Bits.S37ROM */
#define IFX_DMU_HP_PROCON_OTP1_S37ROM_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_OTP1_Bits.S37ROM */
#define IFX_DMU_HP_PROCON_OTP1_S37ROM_OFF (5u)

/** \brief  Length for Ifx_DMU_HP_PROCON_OTP1_Bits.S38ROM */
#define IFX_DMU_HP_PROCON_OTP1_S38ROM_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_OTP1_Bits.S38ROM */
#define IFX_DMU_HP_PROCON_OTP1_S38ROM_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_OTP1_Bits.S38ROM */
#define IFX_DMU_HP_PROCON_OTP1_S38ROM_OFF (6u)

/** \brief  Length for Ifx_DMU_HP_PROCON_OTP1_Bits.S39ROM */
#define IFX_DMU_HP_PROCON_OTP1_S39ROM_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_OTP1_Bits.S39ROM */
#define IFX_DMU_HP_PROCON_OTP1_S39ROM_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_OTP1_Bits.S39ROM */
#define IFX_DMU_HP_PROCON_OTP1_S39ROM_OFF (7u)

/** \brief  Length for Ifx_DMU_HP_PROCON_OTP1_Bits.S40ROM */
#define IFX_DMU_HP_PROCON_OTP1_S40ROM_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_OTP1_Bits.S40ROM */
#define IFX_DMU_HP_PROCON_OTP1_S40ROM_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_OTP1_Bits.S40ROM */
#define IFX_DMU_HP_PROCON_OTP1_S40ROM_OFF (8u)

/** \brief  Length for Ifx_DMU_HP_PROCON_OTP1_Bits.S41ROM */
#define IFX_DMU_HP_PROCON_OTP1_S41ROM_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_OTP1_Bits.S41ROM */
#define IFX_DMU_HP_PROCON_OTP1_S41ROM_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_OTP1_Bits.S41ROM */
#define IFX_DMU_HP_PROCON_OTP1_S41ROM_OFF (9u)

/** \brief  Length for Ifx_DMU_HP_PROCON_OTP1_Bits.S42ROM */
#define IFX_DMU_HP_PROCON_OTP1_S42ROM_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_OTP1_Bits.S42ROM */
#define IFX_DMU_HP_PROCON_OTP1_S42ROM_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_OTP1_Bits.S42ROM */
#define IFX_DMU_HP_PROCON_OTP1_S42ROM_OFF (10u)

/** \brief  Length for Ifx_DMU_HP_PROCON_OTP1_Bits.S43ROM */
#define IFX_DMU_HP_PROCON_OTP1_S43ROM_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_OTP1_Bits.S43ROM */
#define IFX_DMU_HP_PROCON_OTP1_S43ROM_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_OTP1_Bits.S43ROM */
#define IFX_DMU_HP_PROCON_OTP1_S43ROM_OFF (11u)

/** \brief  Length for Ifx_DMU_HP_PROCON_OTP1_Bits.S44ROM */
#define IFX_DMU_HP_PROCON_OTP1_S44ROM_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_OTP1_Bits.S44ROM */
#define IFX_DMU_HP_PROCON_OTP1_S44ROM_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_OTP1_Bits.S44ROM */
#define IFX_DMU_HP_PROCON_OTP1_S44ROM_OFF (12u)

/** \brief  Length for Ifx_DMU_HP_PROCON_OTP1_Bits.S45ROM */
#define IFX_DMU_HP_PROCON_OTP1_S45ROM_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_OTP1_Bits.S45ROM */
#define IFX_DMU_HP_PROCON_OTP1_S45ROM_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_OTP1_Bits.S45ROM */
#define IFX_DMU_HP_PROCON_OTP1_S45ROM_OFF (13u)

/** \brief  Length for Ifx_DMU_HP_PROCON_OTP1_Bits.S46ROM */
#define IFX_DMU_HP_PROCON_OTP1_S46ROM_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_OTP1_Bits.S46ROM */
#define IFX_DMU_HP_PROCON_OTP1_S46ROM_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_OTP1_Bits.S46ROM */
#define IFX_DMU_HP_PROCON_OTP1_S46ROM_OFF (14u)

/** \brief  Length for Ifx_DMU_HP_PROCON_OTP1_Bits.S47ROM */
#define IFX_DMU_HP_PROCON_OTP1_S47ROM_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_OTP1_Bits.S47ROM */
#define IFX_DMU_HP_PROCON_OTP1_S47ROM_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_OTP1_Bits.S47ROM */
#define IFX_DMU_HP_PROCON_OTP1_S47ROM_OFF (15u)

/** \brief  Length for Ifx_DMU_HP_PROCON_OTP1_Bits.S48ROM */
#define IFX_DMU_HP_PROCON_OTP1_S48ROM_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_OTP1_Bits.S48ROM */
#define IFX_DMU_HP_PROCON_OTP1_S48ROM_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_OTP1_Bits.S48ROM */
#define IFX_DMU_HP_PROCON_OTP1_S48ROM_OFF (16u)

/** \brief  Length for Ifx_DMU_HP_PROCON_OTP1_Bits.S49ROM */
#define IFX_DMU_HP_PROCON_OTP1_S49ROM_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_OTP1_Bits.S49ROM */
#define IFX_DMU_HP_PROCON_OTP1_S49ROM_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_OTP1_Bits.S49ROM */
#define IFX_DMU_HP_PROCON_OTP1_S49ROM_OFF (17u)

/** \brief  Length for Ifx_DMU_HP_PROCON_OTP1_Bits.S50ROM */
#define IFX_DMU_HP_PROCON_OTP1_S50ROM_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_OTP1_Bits.S50ROM */
#define IFX_DMU_HP_PROCON_OTP1_S50ROM_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_OTP1_Bits.S50ROM */
#define IFX_DMU_HP_PROCON_OTP1_S50ROM_OFF (18u)

/** \brief  Length for Ifx_DMU_HP_PROCON_OTP1_Bits.S51ROM */
#define IFX_DMU_HP_PROCON_OTP1_S51ROM_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_OTP1_Bits.S51ROM */
#define IFX_DMU_HP_PROCON_OTP1_S51ROM_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_OTP1_Bits.S51ROM */
#define IFX_DMU_HP_PROCON_OTP1_S51ROM_OFF (19u)

/** \brief  Length for Ifx_DMU_HP_PROCON_OTP1_Bits.S52ROM */
#define IFX_DMU_HP_PROCON_OTP1_S52ROM_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_OTP1_Bits.S52ROM */
#define IFX_DMU_HP_PROCON_OTP1_S52ROM_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_OTP1_Bits.S52ROM */
#define IFX_DMU_HP_PROCON_OTP1_S52ROM_OFF (20u)

/** \brief  Length for Ifx_DMU_HP_PROCON_OTP1_Bits.S53ROM */
#define IFX_DMU_HP_PROCON_OTP1_S53ROM_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_OTP1_Bits.S53ROM */
#define IFX_DMU_HP_PROCON_OTP1_S53ROM_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_OTP1_Bits.S53ROM */
#define IFX_DMU_HP_PROCON_OTP1_S53ROM_OFF (21u)

/** \brief  Length for Ifx_DMU_HP_PROCON_OTP1_Bits.S54ROM */
#define IFX_DMU_HP_PROCON_OTP1_S54ROM_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_OTP1_Bits.S54ROM */
#define IFX_DMU_HP_PROCON_OTP1_S54ROM_MSK (0x1u)

