Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxDmu_bf.h
/** \brief  Offset for Ifx_DMU_HP_PROCON_OTP1_Bits.S54ROM */
#define IFX_DMU_HP_PROCON_OTP1_S54ROM_OFF (22u)

/** \brief  Length for Ifx_DMU_HP_PROCON_OTP1_Bits.S55ROM */
#define IFX_DMU_HP_PROCON_OTP1_S55ROM_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_OTP1_Bits.S55ROM */
#define IFX_DMU_HP_PROCON_OTP1_S55ROM_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_OTP1_Bits.S55ROM */
#define IFX_DMU_HP_PROCON_OTP1_S55ROM_OFF (23u)

/** \brief  Length for Ifx_DMU_HP_PROCON_OTP1_Bits.S56ROM */
#define IFX_DMU_HP_PROCON_OTP1_S56ROM_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_OTP1_Bits.S56ROM */
#define IFX_DMU_HP_PROCON_OTP1_S56ROM_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_OTP1_Bits.S56ROM */
#define IFX_DMU_HP_PROCON_OTP1_S56ROM_OFF (24u)

/** \brief  Length for Ifx_DMU_HP_PROCON_OTP1_Bits.S57ROM */
#define IFX_DMU_HP_PROCON_OTP1_S57ROM_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_OTP1_Bits.S57ROM */
#define IFX_DMU_HP_PROCON_OTP1_S57ROM_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_OTP1_Bits.S57ROM */
#define IFX_DMU_HP_PROCON_OTP1_S57ROM_OFF (25u)

/** \brief  Length for Ifx_DMU_HP_PROCON_OTP1_Bits.S58ROM */
#define IFX_DMU_HP_PROCON_OTP1_S58ROM_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_OTP1_Bits.S58ROM */
#define IFX_DMU_HP_PROCON_OTP1_S58ROM_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_OTP1_Bits.S58ROM */
#define IFX_DMU_HP_PROCON_OTP1_S58ROM_OFF (26u)

/** \brief  Length for Ifx_DMU_HP_PROCON_OTP1_Bits.S59ROM */
#define IFX_DMU_HP_PROCON_OTP1_S59ROM_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_OTP1_Bits.S59ROM */
#define IFX_DMU_HP_PROCON_OTP1_S59ROM_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_OTP1_Bits.S59ROM */
#define IFX_DMU_HP_PROCON_OTP1_S59ROM_OFF (27u)

/** \brief  Length for Ifx_DMU_HP_PROCON_OTP1_Bits.S60ROM */
#define IFX_DMU_HP_PROCON_OTP1_S60ROM_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_OTP1_Bits.S60ROM */
#define IFX_DMU_HP_PROCON_OTP1_S60ROM_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_OTP1_Bits.S60ROM */
#define IFX_DMU_HP_PROCON_OTP1_S60ROM_OFF (28u)

/** \brief  Length for Ifx_DMU_HP_PROCON_OTP1_Bits.S61ROM */
#define IFX_DMU_HP_PROCON_OTP1_S61ROM_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_OTP1_Bits.S61ROM */
#define IFX_DMU_HP_PROCON_OTP1_S61ROM_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_OTP1_Bits.S61ROM */
#define IFX_DMU_HP_PROCON_OTP1_S61ROM_OFF (29u)

/** \brief  Length for Ifx_DMU_HP_PROCON_OTP1_Bits.S62ROM */
#define IFX_DMU_HP_PROCON_OTP1_S62ROM_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_OTP1_Bits.S62ROM */
#define IFX_DMU_HP_PROCON_OTP1_S62ROM_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_OTP1_Bits.S62ROM */
#define IFX_DMU_HP_PROCON_OTP1_S62ROM_OFF (30u)

/** \brief  Length for Ifx_DMU_HP_PROCON_OTP1_Bits.S63ROM */
#define IFX_DMU_HP_PROCON_OTP1_S63ROM_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_OTP1_Bits.S63ROM */
#define IFX_DMU_HP_PROCON_OTP1_S63ROM_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_OTP1_Bits.S63ROM */
#define IFX_DMU_HP_PROCON_OTP1_S63ROM_OFF (31u)

/** \brief  Length for Ifx_DMU_HP_PROCON_OTP2_Bits.S64ROM */
#define IFX_DMU_HP_PROCON_OTP2_S64ROM_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_OTP2_Bits.S64ROM */
#define IFX_DMU_HP_PROCON_OTP2_S64ROM_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_OTP2_Bits.S64ROM */
#define IFX_DMU_HP_PROCON_OTP2_S64ROM_OFF (0u)

/** \brief  Length for Ifx_DMU_HP_PROCON_OTP2_Bits.S65ROM */
#define IFX_DMU_HP_PROCON_OTP2_S65ROM_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_OTP2_Bits.S65ROM */
#define IFX_DMU_HP_PROCON_OTP2_S65ROM_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_OTP2_Bits.S65ROM */
#define IFX_DMU_HP_PROCON_OTP2_S65ROM_OFF (1u)

/** \brief  Length for Ifx_DMU_HP_PROCON_OTP2_Bits.S66ROM */
#define IFX_DMU_HP_PROCON_OTP2_S66ROM_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_OTP2_Bits.S66ROM */
#define IFX_DMU_HP_PROCON_OTP2_S66ROM_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_OTP2_Bits.S66ROM */
#define IFX_DMU_HP_PROCON_OTP2_S66ROM_OFF (2u)

/** \brief  Length for Ifx_DMU_HP_PROCON_OTP2_Bits.S67ROM */
#define IFX_DMU_HP_PROCON_OTP2_S67ROM_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_OTP2_Bits.S67ROM */
#define IFX_DMU_HP_PROCON_OTP2_S67ROM_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_OTP2_Bits.S67ROM */
#define IFX_DMU_HP_PROCON_OTP2_S67ROM_OFF (3u)

/** \brief  Length for Ifx_DMU_HP_PROCON_OTP2_Bits.S68ROM */
#define IFX_DMU_HP_PROCON_OTP2_S68ROM_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_OTP2_Bits.S68ROM */
#define IFX_DMU_HP_PROCON_OTP2_S68ROM_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_OTP2_Bits.S68ROM */
#define IFX_DMU_HP_PROCON_OTP2_S68ROM_OFF (4u)

/** \brief  Length for Ifx_DMU_HP_PROCON_OTP2_Bits.S69ROM */
#define IFX_DMU_HP_PROCON_OTP2_S69ROM_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_OTP2_Bits.S69ROM */
#define IFX_DMU_HP_PROCON_OTP2_S69ROM_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_OTP2_Bits.S69ROM */
#define IFX_DMU_HP_PROCON_OTP2_S69ROM_OFF (5u)

/** \brief  Length for Ifx_DMU_HP_PROCON_OTP2_Bits.S70ROM */
#define IFX_DMU_HP_PROCON_OTP2_S70ROM_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_OTP2_Bits.S70ROM */
#define IFX_DMU_HP_PROCON_OTP2_S70ROM_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_OTP2_Bits.S70ROM */
#define IFX_DMU_HP_PROCON_OTP2_S70ROM_OFF (6u)

/** \brief  Length for Ifx_DMU_HP_PROCON_OTP2_Bits.S71ROM */
#define IFX_DMU_HP_PROCON_OTP2_S71ROM_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_OTP2_Bits.S71ROM */
#define IFX_DMU_HP_PROCON_OTP2_S71ROM_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_OTP2_Bits.S71ROM */
#define IFX_DMU_HP_PROCON_OTP2_S71ROM_OFF (7u)

/** \brief  Length for Ifx_DMU_HP_PROCON_OTP2_Bits.S72ROM */
#define IFX_DMU_HP_PROCON_OTP2_S72ROM_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_OTP2_Bits.S72ROM */
#define IFX_DMU_HP_PROCON_OTP2_S72ROM_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_OTP2_Bits.S72ROM */
#define IFX_DMU_HP_PROCON_OTP2_S72ROM_OFF (8u)

