Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxDmu_bf.h
/** \brief  Length for Ifx_DMU_HP_PROCON_OTP2_Bits.S73ROM */
#define IFX_DMU_HP_PROCON_OTP2_S73ROM_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_OTP2_Bits.S73ROM */
#define IFX_DMU_HP_PROCON_OTP2_S73ROM_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_OTP2_Bits.S73ROM */
#define IFX_DMU_HP_PROCON_OTP2_S73ROM_OFF (9u)

/** \brief  Length for Ifx_DMU_HP_PROCON_OTP2_Bits.S74ROM */
#define IFX_DMU_HP_PROCON_OTP2_S74ROM_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_OTP2_Bits.S74ROM */
#define IFX_DMU_HP_PROCON_OTP2_S74ROM_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_OTP2_Bits.S74ROM */
#define IFX_DMU_HP_PROCON_OTP2_S74ROM_OFF (10u)

/** \brief  Length for Ifx_DMU_HP_PROCON_OTP2_Bits.S75ROM */
#define IFX_DMU_HP_PROCON_OTP2_S75ROM_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_OTP2_Bits.S75ROM */
#define IFX_DMU_HP_PROCON_OTP2_S75ROM_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_OTP2_Bits.S75ROM */
#define IFX_DMU_HP_PROCON_OTP2_S75ROM_OFF (11u)

/** \brief  Length for Ifx_DMU_HP_PROCON_OTP2_Bits.S76ROM */
#define IFX_DMU_HP_PROCON_OTP2_S76ROM_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_OTP2_Bits.S76ROM */
#define IFX_DMU_HP_PROCON_OTP2_S76ROM_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_OTP2_Bits.S76ROM */
#define IFX_DMU_HP_PROCON_OTP2_S76ROM_OFF (12u)

/** \brief  Length for Ifx_DMU_HP_PROCON_OTP2_Bits.S77ROM */
#define IFX_DMU_HP_PROCON_OTP2_S77ROM_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_OTP2_Bits.S77ROM */
#define IFX_DMU_HP_PROCON_OTP2_S77ROM_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_OTP2_Bits.S77ROM */
#define IFX_DMU_HP_PROCON_OTP2_S77ROM_OFF (13u)

/** \brief  Length for Ifx_DMU_HP_PROCON_OTP2_Bits.S78ROM */
#define IFX_DMU_HP_PROCON_OTP2_S78ROM_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_OTP2_Bits.S78ROM */
#define IFX_DMU_HP_PROCON_OTP2_S78ROM_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_OTP2_Bits.S78ROM */
#define IFX_DMU_HP_PROCON_OTP2_S78ROM_OFF (14u)

/** \brief  Length for Ifx_DMU_HP_PROCON_OTP2_Bits.S79ROM */
#define IFX_DMU_HP_PROCON_OTP2_S79ROM_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_OTP2_Bits.S79ROM */
#define IFX_DMU_HP_PROCON_OTP2_S79ROM_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_OTP2_Bits.S79ROM */
#define IFX_DMU_HP_PROCON_OTP2_S79ROM_OFF (15u)

/** \brief  Length for Ifx_DMU_HP_PROCON_OTP2_Bits.S80ROM */
#define IFX_DMU_HP_PROCON_OTP2_S80ROM_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_OTP2_Bits.S80ROM */
#define IFX_DMU_HP_PROCON_OTP2_S80ROM_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_OTP2_Bits.S80ROM */
#define IFX_DMU_HP_PROCON_OTP2_S80ROM_OFF (16u)

/** \brief  Length for Ifx_DMU_HP_PROCON_OTP2_Bits.S81ROM */
#define IFX_DMU_HP_PROCON_OTP2_S81ROM_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_OTP2_Bits.S81ROM */
#define IFX_DMU_HP_PROCON_OTP2_S81ROM_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_OTP2_Bits.S81ROM */
#define IFX_DMU_HP_PROCON_OTP2_S81ROM_OFF (17u)

/** \brief  Length for Ifx_DMU_HP_PROCON_OTP2_Bits.S82ROM */
#define IFX_DMU_HP_PROCON_OTP2_S82ROM_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_OTP2_Bits.S82ROM */
#define IFX_DMU_HP_PROCON_OTP2_S82ROM_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_OTP2_Bits.S82ROM */
#define IFX_DMU_HP_PROCON_OTP2_S82ROM_OFF (18u)

/** \brief  Length for Ifx_DMU_HP_PROCON_OTP2_Bits.S83ROM */
#define IFX_DMU_HP_PROCON_OTP2_S83ROM_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_OTP2_Bits.S83ROM */
#define IFX_DMU_HP_PROCON_OTP2_S83ROM_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_OTP2_Bits.S83ROM */
#define IFX_DMU_HP_PROCON_OTP2_S83ROM_OFF (19u)

/** \brief  Length for Ifx_DMU_HP_PROCON_OTP2_Bits.S84ROM */
#define IFX_DMU_HP_PROCON_OTP2_S84ROM_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_OTP2_Bits.S84ROM */
#define IFX_DMU_HP_PROCON_OTP2_S84ROM_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_OTP2_Bits.S84ROM */
#define IFX_DMU_HP_PROCON_OTP2_S84ROM_OFF (20u)

/** \brief  Length for Ifx_DMU_HP_PROCON_OTP2_Bits.S85ROM */
#define IFX_DMU_HP_PROCON_OTP2_S85ROM_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_OTP2_Bits.S85ROM */
#define IFX_DMU_HP_PROCON_OTP2_S85ROM_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_OTP2_Bits.S85ROM */
#define IFX_DMU_HP_PROCON_OTP2_S85ROM_OFF (21u)

/** \brief  Length for Ifx_DMU_HP_PROCON_OTP2_Bits.S86ROM */
#define IFX_DMU_HP_PROCON_OTP2_S86ROM_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_OTP2_Bits.S86ROM */
#define IFX_DMU_HP_PROCON_OTP2_S86ROM_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_OTP2_Bits.S86ROM */
#define IFX_DMU_HP_PROCON_OTP2_S86ROM_OFF (22u)

/** \brief  Length for Ifx_DMU_HP_PROCON_OTP2_Bits.S87ROM */
#define IFX_DMU_HP_PROCON_OTP2_S87ROM_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_OTP2_Bits.S87ROM */
#define IFX_DMU_HP_PROCON_OTP2_S87ROM_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_OTP2_Bits.S87ROM */
#define IFX_DMU_HP_PROCON_OTP2_S87ROM_OFF (23u)

/** \brief  Length for Ifx_DMU_HP_PROCON_OTP2_Bits.S88ROM */
#define IFX_DMU_HP_PROCON_OTP2_S88ROM_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_OTP2_Bits.S88ROM */
#define IFX_DMU_HP_PROCON_OTP2_S88ROM_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_OTP2_Bits.S88ROM */
#define IFX_DMU_HP_PROCON_OTP2_S88ROM_OFF (24u)

/** \brief  Length for Ifx_DMU_HP_PROCON_OTP2_Bits.S89ROM */
#define IFX_DMU_HP_PROCON_OTP2_S89ROM_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_OTP2_Bits.S89ROM */
#define IFX_DMU_HP_PROCON_OTP2_S89ROM_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_OTP2_Bits.S89ROM */
#define IFX_DMU_HP_PROCON_OTP2_S89ROM_OFF (25u)

/** \brief  Length for Ifx_DMU_HP_PROCON_OTP2_Bits.S90ROM */
#define IFX_DMU_HP_PROCON_OTP2_S90ROM_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_OTP2_Bits.S90ROM */
#define IFX_DMU_HP_PROCON_OTP2_S90ROM_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_OTP2_Bits.S90ROM */
#define IFX_DMU_HP_PROCON_OTP2_S90ROM_OFF (26u)

/** \brief  Length for Ifx_DMU_HP_PROCON_OTP2_Bits.S91ROM */
#define IFX_DMU_HP_PROCON_OTP2_S91ROM_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_OTP2_Bits.S91ROM */
#define IFX_DMU_HP_PROCON_OTP2_S91ROM_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_OTP2_Bits.S91ROM */
#define IFX_DMU_HP_PROCON_OTP2_S91ROM_OFF (27u)

/** \brief  Length for Ifx_DMU_HP_PROCON_OTP2_Bits.S92ROM */
#define IFX_DMU_HP_PROCON_OTP2_S92ROM_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_OTP2_Bits.S92ROM */
#define IFX_DMU_HP_PROCON_OTP2_S92ROM_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_OTP2_Bits.S92ROM */
#define IFX_DMU_HP_PROCON_OTP2_S92ROM_OFF (28u)

/** \brief  Length for Ifx_DMU_HP_PROCON_OTP2_Bits.S93ROM */
#define IFX_DMU_HP_PROCON_OTP2_S93ROM_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_OTP2_Bits.S93ROM */
#define IFX_DMU_HP_PROCON_OTP2_S93ROM_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_OTP2_Bits.S93ROM */
#define IFX_DMU_HP_PROCON_OTP2_S93ROM_OFF (29u)

