Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxDmu_bf.h
/** \brief  Offset for Ifx_DMU_HP_PROCON_OTP3_Bits.S118ROM */
#define IFX_DMU_HP_PROCON_OTP3_S118ROM_OFF (22u)

/** \brief  Length for Ifx_DMU_HP_PROCON_OTP3_Bits.S119ROM */
#define IFX_DMU_HP_PROCON_OTP3_S119ROM_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_OTP3_Bits.S119ROM */
#define IFX_DMU_HP_PROCON_OTP3_S119ROM_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_OTP3_Bits.S119ROM */
#define IFX_DMU_HP_PROCON_OTP3_S119ROM_OFF (23u)

/** \brief  Length for Ifx_DMU_HP_PROCON_OTP3_Bits.S120ROM */
#define IFX_DMU_HP_PROCON_OTP3_S120ROM_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_OTP3_Bits.S120ROM */
#define IFX_DMU_HP_PROCON_OTP3_S120ROM_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_OTP3_Bits.S120ROM */
#define IFX_DMU_HP_PROCON_OTP3_S120ROM_OFF (24u)

/** \brief  Length for Ifx_DMU_HP_PROCON_OTP3_Bits.S121ROM */
#define IFX_DMU_HP_PROCON_OTP3_S121ROM_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_OTP3_Bits.S121ROM */
#define IFX_DMU_HP_PROCON_OTP3_S121ROM_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_OTP3_Bits.S121ROM */
#define IFX_DMU_HP_PROCON_OTP3_S121ROM_OFF (25u)

/** \brief  Length for Ifx_DMU_HP_PROCON_OTP3_Bits.S122ROM */
#define IFX_DMU_HP_PROCON_OTP3_S122ROM_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_OTP3_Bits.S122ROM */
#define IFX_DMU_HP_PROCON_OTP3_S122ROM_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_OTP3_Bits.S122ROM */
#define IFX_DMU_HP_PROCON_OTP3_S122ROM_OFF (26u)

/** \brief  Length for Ifx_DMU_HP_PROCON_OTP3_Bits.S123ROM */
#define IFX_DMU_HP_PROCON_OTP3_S123ROM_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_OTP3_Bits.S123ROM */
#define IFX_DMU_HP_PROCON_OTP3_S123ROM_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_OTP3_Bits.S123ROM */
#define IFX_DMU_HP_PROCON_OTP3_S123ROM_OFF (27u)

/** \brief  Length for Ifx_DMU_HP_PROCON_OTP3_Bits.S124ROM */
#define IFX_DMU_HP_PROCON_OTP3_S124ROM_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_OTP3_Bits.S124ROM */
#define IFX_DMU_HP_PROCON_OTP3_S124ROM_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_OTP3_Bits.S124ROM */
#define IFX_DMU_HP_PROCON_OTP3_S124ROM_OFF (28u)

/** \brief  Length for Ifx_DMU_HP_PROCON_OTP3_Bits.S125ROM */
#define IFX_DMU_HP_PROCON_OTP3_S125ROM_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_OTP3_Bits.S125ROM */
#define IFX_DMU_HP_PROCON_OTP3_S125ROM_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_OTP3_Bits.S125ROM */
#define IFX_DMU_HP_PROCON_OTP3_S125ROM_OFF (29u)

/** \brief  Length for Ifx_DMU_HP_PROCON_OTP3_Bits.S126ROM */
#define IFX_DMU_HP_PROCON_OTP3_S126ROM_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_OTP3_Bits.S126ROM */
#define IFX_DMU_HP_PROCON_OTP3_S126ROM_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_OTP3_Bits.S126ROM */
#define IFX_DMU_HP_PROCON_OTP3_S126ROM_OFF (30u)

/** \brief  Length for Ifx_DMU_HP_PROCON_OTP3_Bits.S127ROM */
#define IFX_DMU_HP_PROCON_OTP3_S127ROM_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_OTP3_Bits.S127ROM */
#define IFX_DMU_HP_PROCON_OTP3_S127ROM_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_OTP3_Bits.S127ROM */
#define IFX_DMU_HP_PROCON_OTP3_S127ROM_OFF (31u)

/** \brief  Length for Ifx_DMU_HP_PROCON_OTP3_Bits.S96ROM */
#define IFX_DMU_HP_PROCON_OTP3_S96ROM_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_OTP3_Bits.S96ROM */
#define IFX_DMU_HP_PROCON_OTP3_S96ROM_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_OTP3_Bits.S96ROM */
#define IFX_DMU_HP_PROCON_OTP3_S96ROM_OFF (0u)

/** \brief  Length for Ifx_DMU_HP_PROCON_OTP3_Bits.S97ROM */
#define IFX_DMU_HP_PROCON_OTP3_S97ROM_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_OTP3_Bits.S97ROM */
#define IFX_DMU_HP_PROCON_OTP3_S97ROM_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_OTP3_Bits.S97ROM */
#define IFX_DMU_HP_PROCON_OTP3_S97ROM_OFF (1u)

/** \brief  Length for Ifx_DMU_HP_PROCON_OTP3_Bits.S98ROM */
#define IFX_DMU_HP_PROCON_OTP3_S98ROM_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_OTP3_Bits.S98ROM */
#define IFX_DMU_HP_PROCON_OTP3_S98ROM_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_OTP3_Bits.S98ROM */
#define IFX_DMU_HP_PROCON_OTP3_S98ROM_OFF (2u)

/** \brief  Length for Ifx_DMU_HP_PROCON_OTP3_Bits.S99ROM */
#define IFX_DMU_HP_PROCON_OTP3_S99ROM_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_OTP3_Bits.S99ROM */
#define IFX_DMU_HP_PROCON_OTP3_S99ROM_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_OTP3_Bits.S99ROM */
#define IFX_DMU_HP_PROCON_OTP3_S99ROM_OFF (3u)

/** \brief  Length for Ifx_DMU_HP_PROCON_OTP4_Bits.S128ROM */
#define IFX_DMU_HP_PROCON_OTP4_S128ROM_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_OTP4_Bits.S128ROM */
#define IFX_DMU_HP_PROCON_OTP4_S128ROM_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_OTP4_Bits.S128ROM */
#define IFX_DMU_HP_PROCON_OTP4_S128ROM_OFF (0u)

/** \brief  Length for Ifx_DMU_HP_PROCON_OTP4_Bits.S129ROM */
#define IFX_DMU_HP_PROCON_OTP4_S129ROM_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_OTP4_Bits.S129ROM */
#define IFX_DMU_HP_PROCON_OTP4_S129ROM_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_OTP4_Bits.S129ROM */
#define IFX_DMU_HP_PROCON_OTP4_S129ROM_OFF (1u)

/** \brief  Length for Ifx_DMU_HP_PROCON_OTP4_Bits.S130ROM */
#define IFX_DMU_HP_PROCON_OTP4_S130ROM_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_OTP4_Bits.S130ROM */
#define IFX_DMU_HP_PROCON_OTP4_S130ROM_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_OTP4_Bits.S130ROM */
#define IFX_DMU_HP_PROCON_OTP4_S130ROM_OFF (2u)

/** \brief  Length for Ifx_DMU_HP_PROCON_OTP4_Bits.S131ROM */
#define IFX_DMU_HP_PROCON_OTP4_S131ROM_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_OTP4_Bits.S131ROM */
#define IFX_DMU_HP_PROCON_OTP4_S131ROM_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_OTP4_Bits.S131ROM */
#define IFX_DMU_HP_PROCON_OTP4_S131ROM_OFF (3u)

/** \brief  Length for Ifx_DMU_HP_PROCON_OTP4_Bits.S132ROM */
#define IFX_DMU_HP_PROCON_OTP4_S132ROM_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_OTP4_Bits.S132ROM */
#define IFX_DMU_HP_PROCON_OTP4_S132ROM_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_OTP4_Bits.S132ROM */
#define IFX_DMU_HP_PROCON_OTP4_S132ROM_OFF (4u)

/** \brief  Length for Ifx_DMU_HP_PROCON_OTP4_Bits.S133ROM */
#define IFX_DMU_HP_PROCON_OTP4_S133ROM_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_OTP4_Bits.S133ROM */
#define IFX_DMU_HP_PROCON_OTP4_S133ROM_MSK (0x1u)

