Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxDmu_bf.h
/** \brief  Offset for Ifx_DMU_HP_PROCON_OTP4_Bits.S133ROM */
#define IFX_DMU_HP_PROCON_OTP4_S133ROM_OFF (5u)

/** \brief  Length for Ifx_DMU_HP_PROCON_OTP4_Bits.S134ROM */
#define IFX_DMU_HP_PROCON_OTP4_S134ROM_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_OTP4_Bits.S134ROM */
#define IFX_DMU_HP_PROCON_OTP4_S134ROM_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_OTP4_Bits.S134ROM */
#define IFX_DMU_HP_PROCON_OTP4_S134ROM_OFF (6u)

/** \brief  Length for Ifx_DMU_HP_PROCON_OTP4_Bits.S135ROM */
#define IFX_DMU_HP_PROCON_OTP4_S135ROM_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_OTP4_Bits.S135ROM */
#define IFX_DMU_HP_PROCON_OTP4_S135ROM_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_OTP4_Bits.S135ROM */
#define IFX_DMU_HP_PROCON_OTP4_S135ROM_OFF (7u)

/** \brief  Length for Ifx_DMU_HP_PROCON_OTP4_Bits.S136ROM */
#define IFX_DMU_HP_PROCON_OTP4_S136ROM_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_OTP4_Bits.S136ROM */
#define IFX_DMU_HP_PROCON_OTP4_S136ROM_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_OTP4_Bits.S136ROM */
#define IFX_DMU_HP_PROCON_OTP4_S136ROM_OFF (8u)

/** \brief  Length for Ifx_DMU_HP_PROCON_OTP4_Bits.S137ROM */
#define IFX_DMU_HP_PROCON_OTP4_S137ROM_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_OTP4_Bits.S137ROM */
#define IFX_DMU_HP_PROCON_OTP4_S137ROM_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_OTP4_Bits.S137ROM */
#define IFX_DMU_HP_PROCON_OTP4_S137ROM_OFF (9u)

/** \brief  Length for Ifx_DMU_HP_PROCON_OTP4_Bits.S138ROM */
#define IFX_DMU_HP_PROCON_OTP4_S138ROM_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_OTP4_Bits.S138ROM */
#define IFX_DMU_HP_PROCON_OTP4_S138ROM_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_OTP4_Bits.S138ROM */
#define IFX_DMU_HP_PROCON_OTP4_S138ROM_OFF (10u)

/** \brief  Length for Ifx_DMU_HP_PROCON_OTP4_Bits.S139ROM */
#define IFX_DMU_HP_PROCON_OTP4_S139ROM_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_OTP4_Bits.S139ROM */
#define IFX_DMU_HP_PROCON_OTP4_S139ROM_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_OTP4_Bits.S139ROM */
#define IFX_DMU_HP_PROCON_OTP4_S139ROM_OFF (11u)

/** \brief  Length for Ifx_DMU_HP_PROCON_OTP4_Bits.S140ROM */
#define IFX_DMU_HP_PROCON_OTP4_S140ROM_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_OTP4_Bits.S140ROM */
#define IFX_DMU_HP_PROCON_OTP4_S140ROM_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_OTP4_Bits.S140ROM */
#define IFX_DMU_HP_PROCON_OTP4_S140ROM_OFF (12u)

/** \brief  Length for Ifx_DMU_HP_PROCON_OTP4_Bits.S141ROM */
#define IFX_DMU_HP_PROCON_OTP4_S141ROM_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_OTP4_Bits.S141ROM */
#define IFX_DMU_HP_PROCON_OTP4_S141ROM_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_OTP4_Bits.S141ROM */
#define IFX_DMU_HP_PROCON_OTP4_S141ROM_OFF (13u)

/** \brief  Length for Ifx_DMU_HP_PROCON_OTP4_Bits.S142ROM */
#define IFX_DMU_HP_PROCON_OTP4_S142ROM_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_OTP4_Bits.S142ROM */
#define IFX_DMU_HP_PROCON_OTP4_S142ROM_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_OTP4_Bits.S142ROM */
#define IFX_DMU_HP_PROCON_OTP4_S142ROM_OFF (14u)

/** \brief  Length for Ifx_DMU_HP_PROCON_OTP4_Bits.S143ROM */
#define IFX_DMU_HP_PROCON_OTP4_S143ROM_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_OTP4_Bits.S143ROM */
#define IFX_DMU_HP_PROCON_OTP4_S143ROM_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_OTP4_Bits.S143ROM */
#define IFX_DMU_HP_PROCON_OTP4_S143ROM_OFF (15u)

/** \brief  Length for Ifx_DMU_HP_PROCON_OTP4_Bits.S144ROM */
#define IFX_DMU_HP_PROCON_OTP4_S144ROM_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_OTP4_Bits.S144ROM */
#define IFX_DMU_HP_PROCON_OTP4_S144ROM_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_OTP4_Bits.S144ROM */
#define IFX_DMU_HP_PROCON_OTP4_S144ROM_OFF (16u)

/** \brief  Length for Ifx_DMU_HP_PROCON_OTP4_Bits.S145ROM */
#define IFX_DMU_HP_PROCON_OTP4_S145ROM_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_OTP4_Bits.S145ROM */
#define IFX_DMU_HP_PROCON_OTP4_S145ROM_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_OTP4_Bits.S145ROM */
#define IFX_DMU_HP_PROCON_OTP4_S145ROM_OFF (17u)

/** \brief  Length for Ifx_DMU_HP_PROCON_OTP4_Bits.S146ROM */
#define IFX_DMU_HP_PROCON_OTP4_S146ROM_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_OTP4_Bits.S146ROM */
#define IFX_DMU_HP_PROCON_OTP4_S146ROM_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_OTP4_Bits.S146ROM */
#define IFX_DMU_HP_PROCON_OTP4_S146ROM_OFF (18u)

/** \brief  Length for Ifx_DMU_HP_PROCON_OTP4_Bits.S147ROM */
#define IFX_DMU_HP_PROCON_OTP4_S147ROM_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_OTP4_Bits.S147ROM */
#define IFX_DMU_HP_PROCON_OTP4_S147ROM_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_OTP4_Bits.S147ROM */
#define IFX_DMU_HP_PROCON_OTP4_S147ROM_OFF (19u)

/** \brief  Length for Ifx_DMU_HP_PROCON_OTP4_Bits.S148ROM */
#define IFX_DMU_HP_PROCON_OTP4_S148ROM_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_OTP4_Bits.S148ROM */
#define IFX_DMU_HP_PROCON_OTP4_S148ROM_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_OTP4_Bits.S148ROM */
#define IFX_DMU_HP_PROCON_OTP4_S148ROM_OFF (20u)

/** \brief  Length for Ifx_DMU_HP_PROCON_OTP4_Bits.S149ROM */
#define IFX_DMU_HP_PROCON_OTP4_S149ROM_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_OTP4_Bits.S149ROM */
#define IFX_DMU_HP_PROCON_OTP4_S149ROM_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_OTP4_Bits.S149ROM */
#define IFX_DMU_HP_PROCON_OTP4_S149ROM_OFF (21u)

/** \brief  Length for Ifx_DMU_HP_PROCON_OTP4_Bits.S150ROM */
#define IFX_DMU_HP_PROCON_OTP4_S150ROM_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_OTP4_Bits.S150ROM */
#define IFX_DMU_HP_PROCON_OTP4_S150ROM_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_OTP4_Bits.S150ROM */
#define IFX_DMU_HP_PROCON_OTP4_S150ROM_OFF (22u)

/** \brief  Length for Ifx_DMU_HP_PROCON_OTP4_Bits.S151ROM */
#define IFX_DMU_HP_PROCON_OTP4_S151ROM_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_OTP4_Bits.S151ROM */
#define IFX_DMU_HP_PROCON_OTP4_S151ROM_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_OTP4_Bits.S151ROM */
#define IFX_DMU_HP_PROCON_OTP4_S151ROM_OFF (23u)

