Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxDmu_bf.h
/** \brief  Length for Ifx_DMU_HP_PROCON_OTP4_Bits.S152ROM */
#define IFX_DMU_HP_PROCON_OTP4_S152ROM_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_OTP4_Bits.S152ROM */
#define IFX_DMU_HP_PROCON_OTP4_S152ROM_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_OTP4_Bits.S152ROM */
#define IFX_DMU_HP_PROCON_OTP4_S152ROM_OFF (24u)

/** \brief  Length for Ifx_DMU_HP_PROCON_OTP4_Bits.S153ROM */
#define IFX_DMU_HP_PROCON_OTP4_S153ROM_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_OTP4_Bits.S153ROM */
#define IFX_DMU_HP_PROCON_OTP4_S153ROM_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_OTP4_Bits.S153ROM */
#define IFX_DMU_HP_PROCON_OTP4_S153ROM_OFF (25u)

/** \brief  Length for Ifx_DMU_HP_PROCON_OTP4_Bits.S154ROM */
#define IFX_DMU_HP_PROCON_OTP4_S154ROM_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_OTP4_Bits.S154ROM */
#define IFX_DMU_HP_PROCON_OTP4_S154ROM_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_OTP4_Bits.S154ROM */
#define IFX_DMU_HP_PROCON_OTP4_S154ROM_OFF (26u)

/** \brief  Length for Ifx_DMU_HP_PROCON_OTP4_Bits.S155ROM */
#define IFX_DMU_HP_PROCON_OTP4_S155ROM_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_OTP4_Bits.S155ROM */
#define IFX_DMU_HP_PROCON_OTP4_S155ROM_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_OTP4_Bits.S155ROM */
#define IFX_DMU_HP_PROCON_OTP4_S155ROM_OFF (27u)

/** \brief  Length for Ifx_DMU_HP_PROCON_OTP4_Bits.S156ROM */
#define IFX_DMU_HP_PROCON_OTP4_S156ROM_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_OTP4_Bits.S156ROM */
#define IFX_DMU_HP_PROCON_OTP4_S156ROM_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_OTP4_Bits.S156ROM */
#define IFX_DMU_HP_PROCON_OTP4_S156ROM_OFF (28u)

/** \brief  Length for Ifx_DMU_HP_PROCON_OTP4_Bits.S157ROM */
#define IFX_DMU_HP_PROCON_OTP4_S157ROM_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_OTP4_Bits.S157ROM */
#define IFX_DMU_HP_PROCON_OTP4_S157ROM_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_OTP4_Bits.S157ROM */
#define IFX_DMU_HP_PROCON_OTP4_S157ROM_OFF (29u)

/** \brief  Length for Ifx_DMU_HP_PROCON_OTP4_Bits.S158ROM */
#define IFX_DMU_HP_PROCON_OTP4_S158ROM_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_OTP4_Bits.S158ROM */
#define IFX_DMU_HP_PROCON_OTP4_S158ROM_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_OTP4_Bits.S158ROM */
#define IFX_DMU_HP_PROCON_OTP4_S158ROM_OFF (30u)

/** \brief  Length for Ifx_DMU_HP_PROCON_OTP4_Bits.S159ROM */
#define IFX_DMU_HP_PROCON_OTP4_S159ROM_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_OTP4_Bits.S159ROM */
#define IFX_DMU_HP_PROCON_OTP4_S159ROM_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_OTP4_Bits.S159ROM */
#define IFX_DMU_HP_PROCON_OTP4_S159ROM_OFF (31u)

/** \brief  Length for Ifx_DMU_HP_PROCON_OTP5_Bits.S160ROM */
#define IFX_DMU_HP_PROCON_OTP5_S160ROM_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_OTP5_Bits.S160ROM */
#define IFX_DMU_HP_PROCON_OTP5_S160ROM_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_OTP5_Bits.S160ROM */
#define IFX_DMU_HP_PROCON_OTP5_S160ROM_OFF (0u)

/** \brief  Length for Ifx_DMU_HP_PROCON_OTP5_Bits.S161ROM */
#define IFX_DMU_HP_PROCON_OTP5_S161ROM_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_OTP5_Bits.S161ROM */
#define IFX_DMU_HP_PROCON_OTP5_S161ROM_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_OTP5_Bits.S161ROM */
#define IFX_DMU_HP_PROCON_OTP5_S161ROM_OFF (1u)

/** \brief  Length for Ifx_DMU_HP_PROCON_OTP5_Bits.S162ROM */
#define IFX_DMU_HP_PROCON_OTP5_S162ROM_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_OTP5_Bits.S162ROM */
#define IFX_DMU_HP_PROCON_OTP5_S162ROM_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_OTP5_Bits.S162ROM */
#define IFX_DMU_HP_PROCON_OTP5_S162ROM_OFF (2u)

/** \brief  Length for Ifx_DMU_HP_PROCON_OTP5_Bits.S163ROM */
#define IFX_DMU_HP_PROCON_OTP5_S163ROM_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_OTP5_Bits.S163ROM */
#define IFX_DMU_HP_PROCON_OTP5_S163ROM_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_OTP5_Bits.S163ROM */
#define IFX_DMU_HP_PROCON_OTP5_S163ROM_OFF (3u)

/** \brief  Length for Ifx_DMU_HP_PROCON_OTP5_Bits.S164ROM */
#define IFX_DMU_HP_PROCON_OTP5_S164ROM_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_OTP5_Bits.S164ROM */
#define IFX_DMU_HP_PROCON_OTP5_S164ROM_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_OTP5_Bits.S164ROM */
#define IFX_DMU_HP_PROCON_OTP5_S164ROM_OFF (4u)

/** \brief  Length for Ifx_DMU_HP_PROCON_OTP5_Bits.S165ROM */
#define IFX_DMU_HP_PROCON_OTP5_S165ROM_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_OTP5_Bits.S165ROM */
#define IFX_DMU_HP_PROCON_OTP5_S165ROM_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_OTP5_Bits.S165ROM */
#define IFX_DMU_HP_PROCON_OTP5_S165ROM_OFF (5u)

/** \brief  Length for Ifx_DMU_HP_PROCON_OTP5_Bits.S166ROM */
#define IFX_DMU_HP_PROCON_OTP5_S166ROM_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_OTP5_Bits.S166ROM */
#define IFX_DMU_HP_PROCON_OTP5_S166ROM_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_OTP5_Bits.S166ROM */
#define IFX_DMU_HP_PROCON_OTP5_S166ROM_OFF (6u)

/** \brief  Length for Ifx_DMU_HP_PROCON_OTP5_Bits.S167ROM */
#define IFX_DMU_HP_PROCON_OTP5_S167ROM_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_OTP5_Bits.S167ROM */
#define IFX_DMU_HP_PROCON_OTP5_S167ROM_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_OTP5_Bits.S167ROM */
#define IFX_DMU_HP_PROCON_OTP5_S167ROM_OFF (7u)

/** \brief  Length for Ifx_DMU_HP_PROCON_OTP5_Bits.S168ROM */
#define IFX_DMU_HP_PROCON_OTP5_S168ROM_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_OTP5_Bits.S168ROM */
#define IFX_DMU_HP_PROCON_OTP5_S168ROM_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_OTP5_Bits.S168ROM */
#define IFX_DMU_HP_PROCON_OTP5_S168ROM_OFF (8u)

/** \brief  Length for Ifx_DMU_HP_PROCON_OTP5_Bits.S169ROM */
#define IFX_DMU_HP_PROCON_OTP5_S169ROM_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_OTP5_Bits.S169ROM */
#define IFX_DMU_HP_PROCON_OTP5_S169ROM_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_OTP5_Bits.S169ROM */
#define IFX_DMU_HP_PROCON_OTP5_S169ROM_OFF (9u)

/** \brief  Length for Ifx_DMU_HP_PROCON_OTP5_Bits.S170ROM */
#define IFX_DMU_HP_PROCON_OTP5_S170ROM_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_OTP5_Bits.S170ROM */
#define IFX_DMU_HP_PROCON_OTP5_S170ROM_MSK (0x1u)

