Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxDmu_bf.h
/** \brief  Offset for Ifx_DMU_HP_PROCON_OTP5_Bits.S170ROM */
#define IFX_DMU_HP_PROCON_OTP5_S170ROM_OFF (10u)

/** \brief  Length for Ifx_DMU_HP_PROCON_OTP5_Bits.S171ROM */
#define IFX_DMU_HP_PROCON_OTP5_S171ROM_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_OTP5_Bits.S171ROM */
#define IFX_DMU_HP_PROCON_OTP5_S171ROM_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_OTP5_Bits.S171ROM */
#define IFX_DMU_HP_PROCON_OTP5_S171ROM_OFF (11u)

/** \brief  Length for Ifx_DMU_HP_PROCON_OTP5_Bits.S172ROM */
#define IFX_DMU_HP_PROCON_OTP5_S172ROM_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_OTP5_Bits.S172ROM */
#define IFX_DMU_HP_PROCON_OTP5_S172ROM_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_OTP5_Bits.S172ROM */
#define IFX_DMU_HP_PROCON_OTP5_S172ROM_OFF (12u)

/** \brief  Length for Ifx_DMU_HP_PROCON_OTP5_Bits.S173ROM */
#define IFX_DMU_HP_PROCON_OTP5_S173ROM_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_OTP5_Bits.S173ROM */
#define IFX_DMU_HP_PROCON_OTP5_S173ROM_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_OTP5_Bits.S173ROM */
#define IFX_DMU_HP_PROCON_OTP5_S173ROM_OFF (13u)

/** \brief  Length for Ifx_DMU_HP_PROCON_OTP5_Bits.S174ROM */
#define IFX_DMU_HP_PROCON_OTP5_S174ROM_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_OTP5_Bits.S174ROM */
#define IFX_DMU_HP_PROCON_OTP5_S174ROM_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_OTP5_Bits.S174ROM */
#define IFX_DMU_HP_PROCON_OTP5_S174ROM_OFF (14u)

/** \brief  Length for Ifx_DMU_HP_PROCON_OTP5_Bits.S175ROM */
#define IFX_DMU_HP_PROCON_OTP5_S175ROM_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_OTP5_Bits.S175ROM */
#define IFX_DMU_HP_PROCON_OTP5_S175ROM_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_OTP5_Bits.S175ROM */
#define IFX_DMU_HP_PROCON_OTP5_S175ROM_OFF (15u)

/** \brief  Length for Ifx_DMU_HP_PROCON_OTP5_Bits.S176ROM */
#define IFX_DMU_HP_PROCON_OTP5_S176ROM_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_OTP5_Bits.S176ROM */
#define IFX_DMU_HP_PROCON_OTP5_S176ROM_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_OTP5_Bits.S176ROM */
#define IFX_DMU_HP_PROCON_OTP5_S176ROM_OFF (16u)

/** \brief  Length for Ifx_DMU_HP_PROCON_OTP5_Bits.S177ROM */
#define IFX_DMU_HP_PROCON_OTP5_S177ROM_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_OTP5_Bits.S177ROM */
#define IFX_DMU_HP_PROCON_OTP5_S177ROM_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_OTP5_Bits.S177ROM */
#define IFX_DMU_HP_PROCON_OTP5_S177ROM_OFF (17u)

/** \brief  Length for Ifx_DMU_HP_PROCON_OTP5_Bits.S178ROM */
#define IFX_DMU_HP_PROCON_OTP5_S178ROM_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_OTP5_Bits.S178ROM */
#define IFX_DMU_HP_PROCON_OTP5_S178ROM_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_OTP5_Bits.S178ROM */
#define IFX_DMU_HP_PROCON_OTP5_S178ROM_OFF (18u)

/** \brief  Length for Ifx_DMU_HP_PROCON_OTP5_Bits.S179ROM */
#define IFX_DMU_HP_PROCON_OTP5_S179ROM_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_OTP5_Bits.S179ROM */
#define IFX_DMU_HP_PROCON_OTP5_S179ROM_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_OTP5_Bits.S179ROM */
#define IFX_DMU_HP_PROCON_OTP5_S179ROM_OFF (19u)

/** \brief  Length for Ifx_DMU_HP_PROCON_OTP5_Bits.S180ROM */
#define IFX_DMU_HP_PROCON_OTP5_S180ROM_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_OTP5_Bits.S180ROM */
#define IFX_DMU_HP_PROCON_OTP5_S180ROM_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_OTP5_Bits.S180ROM */
#define IFX_DMU_HP_PROCON_OTP5_S180ROM_OFF (20u)

/** \brief  Length for Ifx_DMU_HP_PROCON_OTP5_Bits.S181ROM */
#define IFX_DMU_HP_PROCON_OTP5_S181ROM_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_OTP5_Bits.S181ROM */
#define IFX_DMU_HP_PROCON_OTP5_S181ROM_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_OTP5_Bits.S181ROM */
#define IFX_DMU_HP_PROCON_OTP5_S181ROM_OFF (21u)

/** \brief  Length for Ifx_DMU_HP_PROCON_OTP5_Bits.S182ROM */
#define IFX_DMU_HP_PROCON_OTP5_S182ROM_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_OTP5_Bits.S182ROM */
#define IFX_DMU_HP_PROCON_OTP5_S182ROM_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_OTP5_Bits.S182ROM */
#define IFX_DMU_HP_PROCON_OTP5_S182ROM_OFF (22u)

/** \brief  Length for Ifx_DMU_HP_PROCON_OTP5_Bits.S183ROM */
#define IFX_DMU_HP_PROCON_OTP5_S183ROM_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_OTP5_Bits.S183ROM */
#define IFX_DMU_HP_PROCON_OTP5_S183ROM_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_OTP5_Bits.S183ROM */
#define IFX_DMU_HP_PROCON_OTP5_S183ROM_OFF (23u)

/** \brief  Length for Ifx_DMU_HP_PROCON_OTP5_Bits.S184ROM */
#define IFX_DMU_HP_PROCON_OTP5_S184ROM_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_OTP5_Bits.S184ROM */
#define IFX_DMU_HP_PROCON_OTP5_S184ROM_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_OTP5_Bits.S184ROM */
#define IFX_DMU_HP_PROCON_OTP5_S184ROM_OFF (24u)

/** \brief  Length for Ifx_DMU_HP_PROCON_OTP5_Bits.S185ROM */
#define IFX_DMU_HP_PROCON_OTP5_S185ROM_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_OTP5_Bits.S185ROM */
#define IFX_DMU_HP_PROCON_OTP5_S185ROM_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_OTP5_Bits.S185ROM */
#define IFX_DMU_HP_PROCON_OTP5_S185ROM_OFF (25u)

/** \brief  Length for Ifx_DMU_HP_PROCON_OTP5_Bits.S186ROM */
#define IFX_DMU_HP_PROCON_OTP5_S186ROM_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_OTP5_Bits.S186ROM */
#define IFX_DMU_HP_PROCON_OTP5_S186ROM_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_OTP5_Bits.S186ROM */
#define IFX_DMU_HP_PROCON_OTP5_S186ROM_OFF (26u)

/** \brief  Length for Ifx_DMU_HP_PROCON_OTP5_Bits.S187ROM */
#define IFX_DMU_HP_PROCON_OTP5_S187ROM_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_OTP5_Bits.S187ROM */
#define IFX_DMU_HP_PROCON_OTP5_S187ROM_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_OTP5_Bits.S187ROM */
#define IFX_DMU_HP_PROCON_OTP5_S187ROM_OFF (27u)

/** \brief  Length for Ifx_DMU_HP_PROCON_OTP5_Bits.S188ROM */
#define IFX_DMU_HP_PROCON_OTP5_S188ROM_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_OTP5_Bits.S188ROM */
#define IFX_DMU_HP_PROCON_OTP5_S188ROM_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_OTP5_Bits.S188ROM */
#define IFX_DMU_HP_PROCON_OTP5_S188ROM_OFF (28u)

