Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxDmu_bf.h
/** \brief  Length for Ifx_DMU_HP_PROCON_OTP5_Bits.S189ROM */
#define IFX_DMU_HP_PROCON_OTP5_S189ROM_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_OTP5_Bits.S189ROM */
#define IFX_DMU_HP_PROCON_OTP5_S189ROM_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_OTP5_Bits.S189ROM */
#define IFX_DMU_HP_PROCON_OTP5_S189ROM_OFF (29u)

/** \brief  Length for Ifx_DMU_HP_PROCON_OTP5_Bits.S190ROM */
#define IFX_DMU_HP_PROCON_OTP5_S190ROM_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_OTP5_Bits.S190ROM */
#define IFX_DMU_HP_PROCON_OTP5_S190ROM_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_OTP5_Bits.S190ROM */
#define IFX_DMU_HP_PROCON_OTP5_S190ROM_OFF (30u)

/** \brief  Length for Ifx_DMU_HP_PROCON_OTP5_Bits.S191ROM */
#define IFX_DMU_HP_PROCON_OTP5_S191ROM_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_OTP5_Bits.S191ROM */
#define IFX_DMU_HP_PROCON_OTP5_S191ROM_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_OTP5_Bits.S191ROM */
#define IFX_DMU_HP_PROCON_OTP5_S191ROM_OFF (31u)

/** \brief  Length for Ifx_DMU_HP_PROCON_P0_Bits.S0L */
#define IFX_DMU_HP_PROCON_P0_S0L_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_P0_Bits.S0L */
#define IFX_DMU_HP_PROCON_P0_S0L_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_P0_Bits.S0L */
#define IFX_DMU_HP_PROCON_P0_S0L_OFF (0u)

/** \brief  Length for Ifx_DMU_HP_PROCON_P0_Bits.S10L */
#define IFX_DMU_HP_PROCON_P0_S10L_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_P0_Bits.S10L */
#define IFX_DMU_HP_PROCON_P0_S10L_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_P0_Bits.S10L */
#define IFX_DMU_HP_PROCON_P0_S10L_OFF (10u)

/** \brief  Length for Ifx_DMU_HP_PROCON_P0_Bits.S11L */
#define IFX_DMU_HP_PROCON_P0_S11L_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_P0_Bits.S11L */
#define IFX_DMU_HP_PROCON_P0_S11L_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_P0_Bits.S11L */
#define IFX_DMU_HP_PROCON_P0_S11L_OFF (11u)

/** \brief  Length for Ifx_DMU_HP_PROCON_P0_Bits.S12L */
#define IFX_DMU_HP_PROCON_P0_S12L_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_P0_Bits.S12L */
#define IFX_DMU_HP_PROCON_P0_S12L_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_P0_Bits.S12L */
#define IFX_DMU_HP_PROCON_P0_S12L_OFF (12u)

/** \brief  Length for Ifx_DMU_HP_PROCON_P0_Bits.S13L */
#define IFX_DMU_HP_PROCON_P0_S13L_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_P0_Bits.S13L */
#define IFX_DMU_HP_PROCON_P0_S13L_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_P0_Bits.S13L */
#define IFX_DMU_HP_PROCON_P0_S13L_OFF (13u)

/** \brief  Length for Ifx_DMU_HP_PROCON_P0_Bits.S14L */
#define IFX_DMU_HP_PROCON_P0_S14L_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_P0_Bits.S14L */
#define IFX_DMU_HP_PROCON_P0_S14L_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_P0_Bits.S14L */
#define IFX_DMU_HP_PROCON_P0_S14L_OFF (14u)

/** \brief  Length for Ifx_DMU_HP_PROCON_P0_Bits.S15L */
#define IFX_DMU_HP_PROCON_P0_S15L_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_P0_Bits.S15L */
#define IFX_DMU_HP_PROCON_P0_S15L_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_P0_Bits.S15L */
#define IFX_DMU_HP_PROCON_P0_S15L_OFF (15u)

/** \brief  Length for Ifx_DMU_HP_PROCON_P0_Bits.S16L */
#define IFX_DMU_HP_PROCON_P0_S16L_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_P0_Bits.S16L */
#define IFX_DMU_HP_PROCON_P0_S16L_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_P0_Bits.S16L */
#define IFX_DMU_HP_PROCON_P0_S16L_OFF (16u)

/** \brief  Length for Ifx_DMU_HP_PROCON_P0_Bits.S17L */
#define IFX_DMU_HP_PROCON_P0_S17L_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_P0_Bits.S17L */
#define IFX_DMU_HP_PROCON_P0_S17L_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_P0_Bits.S17L */
#define IFX_DMU_HP_PROCON_P0_S17L_OFF (17u)

/** \brief  Length for Ifx_DMU_HP_PROCON_P0_Bits.S18L */
#define IFX_DMU_HP_PROCON_P0_S18L_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_P0_Bits.S18L */
#define IFX_DMU_HP_PROCON_P0_S18L_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_P0_Bits.S18L */
#define IFX_DMU_HP_PROCON_P0_S18L_OFF (18u)

/** \brief  Length for Ifx_DMU_HP_PROCON_P0_Bits.S19L */
#define IFX_DMU_HP_PROCON_P0_S19L_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_P0_Bits.S19L */
#define IFX_DMU_HP_PROCON_P0_S19L_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_P0_Bits.S19L */
#define IFX_DMU_HP_PROCON_P0_S19L_OFF (19u)

/** \brief  Length for Ifx_DMU_HP_PROCON_P0_Bits.S1L */
#define IFX_DMU_HP_PROCON_P0_S1L_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_P0_Bits.S1L */
#define IFX_DMU_HP_PROCON_P0_S1L_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_P0_Bits.S1L */
#define IFX_DMU_HP_PROCON_P0_S1L_OFF (1u)

/** \brief  Length for Ifx_DMU_HP_PROCON_P0_Bits.S20L */
#define IFX_DMU_HP_PROCON_P0_S20L_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_P0_Bits.S20L */
#define IFX_DMU_HP_PROCON_P0_S20L_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_P0_Bits.S20L */
#define IFX_DMU_HP_PROCON_P0_S20L_OFF (20u)

/** \brief  Length for Ifx_DMU_HP_PROCON_P0_Bits.S21L */
#define IFX_DMU_HP_PROCON_P0_S21L_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_P0_Bits.S21L */
#define IFX_DMU_HP_PROCON_P0_S21L_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_P0_Bits.S21L */
#define IFX_DMU_HP_PROCON_P0_S21L_OFF (21u)

/** \brief  Length for Ifx_DMU_HP_PROCON_P0_Bits.S22L */
#define IFX_DMU_HP_PROCON_P0_S22L_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_P0_Bits.S22L */
#define IFX_DMU_HP_PROCON_P0_S22L_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_P0_Bits.S22L */
#define IFX_DMU_HP_PROCON_P0_S22L_OFF (22u)

/** \brief  Length for Ifx_DMU_HP_PROCON_P0_Bits.S23L */
#define IFX_DMU_HP_PROCON_P0_S23L_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_P0_Bits.S23L */
#define IFX_DMU_HP_PROCON_P0_S23L_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_P0_Bits.S23L */
#define IFX_DMU_HP_PROCON_P0_S23L_OFF (23u)

/** \brief  Length for Ifx_DMU_HP_PROCON_P0_Bits.S24L */
#define IFX_DMU_HP_PROCON_P0_S24L_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_P0_Bits.S24L */
#define IFX_DMU_HP_PROCON_P0_S24L_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_P0_Bits.S24L */
#define IFX_DMU_HP_PROCON_P0_S24L_OFF (24u)

/** \brief  Length for Ifx_DMU_HP_PROCON_P0_Bits.S25L */
#define IFX_DMU_HP_PROCON_P0_S25L_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_P0_Bits.S25L */
#define IFX_DMU_HP_PROCON_P0_S25L_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_P0_Bits.S25L */
#define IFX_DMU_HP_PROCON_P0_S25L_OFF (25u)

/** \brief  Length for Ifx_DMU_HP_PROCON_P0_Bits.S26L */
#define IFX_DMU_HP_PROCON_P0_S26L_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_P0_Bits.S26L */
#define IFX_DMU_HP_PROCON_P0_S26L_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_P0_Bits.S26L */
#define IFX_DMU_HP_PROCON_P0_S26L_OFF (26u)

/** \brief  Length for Ifx_DMU_HP_PROCON_P0_Bits.S27L */
#define IFX_DMU_HP_PROCON_P0_S27L_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_P0_Bits.S27L */
#define IFX_DMU_HP_PROCON_P0_S27L_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_P0_Bits.S27L */
#define IFX_DMU_HP_PROCON_P0_S27L_OFF (27u)

/** \brief  Length for Ifx_DMU_HP_PROCON_P0_Bits.S28L */
#define IFX_DMU_HP_PROCON_P0_S28L_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_P0_Bits.S28L */
#define IFX_DMU_HP_PROCON_P0_S28L_MSK (0x1u)

