Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxDmu_bf.h
/** \brief  Offset for Ifx_DMU_HP_PROCON_P0_Bits.S28L */
#define IFX_DMU_HP_PROCON_P0_S28L_OFF (28u)

/** \brief  Length for Ifx_DMU_HP_PROCON_P0_Bits.S29L */
#define IFX_DMU_HP_PROCON_P0_S29L_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_P0_Bits.S29L */
#define IFX_DMU_HP_PROCON_P0_S29L_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_P0_Bits.S29L */
#define IFX_DMU_HP_PROCON_P0_S29L_OFF (29u)

/** \brief  Length for Ifx_DMU_HP_PROCON_P0_Bits.S2L */
#define IFX_DMU_HP_PROCON_P0_S2L_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_P0_Bits.S2L */
#define IFX_DMU_HP_PROCON_P0_S2L_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_P0_Bits.S2L */
#define IFX_DMU_HP_PROCON_P0_S2L_OFF (2u)

/** \brief  Length for Ifx_DMU_HP_PROCON_P0_Bits.S30L */
#define IFX_DMU_HP_PROCON_P0_S30L_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_P0_Bits.S30L */
#define IFX_DMU_HP_PROCON_P0_S30L_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_P0_Bits.S30L */
#define IFX_DMU_HP_PROCON_P0_S30L_OFF (30u)

/** \brief  Length for Ifx_DMU_HP_PROCON_P0_Bits.S31L */
#define IFX_DMU_HP_PROCON_P0_S31L_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_P0_Bits.S31L */
#define IFX_DMU_HP_PROCON_P0_S31L_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_P0_Bits.S31L */
#define IFX_DMU_HP_PROCON_P0_S31L_OFF (31u)

/** \brief  Length for Ifx_DMU_HP_PROCON_P0_Bits.S3L */
#define IFX_DMU_HP_PROCON_P0_S3L_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_P0_Bits.S3L */
#define IFX_DMU_HP_PROCON_P0_S3L_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_P0_Bits.S3L */
#define IFX_DMU_HP_PROCON_P0_S3L_OFF (3u)

/** \brief  Length for Ifx_DMU_HP_PROCON_P0_Bits.S4L */
#define IFX_DMU_HP_PROCON_P0_S4L_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_P0_Bits.S4L */
#define IFX_DMU_HP_PROCON_P0_S4L_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_P0_Bits.S4L */
#define IFX_DMU_HP_PROCON_P0_S4L_OFF (4u)

/** \brief  Length for Ifx_DMU_HP_PROCON_P0_Bits.S5L */
#define IFX_DMU_HP_PROCON_P0_S5L_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_P0_Bits.S5L */
#define IFX_DMU_HP_PROCON_P0_S5L_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_P0_Bits.S5L */
#define IFX_DMU_HP_PROCON_P0_S5L_OFF (5u)

/** \brief  Length for Ifx_DMU_HP_PROCON_P0_Bits.S6L */
#define IFX_DMU_HP_PROCON_P0_S6L_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_P0_Bits.S6L */
#define IFX_DMU_HP_PROCON_P0_S6L_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_P0_Bits.S6L */
#define IFX_DMU_HP_PROCON_P0_S6L_OFF (6u)

/** \brief  Length for Ifx_DMU_HP_PROCON_P0_Bits.S7L */
#define IFX_DMU_HP_PROCON_P0_S7L_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_P0_Bits.S7L */
#define IFX_DMU_HP_PROCON_P0_S7L_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_P0_Bits.S7L */
#define IFX_DMU_HP_PROCON_P0_S7L_OFF (7u)

/** \brief  Length for Ifx_DMU_HP_PROCON_P0_Bits.S8L */
#define IFX_DMU_HP_PROCON_P0_S8L_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_P0_Bits.S8L */
#define IFX_DMU_HP_PROCON_P0_S8L_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_P0_Bits.S8L */
#define IFX_DMU_HP_PROCON_P0_S8L_OFF (8u)

/** \brief  Length for Ifx_DMU_HP_PROCON_P0_Bits.S9L */
#define IFX_DMU_HP_PROCON_P0_S9L_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_P0_Bits.S9L */
#define IFX_DMU_HP_PROCON_P0_S9L_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_P0_Bits.S9L */
#define IFX_DMU_HP_PROCON_P0_S9L_OFF (9u)

/** \brief  Length for Ifx_DMU_HP_PROCON_P1_Bits.S32L */
#define IFX_DMU_HP_PROCON_P1_S32L_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_P1_Bits.S32L */
#define IFX_DMU_HP_PROCON_P1_S32L_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_P1_Bits.S32L */
#define IFX_DMU_HP_PROCON_P1_S32L_OFF (0u)

/** \brief  Length for Ifx_DMU_HP_PROCON_P1_Bits.S33L */
#define IFX_DMU_HP_PROCON_P1_S33L_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_P1_Bits.S33L */
#define IFX_DMU_HP_PROCON_P1_S33L_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_P1_Bits.S33L */
#define IFX_DMU_HP_PROCON_P1_S33L_OFF (1u)

/** \brief  Length for Ifx_DMU_HP_PROCON_P1_Bits.S34L */
#define IFX_DMU_HP_PROCON_P1_S34L_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_P1_Bits.S34L */
#define IFX_DMU_HP_PROCON_P1_S34L_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_P1_Bits.S34L */
#define IFX_DMU_HP_PROCON_P1_S34L_OFF (2u)

/** \brief  Length for Ifx_DMU_HP_PROCON_P1_Bits.S35L */
#define IFX_DMU_HP_PROCON_P1_S35L_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_P1_Bits.S35L */
#define IFX_DMU_HP_PROCON_P1_S35L_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_P1_Bits.S35L */
#define IFX_DMU_HP_PROCON_P1_S35L_OFF (3u)

/** \brief  Length for Ifx_DMU_HP_PROCON_P1_Bits.S36L */
#define IFX_DMU_HP_PROCON_P1_S36L_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_P1_Bits.S36L */
#define IFX_DMU_HP_PROCON_P1_S36L_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_P1_Bits.S36L */
#define IFX_DMU_HP_PROCON_P1_S36L_OFF (4u)

/** \brief  Length for Ifx_DMU_HP_PROCON_P1_Bits.S37L */
#define IFX_DMU_HP_PROCON_P1_S37L_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_P1_Bits.S37L */
#define IFX_DMU_HP_PROCON_P1_S37L_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_P1_Bits.S37L */
#define IFX_DMU_HP_PROCON_P1_S37L_OFF (5u)

/** \brief  Length for Ifx_DMU_HP_PROCON_P1_Bits.S38L */
#define IFX_DMU_HP_PROCON_P1_S38L_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_P1_Bits.S38L */
#define IFX_DMU_HP_PROCON_P1_S38L_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_P1_Bits.S38L */
#define IFX_DMU_HP_PROCON_P1_S38L_OFF (6u)

/** \brief  Length for Ifx_DMU_HP_PROCON_P1_Bits.S39L */
#define IFX_DMU_HP_PROCON_P1_S39L_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_P1_Bits.S39L */
#define IFX_DMU_HP_PROCON_P1_S39L_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_P1_Bits.S39L */
#define IFX_DMU_HP_PROCON_P1_S39L_OFF (7u)

/** \brief  Length for Ifx_DMU_HP_PROCON_P1_Bits.S40L */
#define IFX_DMU_HP_PROCON_P1_S40L_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_P1_Bits.S40L */
#define IFX_DMU_HP_PROCON_P1_S40L_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_P1_Bits.S40L */
#define IFX_DMU_HP_PROCON_P1_S40L_OFF (8u)

/** \brief  Length for Ifx_DMU_HP_PROCON_P1_Bits.S41L */
#define IFX_DMU_HP_PROCON_P1_S41L_LEN (1u)

