Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxDmu_bf.h
/** \brief  Mask for Ifx_DMU_HP_PROCON_P2_Bits.S64L */
#define IFX_DMU_HP_PROCON_P2_S64L_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_P2_Bits.S64L */
#define IFX_DMU_HP_PROCON_P2_S64L_OFF (0u)

/** \brief  Length for Ifx_DMU_HP_PROCON_P2_Bits.S65L */
#define IFX_DMU_HP_PROCON_P2_S65L_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_P2_Bits.S65L */
#define IFX_DMU_HP_PROCON_P2_S65L_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_P2_Bits.S65L */
#define IFX_DMU_HP_PROCON_P2_S65L_OFF (1u)

/** \brief  Length for Ifx_DMU_HP_PROCON_P2_Bits.S66L */
#define IFX_DMU_HP_PROCON_P2_S66L_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_P2_Bits.S66L */
#define IFX_DMU_HP_PROCON_P2_S66L_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_P2_Bits.S66L */
#define IFX_DMU_HP_PROCON_P2_S66L_OFF (2u)

/** \brief  Length for Ifx_DMU_HP_PROCON_P2_Bits.S67L */
#define IFX_DMU_HP_PROCON_P2_S67L_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_P2_Bits.S67L */
#define IFX_DMU_HP_PROCON_P2_S67L_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_P2_Bits.S67L */
#define IFX_DMU_HP_PROCON_P2_S67L_OFF (3u)

/** \brief  Length for Ifx_DMU_HP_PROCON_P2_Bits.S68L */
#define IFX_DMU_HP_PROCON_P2_S68L_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_P2_Bits.S68L */
#define IFX_DMU_HP_PROCON_P2_S68L_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_P2_Bits.S68L */
#define IFX_DMU_HP_PROCON_P2_S68L_OFF (4u)

/** \brief  Length for Ifx_DMU_HP_PROCON_P2_Bits.S69L */
#define IFX_DMU_HP_PROCON_P2_S69L_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_P2_Bits.S69L */
#define IFX_DMU_HP_PROCON_P2_S69L_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_P2_Bits.S69L */
#define IFX_DMU_HP_PROCON_P2_S69L_OFF (5u)

/** \brief  Length for Ifx_DMU_HP_PROCON_P2_Bits.S70L */
#define IFX_DMU_HP_PROCON_P2_S70L_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_P2_Bits.S70L */
#define IFX_DMU_HP_PROCON_P2_S70L_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_P2_Bits.S70L */
#define IFX_DMU_HP_PROCON_P2_S70L_OFF (6u)

/** \brief  Length for Ifx_DMU_HP_PROCON_P2_Bits.S71L */
#define IFX_DMU_HP_PROCON_P2_S71L_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_P2_Bits.S71L */
#define IFX_DMU_HP_PROCON_P2_S71L_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_P2_Bits.S71L */
#define IFX_DMU_HP_PROCON_P2_S71L_OFF (7u)

/** \brief  Length for Ifx_DMU_HP_PROCON_P2_Bits.S72L */
#define IFX_DMU_HP_PROCON_P2_S72L_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_P2_Bits.S72L */
#define IFX_DMU_HP_PROCON_P2_S72L_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_P2_Bits.S72L */
#define IFX_DMU_HP_PROCON_P2_S72L_OFF (8u)

/** \brief  Length for Ifx_DMU_HP_PROCON_P2_Bits.S73L */
#define IFX_DMU_HP_PROCON_P2_S73L_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_P2_Bits.S73L */
#define IFX_DMU_HP_PROCON_P2_S73L_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_P2_Bits.S73L */
#define IFX_DMU_HP_PROCON_P2_S73L_OFF (9u)

/** \brief  Length for Ifx_DMU_HP_PROCON_P2_Bits.S74L */
#define IFX_DMU_HP_PROCON_P2_S74L_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_P2_Bits.S74L */
#define IFX_DMU_HP_PROCON_P2_S74L_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_P2_Bits.S74L */
#define IFX_DMU_HP_PROCON_P2_S74L_OFF (10u)

/** \brief  Length for Ifx_DMU_HP_PROCON_P2_Bits.S75L */
#define IFX_DMU_HP_PROCON_P2_S75L_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_P2_Bits.S75L */
#define IFX_DMU_HP_PROCON_P2_S75L_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_P2_Bits.S75L */
#define IFX_DMU_HP_PROCON_P2_S75L_OFF (11u)

/** \brief  Length for Ifx_DMU_HP_PROCON_P2_Bits.S76L */
#define IFX_DMU_HP_PROCON_P2_S76L_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_P2_Bits.S76L */
#define IFX_DMU_HP_PROCON_P2_S76L_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_P2_Bits.S76L */
#define IFX_DMU_HP_PROCON_P2_S76L_OFF (12u)

/** \brief  Length for Ifx_DMU_HP_PROCON_P2_Bits.S77L */
#define IFX_DMU_HP_PROCON_P2_S77L_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_P2_Bits.S77L */
#define IFX_DMU_HP_PROCON_P2_S77L_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_P2_Bits.S77L */
#define IFX_DMU_HP_PROCON_P2_S77L_OFF (13u)

/** \brief  Length for Ifx_DMU_HP_PROCON_P2_Bits.S78L */
#define IFX_DMU_HP_PROCON_P2_S78L_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_P2_Bits.S78L */
#define IFX_DMU_HP_PROCON_P2_S78L_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_P2_Bits.S78L */
#define IFX_DMU_HP_PROCON_P2_S78L_OFF (14u)

/** \brief  Length for Ifx_DMU_HP_PROCON_P2_Bits.S79L */
#define IFX_DMU_HP_PROCON_P2_S79L_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_P2_Bits.S79L */
#define IFX_DMU_HP_PROCON_P2_S79L_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_P2_Bits.S79L */
#define IFX_DMU_HP_PROCON_P2_S79L_OFF (15u)

/** \brief  Length for Ifx_DMU_HP_PROCON_P2_Bits.S80L */
#define IFX_DMU_HP_PROCON_P2_S80L_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_P2_Bits.S80L */
#define IFX_DMU_HP_PROCON_P2_S80L_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_P2_Bits.S80L */
#define IFX_DMU_HP_PROCON_P2_S80L_OFF (16u)

/** \brief  Length for Ifx_DMU_HP_PROCON_P2_Bits.S81L */
#define IFX_DMU_HP_PROCON_P2_S81L_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_P2_Bits.S81L */
#define IFX_DMU_HP_PROCON_P2_S81L_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_P2_Bits.S81L */
#define IFX_DMU_HP_PROCON_P2_S81L_OFF (17u)

/** \brief  Length for Ifx_DMU_HP_PROCON_P2_Bits.S82L */
#define IFX_DMU_HP_PROCON_P2_S82L_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_P2_Bits.S82L */
#define IFX_DMU_HP_PROCON_P2_S82L_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_P2_Bits.S82L */
#define IFX_DMU_HP_PROCON_P2_S82L_OFF (18u)

/** \brief  Length for Ifx_DMU_HP_PROCON_P2_Bits.S83L */
#define IFX_DMU_HP_PROCON_P2_S83L_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_P2_Bits.S83L */
#define IFX_DMU_HP_PROCON_P2_S83L_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_P2_Bits.S83L */
#define IFX_DMU_HP_PROCON_P2_S83L_OFF (19u)

/** \brief  Length for Ifx_DMU_HP_PROCON_P2_Bits.S84L */
#define IFX_DMU_HP_PROCON_P2_S84L_LEN (1u)

