Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxDmu_bf.h
/** \brief  Offset for Ifx_DMU_HP_PROCON_P3_Bits.S98L */
#define IFX_DMU_HP_PROCON_P3_S98L_OFF (2u)

/** \brief  Length for Ifx_DMU_HP_PROCON_P3_Bits.S99L */
#define IFX_DMU_HP_PROCON_P3_S99L_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_P3_Bits.S99L */
#define IFX_DMU_HP_PROCON_P3_S99L_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_P3_Bits.S99L */
#define IFX_DMU_HP_PROCON_P3_S99L_OFF (3u)

/** \brief  Length for Ifx_DMU_HP_PROCON_P4_Bits.S128L */
#define IFX_DMU_HP_PROCON_P4_S128L_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_P4_Bits.S128L */
#define IFX_DMU_HP_PROCON_P4_S128L_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_P4_Bits.S128L */
#define IFX_DMU_HP_PROCON_P4_S128L_OFF (0u)

/** \brief  Length for Ifx_DMU_HP_PROCON_P4_Bits.S129L */
#define IFX_DMU_HP_PROCON_P4_S129L_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_P4_Bits.S129L */
#define IFX_DMU_HP_PROCON_P4_S129L_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_P4_Bits.S129L */
#define IFX_DMU_HP_PROCON_P4_S129L_OFF (1u)

/** \brief  Length for Ifx_DMU_HP_PROCON_P4_Bits.S130L */
#define IFX_DMU_HP_PROCON_P4_S130L_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_P4_Bits.S130L */
#define IFX_DMU_HP_PROCON_P4_S130L_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_P4_Bits.S130L */
#define IFX_DMU_HP_PROCON_P4_S130L_OFF (2u)

/** \brief  Length for Ifx_DMU_HP_PROCON_P4_Bits.S131L */
#define IFX_DMU_HP_PROCON_P4_S131L_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_P4_Bits.S131L */
#define IFX_DMU_HP_PROCON_P4_S131L_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_P4_Bits.S131L */
#define IFX_DMU_HP_PROCON_P4_S131L_OFF (3u)

/** \brief  Length for Ifx_DMU_HP_PROCON_P4_Bits.S132L */
#define IFX_DMU_HP_PROCON_P4_S132L_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_P4_Bits.S132L */
#define IFX_DMU_HP_PROCON_P4_S132L_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_P4_Bits.S132L */
#define IFX_DMU_HP_PROCON_P4_S132L_OFF (4u)

/** \brief  Length for Ifx_DMU_HP_PROCON_P4_Bits.S133L */
#define IFX_DMU_HP_PROCON_P4_S133L_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_P4_Bits.S133L */
#define IFX_DMU_HP_PROCON_P4_S133L_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_P4_Bits.S133L */
#define IFX_DMU_HP_PROCON_P4_S133L_OFF (5u)

/** \brief  Length for Ifx_DMU_HP_PROCON_P4_Bits.S134L */
#define IFX_DMU_HP_PROCON_P4_S134L_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_P4_Bits.S134L */
#define IFX_DMU_HP_PROCON_P4_S134L_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_P4_Bits.S134L */
#define IFX_DMU_HP_PROCON_P4_S134L_OFF (6u)

/** \brief  Length for Ifx_DMU_HP_PROCON_P4_Bits.S135L */
#define IFX_DMU_HP_PROCON_P4_S135L_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_P4_Bits.S135L */
#define IFX_DMU_HP_PROCON_P4_S135L_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_P4_Bits.S135L */
#define IFX_DMU_HP_PROCON_P4_S135L_OFF (7u)

/** \brief  Length for Ifx_DMU_HP_PROCON_P4_Bits.S136L */
#define IFX_DMU_HP_PROCON_P4_S136L_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_P4_Bits.S136L */
#define IFX_DMU_HP_PROCON_P4_S136L_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_P4_Bits.S136L */
#define IFX_DMU_HP_PROCON_P4_S136L_OFF (8u)

/** \brief  Length for Ifx_DMU_HP_PROCON_P4_Bits.S137L */
#define IFX_DMU_HP_PROCON_P4_S137L_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_P4_Bits.S137L */
#define IFX_DMU_HP_PROCON_P4_S137L_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_P4_Bits.S137L */
#define IFX_DMU_HP_PROCON_P4_S137L_OFF (9u)

/** \brief  Length for Ifx_DMU_HP_PROCON_P4_Bits.S138L */
#define IFX_DMU_HP_PROCON_P4_S138L_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_P4_Bits.S138L */
#define IFX_DMU_HP_PROCON_P4_S138L_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_P4_Bits.S138L */
#define IFX_DMU_HP_PROCON_P4_S138L_OFF (10u)

/** \brief  Length for Ifx_DMU_HP_PROCON_P4_Bits.S139L */
#define IFX_DMU_HP_PROCON_P4_S139L_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_P4_Bits.S139L */
#define IFX_DMU_HP_PROCON_P4_S139L_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_P4_Bits.S139L */
#define IFX_DMU_HP_PROCON_P4_S139L_OFF (11u)

/** \brief  Length for Ifx_DMU_HP_PROCON_P4_Bits.S140L */
#define IFX_DMU_HP_PROCON_P4_S140L_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_P4_Bits.S140L */
#define IFX_DMU_HP_PROCON_P4_S140L_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_P4_Bits.S140L */
#define IFX_DMU_HP_PROCON_P4_S140L_OFF (12u)

/** \brief  Length for Ifx_DMU_HP_PROCON_P4_Bits.S141L */
#define IFX_DMU_HP_PROCON_P4_S141L_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_P4_Bits.S141L */
#define IFX_DMU_HP_PROCON_P4_S141L_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_P4_Bits.S141L */
#define IFX_DMU_HP_PROCON_P4_S141L_OFF (13u)

/** \brief  Length for Ifx_DMU_HP_PROCON_P4_Bits.S142L */
#define IFX_DMU_HP_PROCON_P4_S142L_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_P4_Bits.S142L */
#define IFX_DMU_HP_PROCON_P4_S142L_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_P4_Bits.S142L */
#define IFX_DMU_HP_PROCON_P4_S142L_OFF (14u)

/** \brief  Length for Ifx_DMU_HP_PROCON_P4_Bits.S143L */
#define IFX_DMU_HP_PROCON_P4_S143L_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_P4_Bits.S143L */
#define IFX_DMU_HP_PROCON_P4_S143L_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_P4_Bits.S143L */
#define IFX_DMU_HP_PROCON_P4_S143L_OFF (15u)

/** \brief  Length for Ifx_DMU_HP_PROCON_P4_Bits.S144L */
#define IFX_DMU_HP_PROCON_P4_S144L_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_P4_Bits.S144L */
#define IFX_DMU_HP_PROCON_P4_S144L_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_P4_Bits.S144L */
#define IFX_DMU_HP_PROCON_P4_S144L_OFF (16u)

/** \brief  Length for Ifx_DMU_HP_PROCON_P4_Bits.S145L */
#define IFX_DMU_HP_PROCON_P4_S145L_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_P4_Bits.S145L */
#define IFX_DMU_HP_PROCON_P4_S145L_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_P4_Bits.S145L */
#define IFX_DMU_HP_PROCON_P4_S145L_OFF (17u)

/** \brief  Length for Ifx_DMU_HP_PROCON_P4_Bits.S146L */
#define IFX_DMU_HP_PROCON_P4_S146L_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_P4_Bits.S146L */
#define IFX_DMU_HP_PROCON_P4_S146L_MSK (0x1u)

