Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxDmu_bf.h
/** \brief  Length for Ifx_DMU_HP_PROCON_P5_Bits.S188L */
#define IFX_DMU_HP_PROCON_P5_S188L_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_P5_Bits.S188L */
#define IFX_DMU_HP_PROCON_P5_S188L_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_P5_Bits.S188L */
#define IFX_DMU_HP_PROCON_P5_S188L_OFF (28u)

/** \brief  Length for Ifx_DMU_HP_PROCON_P5_Bits.S189L */
#define IFX_DMU_HP_PROCON_P5_S189L_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_P5_Bits.S189L */
#define IFX_DMU_HP_PROCON_P5_S189L_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_P5_Bits.S189L */
#define IFX_DMU_HP_PROCON_P5_S189L_OFF (29u)

/** \brief  Length for Ifx_DMU_HP_PROCON_P5_Bits.S190L */
#define IFX_DMU_HP_PROCON_P5_S190L_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_P5_Bits.S190L */
#define IFX_DMU_HP_PROCON_P5_S190L_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_P5_Bits.S190L */
#define IFX_DMU_HP_PROCON_P5_S190L_OFF (30u)

/** \brief  Length for Ifx_DMU_HP_PROCON_P5_Bits.S191L */
#define IFX_DMU_HP_PROCON_P5_S191L_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_P5_Bits.S191L */
#define IFX_DMU_HP_PROCON_P5_S191L_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_P5_Bits.S191L */
#define IFX_DMU_HP_PROCON_P5_S191L_OFF (31u)

/** \brief  Length for Ifx_DMU_HP_PROCON_WOP0_Bits.S0WOP */
#define IFX_DMU_HP_PROCON_WOP0_S0WOP_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_WOP0_Bits.S0WOP */
#define IFX_DMU_HP_PROCON_WOP0_S0WOP_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_WOP0_Bits.S0WOP */
#define IFX_DMU_HP_PROCON_WOP0_S0WOP_OFF (0u)

/** \brief  Length for Ifx_DMU_HP_PROCON_WOP0_Bits.S10WOP */
#define IFX_DMU_HP_PROCON_WOP0_S10WOP_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_WOP0_Bits.S10WOP */
#define IFX_DMU_HP_PROCON_WOP0_S10WOP_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_WOP0_Bits.S10WOP */
#define IFX_DMU_HP_PROCON_WOP0_S10WOP_OFF (10u)

/** \brief  Length for Ifx_DMU_HP_PROCON_WOP0_Bits.S11WOP */
#define IFX_DMU_HP_PROCON_WOP0_S11WOP_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_WOP0_Bits.S11WOP */
#define IFX_DMU_HP_PROCON_WOP0_S11WOP_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_WOP0_Bits.S11WOP */
#define IFX_DMU_HP_PROCON_WOP0_S11WOP_OFF (11u)

/** \brief  Length for Ifx_DMU_HP_PROCON_WOP0_Bits.S12WOP */
#define IFX_DMU_HP_PROCON_WOP0_S12WOP_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_WOP0_Bits.S12WOP */
#define IFX_DMU_HP_PROCON_WOP0_S12WOP_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_WOP0_Bits.S12WOP */
#define IFX_DMU_HP_PROCON_WOP0_S12WOP_OFF (12u)

/** \brief  Length for Ifx_DMU_HP_PROCON_WOP0_Bits.S13WOP */
#define IFX_DMU_HP_PROCON_WOP0_S13WOP_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_WOP0_Bits.S13WOP */
#define IFX_DMU_HP_PROCON_WOP0_S13WOP_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_WOP0_Bits.S13WOP */
#define IFX_DMU_HP_PROCON_WOP0_S13WOP_OFF (13u)

/** \brief  Length for Ifx_DMU_HP_PROCON_WOP0_Bits.S14WOP */
#define IFX_DMU_HP_PROCON_WOP0_S14WOP_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_WOP0_Bits.S14WOP */
#define IFX_DMU_HP_PROCON_WOP0_S14WOP_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_WOP0_Bits.S14WOP */
#define IFX_DMU_HP_PROCON_WOP0_S14WOP_OFF (14u)

/** \brief  Length for Ifx_DMU_HP_PROCON_WOP0_Bits.S15WOP */
#define IFX_DMU_HP_PROCON_WOP0_S15WOP_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_WOP0_Bits.S15WOP */
#define IFX_DMU_HP_PROCON_WOP0_S15WOP_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_WOP0_Bits.S15WOP */
#define IFX_DMU_HP_PROCON_WOP0_S15WOP_OFF (15u)

/** \brief  Length for Ifx_DMU_HP_PROCON_WOP0_Bits.S16WOP */
#define IFX_DMU_HP_PROCON_WOP0_S16WOP_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_WOP0_Bits.S16WOP */
#define IFX_DMU_HP_PROCON_WOP0_S16WOP_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_WOP0_Bits.S16WOP */
#define IFX_DMU_HP_PROCON_WOP0_S16WOP_OFF (16u)

/** \brief  Length for Ifx_DMU_HP_PROCON_WOP0_Bits.S17WOP */
#define IFX_DMU_HP_PROCON_WOP0_S17WOP_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_WOP0_Bits.S17WOP */
#define IFX_DMU_HP_PROCON_WOP0_S17WOP_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_WOP0_Bits.S17WOP */
#define IFX_DMU_HP_PROCON_WOP0_S17WOP_OFF (17u)

/** \brief  Length for Ifx_DMU_HP_PROCON_WOP0_Bits.S18WOP */
#define IFX_DMU_HP_PROCON_WOP0_S18WOP_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_WOP0_Bits.S18WOP */
#define IFX_DMU_HP_PROCON_WOP0_S18WOP_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_WOP0_Bits.S18WOP */
#define IFX_DMU_HP_PROCON_WOP0_S18WOP_OFF (18u)

/** \brief  Length for Ifx_DMU_HP_PROCON_WOP0_Bits.S19WOP */
#define IFX_DMU_HP_PROCON_WOP0_S19WOP_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_WOP0_Bits.S19WOP */
#define IFX_DMU_HP_PROCON_WOP0_S19WOP_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_WOP0_Bits.S19WOP */
#define IFX_DMU_HP_PROCON_WOP0_S19WOP_OFF (19u)

/** \brief  Length for Ifx_DMU_HP_PROCON_WOP0_Bits.S1WOP */
#define IFX_DMU_HP_PROCON_WOP0_S1WOP_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_WOP0_Bits.S1WOP */
#define IFX_DMU_HP_PROCON_WOP0_S1WOP_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_WOP0_Bits.S1WOP */
#define IFX_DMU_HP_PROCON_WOP0_S1WOP_OFF (1u)

/** \brief  Length for Ifx_DMU_HP_PROCON_WOP0_Bits.S20WOP */
#define IFX_DMU_HP_PROCON_WOP0_S20WOP_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_WOP0_Bits.S20WOP */
#define IFX_DMU_HP_PROCON_WOP0_S20WOP_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_WOP0_Bits.S20WOP */
#define IFX_DMU_HP_PROCON_WOP0_S20WOP_OFF (20u)

/** \brief  Length for Ifx_DMU_HP_PROCON_WOP0_Bits.S21WOP */
#define IFX_DMU_HP_PROCON_WOP0_S21WOP_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_WOP0_Bits.S21WOP */
#define IFX_DMU_HP_PROCON_WOP0_S21WOP_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_WOP0_Bits.S21WOP */
#define IFX_DMU_HP_PROCON_WOP0_S21WOP_OFF (21u)

/** \brief  Length for Ifx_DMU_HP_PROCON_WOP0_Bits.S22WOP */
#define IFX_DMU_HP_PROCON_WOP0_S22WOP_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_WOP0_Bits.S22WOP */
#define IFX_DMU_HP_PROCON_WOP0_S22WOP_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_WOP0_Bits.S22WOP */
#define IFX_DMU_HP_PROCON_WOP0_S22WOP_OFF (22u)

/** \brief  Length for Ifx_DMU_HP_PROCON_WOP0_Bits.S23WOP */
#define IFX_DMU_HP_PROCON_WOP0_S23WOP_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_WOP0_Bits.S23WOP */
#define IFX_DMU_HP_PROCON_WOP0_S23WOP_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_WOP0_Bits.S23WOP */
#define IFX_DMU_HP_PROCON_WOP0_S23WOP_OFF (23u)

/** \brief  Length for Ifx_DMU_HP_PROCON_WOP0_Bits.S24WOP */
#define IFX_DMU_HP_PROCON_WOP0_S24WOP_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_WOP0_Bits.S24WOP */
#define IFX_DMU_HP_PROCON_WOP0_S24WOP_MSK (0x1u)

