Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxDmu_bf.h
/** \brief  Offset for Ifx_DMU_HP_PROCON_WOP0_Bits.S24WOP */
#define IFX_DMU_HP_PROCON_WOP0_S24WOP_OFF (24u)

/** \brief  Length for Ifx_DMU_HP_PROCON_WOP0_Bits.S25WOP */
#define IFX_DMU_HP_PROCON_WOP0_S25WOP_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_WOP0_Bits.S25WOP */
#define IFX_DMU_HP_PROCON_WOP0_S25WOP_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_WOP0_Bits.S25WOP */
#define IFX_DMU_HP_PROCON_WOP0_S25WOP_OFF (25u)

/** \brief  Length for Ifx_DMU_HP_PROCON_WOP0_Bits.S26WOP */
#define IFX_DMU_HP_PROCON_WOP0_S26WOP_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_WOP0_Bits.S26WOP */
#define IFX_DMU_HP_PROCON_WOP0_S26WOP_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_WOP0_Bits.S26WOP */
#define IFX_DMU_HP_PROCON_WOP0_S26WOP_OFF (26u)

/** \brief  Length for Ifx_DMU_HP_PROCON_WOP0_Bits.S27WOP */
#define IFX_DMU_HP_PROCON_WOP0_S27WOP_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_WOP0_Bits.S27WOP */
#define IFX_DMU_HP_PROCON_WOP0_S27WOP_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_WOP0_Bits.S27WOP */
#define IFX_DMU_HP_PROCON_WOP0_S27WOP_OFF (27u)

/** \brief  Length for Ifx_DMU_HP_PROCON_WOP0_Bits.S28WOP */
#define IFX_DMU_HP_PROCON_WOP0_S28WOP_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_WOP0_Bits.S28WOP */
#define IFX_DMU_HP_PROCON_WOP0_S28WOP_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_WOP0_Bits.S28WOP */
#define IFX_DMU_HP_PROCON_WOP0_S28WOP_OFF (28u)

/** \brief  Length for Ifx_DMU_HP_PROCON_WOP0_Bits.S29WOP */
#define IFX_DMU_HP_PROCON_WOP0_S29WOP_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_WOP0_Bits.S29WOP */
#define IFX_DMU_HP_PROCON_WOP0_S29WOP_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_WOP0_Bits.S29WOP */
#define IFX_DMU_HP_PROCON_WOP0_S29WOP_OFF (29u)

/** \brief  Length for Ifx_DMU_HP_PROCON_WOP0_Bits.S2WOP */
#define IFX_DMU_HP_PROCON_WOP0_S2WOP_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_WOP0_Bits.S2WOP */
#define IFX_DMU_HP_PROCON_WOP0_S2WOP_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_WOP0_Bits.S2WOP */
#define IFX_DMU_HP_PROCON_WOP0_S2WOP_OFF (2u)

/** \brief  Length for Ifx_DMU_HP_PROCON_WOP0_Bits.S30WOP */
#define IFX_DMU_HP_PROCON_WOP0_S30WOP_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_WOP0_Bits.S30WOP */
#define IFX_DMU_HP_PROCON_WOP0_S30WOP_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_WOP0_Bits.S30WOP */
#define IFX_DMU_HP_PROCON_WOP0_S30WOP_OFF (30u)

/** \brief  Length for Ifx_DMU_HP_PROCON_WOP0_Bits.S31WOP */
#define IFX_DMU_HP_PROCON_WOP0_S31WOP_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_WOP0_Bits.S31WOP */
#define IFX_DMU_HP_PROCON_WOP0_S31WOP_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_WOP0_Bits.S31WOP */
#define IFX_DMU_HP_PROCON_WOP0_S31WOP_OFF (31u)

/** \brief  Length for Ifx_DMU_HP_PROCON_WOP0_Bits.S3WOP */
#define IFX_DMU_HP_PROCON_WOP0_S3WOP_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_WOP0_Bits.S3WOP */
#define IFX_DMU_HP_PROCON_WOP0_S3WOP_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_WOP0_Bits.S3WOP */
#define IFX_DMU_HP_PROCON_WOP0_S3WOP_OFF (3u)

/** \brief  Length for Ifx_DMU_HP_PROCON_WOP0_Bits.S4WOP */
#define IFX_DMU_HP_PROCON_WOP0_S4WOP_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_WOP0_Bits.S4WOP */
#define IFX_DMU_HP_PROCON_WOP0_S4WOP_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_WOP0_Bits.S4WOP */
#define IFX_DMU_HP_PROCON_WOP0_S4WOP_OFF (4u)

/** \brief  Length for Ifx_DMU_HP_PROCON_WOP0_Bits.S5WOP */
#define IFX_DMU_HP_PROCON_WOP0_S5WOP_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_WOP0_Bits.S5WOP */
#define IFX_DMU_HP_PROCON_WOP0_S5WOP_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_WOP0_Bits.S5WOP */
#define IFX_DMU_HP_PROCON_WOP0_S5WOP_OFF (5u)

/** \brief  Length for Ifx_DMU_HP_PROCON_WOP0_Bits.S6WOP */
#define IFX_DMU_HP_PROCON_WOP0_S6WOP_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_WOP0_Bits.S6WOP */
#define IFX_DMU_HP_PROCON_WOP0_S6WOP_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_WOP0_Bits.S6WOP */
#define IFX_DMU_HP_PROCON_WOP0_S6WOP_OFF (6u)

/** \brief  Length for Ifx_DMU_HP_PROCON_WOP0_Bits.S7WOP */
#define IFX_DMU_HP_PROCON_WOP0_S7WOP_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_WOP0_Bits.S7WOP */
#define IFX_DMU_HP_PROCON_WOP0_S7WOP_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_WOP0_Bits.S7WOP */
#define IFX_DMU_HP_PROCON_WOP0_S7WOP_OFF (7u)

/** \brief  Length for Ifx_DMU_HP_PROCON_WOP0_Bits.S8WOP */
#define IFX_DMU_HP_PROCON_WOP0_S8WOP_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_WOP0_Bits.S8WOP */
#define IFX_DMU_HP_PROCON_WOP0_S8WOP_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_WOP0_Bits.S8WOP */
#define IFX_DMU_HP_PROCON_WOP0_S8WOP_OFF (8u)

/** \brief  Length for Ifx_DMU_HP_PROCON_WOP0_Bits.S9WOP */
#define IFX_DMU_HP_PROCON_WOP0_S9WOP_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_WOP0_Bits.S9WOP */
#define IFX_DMU_HP_PROCON_WOP0_S9WOP_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_WOP0_Bits.S9WOP */
#define IFX_DMU_HP_PROCON_WOP0_S9WOP_OFF (9u)

/** \brief  Length for Ifx_DMU_HP_PROCON_WOP1_Bits.S32WOP */
#define IFX_DMU_HP_PROCON_WOP1_S32WOP_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_WOP1_Bits.S32WOP */
#define IFX_DMU_HP_PROCON_WOP1_S32WOP_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_WOP1_Bits.S32WOP */
#define IFX_DMU_HP_PROCON_WOP1_S32WOP_OFF (0u)

/** \brief  Length for Ifx_DMU_HP_PROCON_WOP1_Bits.S33WOP */
#define IFX_DMU_HP_PROCON_WOP1_S33WOP_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_WOP1_Bits.S33WOP */
#define IFX_DMU_HP_PROCON_WOP1_S33WOP_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_WOP1_Bits.S33WOP */
#define IFX_DMU_HP_PROCON_WOP1_S33WOP_OFF (1u)

/** \brief  Length for Ifx_DMU_HP_PROCON_WOP1_Bits.S34WOP */
#define IFX_DMU_HP_PROCON_WOP1_S34WOP_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_WOP1_Bits.S34WOP */
#define IFX_DMU_HP_PROCON_WOP1_S34WOP_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_WOP1_Bits.S34WOP */
#define IFX_DMU_HP_PROCON_WOP1_S34WOP_OFF (2u)

/** \brief  Length for Ifx_DMU_HP_PROCON_WOP1_Bits.S35WOP */
#define IFX_DMU_HP_PROCON_WOP1_S35WOP_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_WOP1_Bits.S35WOP */
#define IFX_DMU_HP_PROCON_WOP1_S35WOP_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_WOP1_Bits.S35WOP */
#define IFX_DMU_HP_PROCON_WOP1_S35WOP_OFF (3u)

/** \brief  Length for Ifx_DMU_HP_PROCON_WOP1_Bits.S36WOP */
#define IFX_DMU_HP_PROCON_WOP1_S36WOP_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_WOP1_Bits.S36WOP */
#define IFX_DMU_HP_PROCON_WOP1_S36WOP_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_WOP1_Bits.S36WOP */
#define IFX_DMU_HP_PROCON_WOP1_S36WOP_OFF (4u)

/** \brief  Length for Ifx_DMU_HP_PROCON_WOP1_Bits.S37WOP */
#define IFX_DMU_HP_PROCON_WOP1_S37WOP_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_WOP1_Bits.S37WOP */
#define IFX_DMU_HP_PROCON_WOP1_S37WOP_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_WOP1_Bits.S37WOP */
#define IFX_DMU_HP_PROCON_WOP1_S37WOP_OFF (5u)

/** \brief  Length for Ifx_DMU_HP_PROCON_WOP1_Bits.S38WOP */
#define IFX_DMU_HP_PROCON_WOP1_S38WOP_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_WOP1_Bits.S38WOP */
#define IFX_DMU_HP_PROCON_WOP1_S38WOP_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_WOP1_Bits.S38WOP */
#define IFX_DMU_HP_PROCON_WOP1_S38WOP_OFF (6u)

/** \brief  Length for Ifx_DMU_HP_PROCON_WOP1_Bits.S39WOP */
#define IFX_DMU_HP_PROCON_WOP1_S39WOP_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_WOP1_Bits.S39WOP */
#define IFX_DMU_HP_PROCON_WOP1_S39WOP_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_WOP1_Bits.S39WOP */
#define IFX_DMU_HP_PROCON_WOP1_S39WOP_OFF (7u)

