Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxDmu_bf.h
/** \brief  Length for Ifx_DMU_HP_PROCON_WOP1_Bits.S40WOP */
#define IFX_DMU_HP_PROCON_WOP1_S40WOP_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_WOP1_Bits.S40WOP */
#define IFX_DMU_HP_PROCON_WOP1_S40WOP_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_WOP1_Bits.S40WOP */
#define IFX_DMU_HP_PROCON_WOP1_S40WOP_OFF (8u)

/** \brief  Length for Ifx_DMU_HP_PROCON_WOP1_Bits.S41WOP */
#define IFX_DMU_HP_PROCON_WOP1_S41WOP_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_WOP1_Bits.S41WOP */
#define IFX_DMU_HP_PROCON_WOP1_S41WOP_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_WOP1_Bits.S41WOP */
#define IFX_DMU_HP_PROCON_WOP1_S41WOP_OFF (9u)

/** \brief  Length for Ifx_DMU_HP_PROCON_WOP1_Bits.S42WOP */
#define IFX_DMU_HP_PROCON_WOP1_S42WOP_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_WOP1_Bits.S42WOP */
#define IFX_DMU_HP_PROCON_WOP1_S42WOP_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_WOP1_Bits.S42WOP */
#define IFX_DMU_HP_PROCON_WOP1_S42WOP_OFF (10u)

/** \brief  Length for Ifx_DMU_HP_PROCON_WOP1_Bits.S43WOP */
#define IFX_DMU_HP_PROCON_WOP1_S43WOP_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_WOP1_Bits.S43WOP */
#define IFX_DMU_HP_PROCON_WOP1_S43WOP_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_WOP1_Bits.S43WOP */
#define IFX_DMU_HP_PROCON_WOP1_S43WOP_OFF (11u)

/** \brief  Length for Ifx_DMU_HP_PROCON_WOP1_Bits.S44WOP */
#define IFX_DMU_HP_PROCON_WOP1_S44WOP_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_WOP1_Bits.S44WOP */
#define IFX_DMU_HP_PROCON_WOP1_S44WOP_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_WOP1_Bits.S44WOP */
#define IFX_DMU_HP_PROCON_WOP1_S44WOP_OFF (12u)

/** \brief  Length for Ifx_DMU_HP_PROCON_WOP1_Bits.S45WOP */
#define IFX_DMU_HP_PROCON_WOP1_S45WOP_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_WOP1_Bits.S45WOP */
#define IFX_DMU_HP_PROCON_WOP1_S45WOP_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_WOP1_Bits.S45WOP */
#define IFX_DMU_HP_PROCON_WOP1_S45WOP_OFF (13u)

/** \brief  Length for Ifx_DMU_HP_PROCON_WOP1_Bits.S46WOP */
#define IFX_DMU_HP_PROCON_WOP1_S46WOP_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_WOP1_Bits.S46WOP */
#define IFX_DMU_HP_PROCON_WOP1_S46WOP_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_WOP1_Bits.S46WOP */
#define IFX_DMU_HP_PROCON_WOP1_S46WOP_OFF (14u)

/** \brief  Length for Ifx_DMU_HP_PROCON_WOP1_Bits.S47WOP */
#define IFX_DMU_HP_PROCON_WOP1_S47WOP_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_WOP1_Bits.S47WOP */
#define IFX_DMU_HP_PROCON_WOP1_S47WOP_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_WOP1_Bits.S47WOP */
#define IFX_DMU_HP_PROCON_WOP1_S47WOP_OFF (15u)

/** \brief  Length for Ifx_DMU_HP_PROCON_WOP1_Bits.S48WOP */
#define IFX_DMU_HP_PROCON_WOP1_S48WOP_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_WOP1_Bits.S48WOP */
#define IFX_DMU_HP_PROCON_WOP1_S48WOP_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_WOP1_Bits.S48WOP */
#define IFX_DMU_HP_PROCON_WOP1_S48WOP_OFF (16u)

/** \brief  Length for Ifx_DMU_HP_PROCON_WOP1_Bits.S49WOP */
#define IFX_DMU_HP_PROCON_WOP1_S49WOP_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_WOP1_Bits.S49WOP */
#define IFX_DMU_HP_PROCON_WOP1_S49WOP_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_WOP1_Bits.S49WOP */
#define IFX_DMU_HP_PROCON_WOP1_S49WOP_OFF (17u)

/** \brief  Length for Ifx_DMU_HP_PROCON_WOP1_Bits.S50WOP */
#define IFX_DMU_HP_PROCON_WOP1_S50WOP_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_WOP1_Bits.S50WOP */
#define IFX_DMU_HP_PROCON_WOP1_S50WOP_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_WOP1_Bits.S50WOP */
#define IFX_DMU_HP_PROCON_WOP1_S50WOP_OFF (18u)

/** \brief  Length for Ifx_DMU_HP_PROCON_WOP1_Bits.S51WOP */
#define IFX_DMU_HP_PROCON_WOP1_S51WOP_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_WOP1_Bits.S51WOP */
#define IFX_DMU_HP_PROCON_WOP1_S51WOP_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_WOP1_Bits.S51WOP */
#define IFX_DMU_HP_PROCON_WOP1_S51WOP_OFF (19u)

/** \brief  Length for Ifx_DMU_HP_PROCON_WOP1_Bits.S52WOP */
#define IFX_DMU_HP_PROCON_WOP1_S52WOP_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_WOP1_Bits.S52WOP */
#define IFX_DMU_HP_PROCON_WOP1_S52WOP_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_WOP1_Bits.S52WOP */
#define IFX_DMU_HP_PROCON_WOP1_S52WOP_OFF (20u)

/** \brief  Length for Ifx_DMU_HP_PROCON_WOP1_Bits.S53WOP */
#define IFX_DMU_HP_PROCON_WOP1_S53WOP_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_WOP1_Bits.S53WOP */
#define IFX_DMU_HP_PROCON_WOP1_S53WOP_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_WOP1_Bits.S53WOP */
#define IFX_DMU_HP_PROCON_WOP1_S53WOP_OFF (21u)

/** \brief  Length for Ifx_DMU_HP_PROCON_WOP1_Bits.S54WOP */
#define IFX_DMU_HP_PROCON_WOP1_S54WOP_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_WOP1_Bits.S54WOP */
#define IFX_DMU_HP_PROCON_WOP1_S54WOP_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_WOP1_Bits.S54WOP */
#define IFX_DMU_HP_PROCON_WOP1_S54WOP_OFF (22u)

/** \brief  Length for Ifx_DMU_HP_PROCON_WOP1_Bits.S55WOP */
#define IFX_DMU_HP_PROCON_WOP1_S55WOP_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_WOP1_Bits.S55WOP */
#define IFX_DMU_HP_PROCON_WOP1_S55WOP_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_WOP1_Bits.S55WOP */
#define IFX_DMU_HP_PROCON_WOP1_S55WOP_OFF (23u)

/** \brief  Length for Ifx_DMU_HP_PROCON_WOP1_Bits.S56WOP */
#define IFX_DMU_HP_PROCON_WOP1_S56WOP_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_WOP1_Bits.S56WOP */
#define IFX_DMU_HP_PROCON_WOP1_S56WOP_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_WOP1_Bits.S56WOP */
#define IFX_DMU_HP_PROCON_WOP1_S56WOP_OFF (24u)

/** \brief  Length for Ifx_DMU_HP_PROCON_WOP1_Bits.S57WOP */
#define IFX_DMU_HP_PROCON_WOP1_S57WOP_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_WOP1_Bits.S57WOP */
#define IFX_DMU_HP_PROCON_WOP1_S57WOP_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_WOP1_Bits.S57WOP */
#define IFX_DMU_HP_PROCON_WOP1_S57WOP_OFF (25u)

/** \brief  Length for Ifx_DMU_HP_PROCON_WOP1_Bits.S58WOP */
#define IFX_DMU_HP_PROCON_WOP1_S58WOP_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_WOP1_Bits.S58WOP */
#define IFX_DMU_HP_PROCON_WOP1_S58WOP_MSK (0x1u)

