Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxDmu_bf.h
/** \brief  Offset for Ifx_DMU_HP_PROCON_WOP1_Bits.S58WOP */
#define IFX_DMU_HP_PROCON_WOP1_S58WOP_OFF (26u)

/** \brief  Length for Ifx_DMU_HP_PROCON_WOP1_Bits.S59WOP */
#define IFX_DMU_HP_PROCON_WOP1_S59WOP_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_WOP1_Bits.S59WOP */
#define IFX_DMU_HP_PROCON_WOP1_S59WOP_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_WOP1_Bits.S59WOP */
#define IFX_DMU_HP_PROCON_WOP1_S59WOP_OFF (27u)

/** \brief  Length for Ifx_DMU_HP_PROCON_WOP1_Bits.S60WOP */
#define IFX_DMU_HP_PROCON_WOP1_S60WOP_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_WOP1_Bits.S60WOP */
#define IFX_DMU_HP_PROCON_WOP1_S60WOP_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_WOP1_Bits.S60WOP */
#define IFX_DMU_HP_PROCON_WOP1_S60WOP_OFF (28u)

/** \brief  Length for Ifx_DMU_HP_PROCON_WOP1_Bits.S61WOP */
#define IFX_DMU_HP_PROCON_WOP1_S61WOP_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_WOP1_Bits.S61WOP */
#define IFX_DMU_HP_PROCON_WOP1_S61WOP_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_WOP1_Bits.S61WOP */
#define IFX_DMU_HP_PROCON_WOP1_S61WOP_OFF (29u)

/** \brief  Length for Ifx_DMU_HP_PROCON_WOP1_Bits.S62WOP */
#define IFX_DMU_HP_PROCON_WOP1_S62WOP_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_WOP1_Bits.S62WOP */
#define IFX_DMU_HP_PROCON_WOP1_S62WOP_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_WOP1_Bits.S62WOP */
#define IFX_DMU_HP_PROCON_WOP1_S62WOP_OFF (30u)

/** \brief  Length for Ifx_DMU_HP_PROCON_WOP1_Bits.S63WOP */
#define IFX_DMU_HP_PROCON_WOP1_S63WOP_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_WOP1_Bits.S63WOP */
#define IFX_DMU_HP_PROCON_WOP1_S63WOP_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_WOP1_Bits.S63WOP */
#define IFX_DMU_HP_PROCON_WOP1_S63WOP_OFF (31u)

/** \brief  Length for Ifx_DMU_HP_PROCON_WOP2_Bits.S64WOP */
#define IFX_DMU_HP_PROCON_WOP2_S64WOP_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_WOP2_Bits.S64WOP */
#define IFX_DMU_HP_PROCON_WOP2_S64WOP_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_WOP2_Bits.S64WOP */
#define IFX_DMU_HP_PROCON_WOP2_S64WOP_OFF (0u)

/** \brief  Length for Ifx_DMU_HP_PROCON_WOP2_Bits.S65WOP */
#define IFX_DMU_HP_PROCON_WOP2_S65WOP_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_WOP2_Bits.S65WOP */
#define IFX_DMU_HP_PROCON_WOP2_S65WOP_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_WOP2_Bits.S65WOP */
#define IFX_DMU_HP_PROCON_WOP2_S65WOP_OFF (1u)

/** \brief  Length for Ifx_DMU_HP_PROCON_WOP2_Bits.S66WOP */
#define IFX_DMU_HP_PROCON_WOP2_S66WOP_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_WOP2_Bits.S66WOP */
#define IFX_DMU_HP_PROCON_WOP2_S66WOP_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_WOP2_Bits.S66WOP */
#define IFX_DMU_HP_PROCON_WOP2_S66WOP_OFF (2u)

/** \brief  Length for Ifx_DMU_HP_PROCON_WOP2_Bits.S67WOP */
#define IFX_DMU_HP_PROCON_WOP2_S67WOP_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_WOP2_Bits.S67WOP */
#define IFX_DMU_HP_PROCON_WOP2_S67WOP_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_WOP2_Bits.S67WOP */
#define IFX_DMU_HP_PROCON_WOP2_S67WOP_OFF (3u)

/** \brief  Length for Ifx_DMU_HP_PROCON_WOP2_Bits.S68WOP */
#define IFX_DMU_HP_PROCON_WOP2_S68WOP_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_WOP2_Bits.S68WOP */
#define IFX_DMU_HP_PROCON_WOP2_S68WOP_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_WOP2_Bits.S68WOP */
#define IFX_DMU_HP_PROCON_WOP2_S68WOP_OFF (4u)

/** \brief  Length for Ifx_DMU_HP_PROCON_WOP2_Bits.S69WOP */
#define IFX_DMU_HP_PROCON_WOP2_S69WOP_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_WOP2_Bits.S69WOP */
#define IFX_DMU_HP_PROCON_WOP2_S69WOP_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_WOP2_Bits.S69WOP */
#define IFX_DMU_HP_PROCON_WOP2_S69WOP_OFF (5u)

/** \brief  Length for Ifx_DMU_HP_PROCON_WOP2_Bits.S70WOP */
#define IFX_DMU_HP_PROCON_WOP2_S70WOP_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_WOP2_Bits.S70WOP */
#define IFX_DMU_HP_PROCON_WOP2_S70WOP_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_WOP2_Bits.S70WOP */
#define IFX_DMU_HP_PROCON_WOP2_S70WOP_OFF (6u)

/** \brief  Length for Ifx_DMU_HP_PROCON_WOP2_Bits.S71WOP */
#define IFX_DMU_HP_PROCON_WOP2_S71WOP_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_WOP2_Bits.S71WOP */
#define IFX_DMU_HP_PROCON_WOP2_S71WOP_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_WOP2_Bits.S71WOP */
#define IFX_DMU_HP_PROCON_WOP2_S71WOP_OFF (7u)

/** \brief  Length for Ifx_DMU_HP_PROCON_WOP2_Bits.S72WOP */
#define IFX_DMU_HP_PROCON_WOP2_S72WOP_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_WOP2_Bits.S72WOP */
#define IFX_DMU_HP_PROCON_WOP2_S72WOP_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_WOP2_Bits.S72WOP */
#define IFX_DMU_HP_PROCON_WOP2_S72WOP_OFF (8u)

/** \brief  Length for Ifx_DMU_HP_PROCON_WOP2_Bits.S73WOP */
#define IFX_DMU_HP_PROCON_WOP2_S73WOP_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_WOP2_Bits.S73WOP */
#define IFX_DMU_HP_PROCON_WOP2_S73WOP_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_WOP2_Bits.S73WOP */
#define IFX_DMU_HP_PROCON_WOP2_S73WOP_OFF (9u)

/** \brief  Length for Ifx_DMU_HP_PROCON_WOP2_Bits.S74WOP */
#define IFX_DMU_HP_PROCON_WOP2_S74WOP_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_WOP2_Bits.S74WOP */
#define IFX_DMU_HP_PROCON_WOP2_S74WOP_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_WOP2_Bits.S74WOP */
#define IFX_DMU_HP_PROCON_WOP2_S74WOP_OFF (10u)

/** \brief  Length for Ifx_DMU_HP_PROCON_WOP2_Bits.S75WOP */
#define IFX_DMU_HP_PROCON_WOP2_S75WOP_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_WOP2_Bits.S75WOP */
#define IFX_DMU_HP_PROCON_WOP2_S75WOP_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_WOP2_Bits.S75WOP */
#define IFX_DMU_HP_PROCON_WOP2_S75WOP_OFF (11u)

/** \brief  Length for Ifx_DMU_HP_PROCON_WOP2_Bits.S76WOP */
#define IFX_DMU_HP_PROCON_WOP2_S76WOP_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_WOP2_Bits.S76WOP */
#define IFX_DMU_HP_PROCON_WOP2_S76WOP_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_WOP2_Bits.S76WOP */
#define IFX_DMU_HP_PROCON_WOP2_S76WOP_OFF (12u)

/** \brief  Length for Ifx_DMU_HP_PROCON_WOP2_Bits.S77WOP */
#define IFX_DMU_HP_PROCON_WOP2_S77WOP_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_WOP2_Bits.S77WOP */
#define IFX_DMU_HP_PROCON_WOP2_S77WOP_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_WOP2_Bits.S77WOP */
#define IFX_DMU_HP_PROCON_WOP2_S77WOP_OFF (13u)

/** \brief  Length for Ifx_DMU_HP_PROCON_WOP2_Bits.S78WOP */
#define IFX_DMU_HP_PROCON_WOP2_S78WOP_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_WOP2_Bits.S78WOP */
#define IFX_DMU_HP_PROCON_WOP2_S78WOP_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_WOP2_Bits.S78WOP */
#define IFX_DMU_HP_PROCON_WOP2_S78WOP_OFF (14u)

/** \brief  Length for Ifx_DMU_HP_PROCON_WOP2_Bits.S79WOP */
#define IFX_DMU_HP_PROCON_WOP2_S79WOP_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_WOP2_Bits.S79WOP */
#define IFX_DMU_HP_PROCON_WOP2_S79WOP_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_WOP2_Bits.S79WOP */
#define IFX_DMU_HP_PROCON_WOP2_S79WOP_OFF (15u)

/** \brief  Length for Ifx_DMU_HP_PROCON_WOP2_Bits.S80WOP */
#define IFX_DMU_HP_PROCON_WOP2_S80WOP_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_WOP2_Bits.S80WOP */
#define IFX_DMU_HP_PROCON_WOP2_S80WOP_MSK (0x1u)

