Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxDmu_bf.h
/** \brief  Offset for Ifx_DMU_HP_PROCON_WOP2_Bits.S80WOP */
#define IFX_DMU_HP_PROCON_WOP2_S80WOP_OFF (16u)

/** \brief  Length for Ifx_DMU_HP_PROCON_WOP2_Bits.S81WOP */
#define IFX_DMU_HP_PROCON_WOP2_S81WOP_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_WOP2_Bits.S81WOP */
#define IFX_DMU_HP_PROCON_WOP2_S81WOP_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_WOP2_Bits.S81WOP */
#define IFX_DMU_HP_PROCON_WOP2_S81WOP_OFF (17u)

/** \brief  Length for Ifx_DMU_HP_PROCON_WOP2_Bits.S82WOP */
#define IFX_DMU_HP_PROCON_WOP2_S82WOP_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_WOP2_Bits.S82WOP */
#define IFX_DMU_HP_PROCON_WOP2_S82WOP_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_WOP2_Bits.S82WOP */
#define IFX_DMU_HP_PROCON_WOP2_S82WOP_OFF (18u)

/** \brief  Length for Ifx_DMU_HP_PROCON_WOP2_Bits.S83WOP */
#define IFX_DMU_HP_PROCON_WOP2_S83WOP_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_WOP2_Bits.S83WOP */
#define IFX_DMU_HP_PROCON_WOP2_S83WOP_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_WOP2_Bits.S83WOP */
#define IFX_DMU_HP_PROCON_WOP2_S83WOP_OFF (19u)

/** \brief  Length for Ifx_DMU_HP_PROCON_WOP2_Bits.S84WOP */
#define IFX_DMU_HP_PROCON_WOP2_S84WOP_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_WOP2_Bits.S84WOP */
#define IFX_DMU_HP_PROCON_WOP2_S84WOP_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_WOP2_Bits.S84WOP */
#define IFX_DMU_HP_PROCON_WOP2_S84WOP_OFF (20u)

/** \brief  Length for Ifx_DMU_HP_PROCON_WOP2_Bits.S85WOP */
#define IFX_DMU_HP_PROCON_WOP2_S85WOP_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_WOP2_Bits.S85WOP */
#define IFX_DMU_HP_PROCON_WOP2_S85WOP_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_WOP2_Bits.S85WOP */
#define IFX_DMU_HP_PROCON_WOP2_S85WOP_OFF (21u)

/** \brief  Length for Ifx_DMU_HP_PROCON_WOP2_Bits.S86WOP */
#define IFX_DMU_HP_PROCON_WOP2_S86WOP_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_WOP2_Bits.S86WOP */
#define IFX_DMU_HP_PROCON_WOP2_S86WOP_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_WOP2_Bits.S86WOP */
#define IFX_DMU_HP_PROCON_WOP2_S86WOP_OFF (22u)

/** \brief  Length for Ifx_DMU_HP_PROCON_WOP2_Bits.S87WOP */
#define IFX_DMU_HP_PROCON_WOP2_S87WOP_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_WOP2_Bits.S87WOP */
#define IFX_DMU_HP_PROCON_WOP2_S87WOP_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_WOP2_Bits.S87WOP */
#define IFX_DMU_HP_PROCON_WOP2_S87WOP_OFF (23u)

/** \brief  Length for Ifx_DMU_HP_PROCON_WOP2_Bits.S88WOP */
#define IFX_DMU_HP_PROCON_WOP2_S88WOP_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_WOP2_Bits.S88WOP */
#define IFX_DMU_HP_PROCON_WOP2_S88WOP_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_WOP2_Bits.S88WOP */
#define IFX_DMU_HP_PROCON_WOP2_S88WOP_OFF (24u)

/** \brief  Length for Ifx_DMU_HP_PROCON_WOP2_Bits.S89WOP */
#define IFX_DMU_HP_PROCON_WOP2_S89WOP_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_WOP2_Bits.S89WOP */
#define IFX_DMU_HP_PROCON_WOP2_S89WOP_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_WOP2_Bits.S89WOP */
#define IFX_DMU_HP_PROCON_WOP2_S89WOP_OFF (25u)

/** \brief  Length for Ifx_DMU_HP_PROCON_WOP2_Bits.S90WOP */
#define IFX_DMU_HP_PROCON_WOP2_S90WOP_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_WOP2_Bits.S90WOP */
#define IFX_DMU_HP_PROCON_WOP2_S90WOP_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_WOP2_Bits.S90WOP */
#define IFX_DMU_HP_PROCON_WOP2_S90WOP_OFF (26u)

/** \brief  Length for Ifx_DMU_HP_PROCON_WOP2_Bits.S91WOP */
#define IFX_DMU_HP_PROCON_WOP2_S91WOP_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_WOP2_Bits.S91WOP */
#define IFX_DMU_HP_PROCON_WOP2_S91WOP_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_WOP2_Bits.S91WOP */
#define IFX_DMU_HP_PROCON_WOP2_S91WOP_OFF (27u)

/** \brief  Length for Ifx_DMU_HP_PROCON_WOP2_Bits.S92WOP */
#define IFX_DMU_HP_PROCON_WOP2_S92WOP_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_WOP2_Bits.S92WOP */
#define IFX_DMU_HP_PROCON_WOP2_S92WOP_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_WOP2_Bits.S92WOP */
#define IFX_DMU_HP_PROCON_WOP2_S92WOP_OFF (28u)

/** \brief  Length for Ifx_DMU_HP_PROCON_WOP2_Bits.S93WOP */
#define IFX_DMU_HP_PROCON_WOP2_S93WOP_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_WOP2_Bits.S93WOP */
#define IFX_DMU_HP_PROCON_WOP2_S93WOP_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_WOP2_Bits.S93WOP */
#define IFX_DMU_HP_PROCON_WOP2_S93WOP_OFF (29u)

/** \brief  Length for Ifx_DMU_HP_PROCON_WOP2_Bits.S94WOP */
#define IFX_DMU_HP_PROCON_WOP2_S94WOP_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_WOP2_Bits.S94WOP */
#define IFX_DMU_HP_PROCON_WOP2_S94WOP_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_WOP2_Bits.S94WOP */
#define IFX_DMU_HP_PROCON_WOP2_S94WOP_OFF (30u)

/** \brief  Length for Ifx_DMU_HP_PROCON_WOP2_Bits.S95WOP */
#define IFX_DMU_HP_PROCON_WOP2_S95WOP_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_WOP2_Bits.S95WOP */
#define IFX_DMU_HP_PROCON_WOP2_S95WOP_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_WOP2_Bits.S95WOP */
#define IFX_DMU_HP_PROCON_WOP2_S95WOP_OFF (31u)

/** \brief  Length for Ifx_DMU_HP_PROCON_WOP3_Bits.S100WOP */
#define IFX_DMU_HP_PROCON_WOP3_S100WOP_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_WOP3_Bits.S100WOP */
#define IFX_DMU_HP_PROCON_WOP3_S100WOP_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_WOP3_Bits.S100WOP */
#define IFX_DMU_HP_PROCON_WOP3_S100WOP_OFF (4u)

/** \brief  Length for Ifx_DMU_HP_PROCON_WOP3_Bits.S101WOP */
#define IFX_DMU_HP_PROCON_WOP3_S101WOP_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_WOP3_Bits.S101WOP */
#define IFX_DMU_HP_PROCON_WOP3_S101WOP_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_WOP3_Bits.S101WOP */
#define IFX_DMU_HP_PROCON_WOP3_S101WOP_OFF (5u)

/** \brief  Length for Ifx_DMU_HP_PROCON_WOP3_Bits.S102WOP */
#define IFX_DMU_HP_PROCON_WOP3_S102WOP_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_WOP3_Bits.S102WOP */
#define IFX_DMU_HP_PROCON_WOP3_S102WOP_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_WOP3_Bits.S102WOP */
#define IFX_DMU_HP_PROCON_WOP3_S102WOP_OFF (6u)

/** \brief  Length for Ifx_DMU_HP_PROCON_WOP3_Bits.S103WOP */
#define IFX_DMU_HP_PROCON_WOP3_S103WOP_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_WOP3_Bits.S103WOP */
#define IFX_DMU_HP_PROCON_WOP3_S103WOP_MSK (0x1u)

