Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxDmu_bf.h
/** \brief  Offset for Ifx_DMU_HP_PROCON_WOP3_Bits.S103WOP */
#define IFX_DMU_HP_PROCON_WOP3_S103WOP_OFF (7u)

/** \brief  Length for Ifx_DMU_HP_PROCON_WOP3_Bits.S104WOP */
#define IFX_DMU_HP_PROCON_WOP3_S104WOP_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_WOP3_Bits.S104WOP */
#define IFX_DMU_HP_PROCON_WOP3_S104WOP_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_WOP3_Bits.S104WOP */
#define IFX_DMU_HP_PROCON_WOP3_S104WOP_OFF (8u)

/** \brief  Length for Ifx_DMU_HP_PROCON_WOP3_Bits.S105WOP */
#define IFX_DMU_HP_PROCON_WOP3_S105WOP_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_WOP3_Bits.S105WOP */
#define IFX_DMU_HP_PROCON_WOP3_S105WOP_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_WOP3_Bits.S105WOP */
#define IFX_DMU_HP_PROCON_WOP3_S105WOP_OFF (9u)

/** \brief  Length for Ifx_DMU_HP_PROCON_WOP3_Bits.S106WOP */
#define IFX_DMU_HP_PROCON_WOP3_S106WOP_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_WOP3_Bits.S106WOP */
#define IFX_DMU_HP_PROCON_WOP3_S106WOP_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_WOP3_Bits.S106WOP */
#define IFX_DMU_HP_PROCON_WOP3_S106WOP_OFF (10u)

/** \brief  Length for Ifx_DMU_HP_PROCON_WOP3_Bits.S107WOP */
#define IFX_DMU_HP_PROCON_WOP3_S107WOP_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_WOP3_Bits.S107WOP */
#define IFX_DMU_HP_PROCON_WOP3_S107WOP_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_WOP3_Bits.S107WOP */
#define IFX_DMU_HP_PROCON_WOP3_S107WOP_OFF (11u)

/** \brief  Length for Ifx_DMU_HP_PROCON_WOP3_Bits.S108WOP */
#define IFX_DMU_HP_PROCON_WOP3_S108WOP_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_WOP3_Bits.S108WOP */
#define IFX_DMU_HP_PROCON_WOP3_S108WOP_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_WOP3_Bits.S108WOP */
#define IFX_DMU_HP_PROCON_WOP3_S108WOP_OFF (12u)

/** \brief  Length for Ifx_DMU_HP_PROCON_WOP3_Bits.S109WOP */
#define IFX_DMU_HP_PROCON_WOP3_S109WOP_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_WOP3_Bits.S109WOP */
#define IFX_DMU_HP_PROCON_WOP3_S109WOP_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_WOP3_Bits.S109WOP */
#define IFX_DMU_HP_PROCON_WOP3_S109WOP_OFF (13u)

/** \brief  Length for Ifx_DMU_HP_PROCON_WOP3_Bits.S110WOP */
#define IFX_DMU_HP_PROCON_WOP3_S110WOP_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_WOP3_Bits.S110WOP */
#define IFX_DMU_HP_PROCON_WOP3_S110WOP_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_WOP3_Bits.S110WOP */
#define IFX_DMU_HP_PROCON_WOP3_S110WOP_OFF (14u)

/** \brief  Length for Ifx_DMU_HP_PROCON_WOP3_Bits.S111WOP */
#define IFX_DMU_HP_PROCON_WOP3_S111WOP_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_WOP3_Bits.S111WOP */
#define IFX_DMU_HP_PROCON_WOP3_S111WOP_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_WOP3_Bits.S111WOP */
#define IFX_DMU_HP_PROCON_WOP3_S111WOP_OFF (15u)

/** \brief  Length for Ifx_DMU_HP_PROCON_WOP3_Bits.S112WOP */
#define IFX_DMU_HP_PROCON_WOP3_S112WOP_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_WOP3_Bits.S112WOP */
#define IFX_DMU_HP_PROCON_WOP3_S112WOP_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_WOP3_Bits.S112WOP */
#define IFX_DMU_HP_PROCON_WOP3_S112WOP_OFF (16u)

/** \brief  Length for Ifx_DMU_HP_PROCON_WOP3_Bits.S113WOP */
#define IFX_DMU_HP_PROCON_WOP3_S113WOP_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_WOP3_Bits.S113WOP */
#define IFX_DMU_HP_PROCON_WOP3_S113WOP_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_WOP3_Bits.S113WOP */
#define IFX_DMU_HP_PROCON_WOP3_S113WOP_OFF (17u)

/** \brief  Length for Ifx_DMU_HP_PROCON_WOP3_Bits.S114WOP */
#define IFX_DMU_HP_PROCON_WOP3_S114WOP_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_WOP3_Bits.S114WOP */
#define IFX_DMU_HP_PROCON_WOP3_S114WOP_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_WOP3_Bits.S114WOP */
#define IFX_DMU_HP_PROCON_WOP3_S114WOP_OFF (18u)

/** \brief  Length for Ifx_DMU_HP_PROCON_WOP3_Bits.S115WOP */
#define IFX_DMU_HP_PROCON_WOP3_S115WOP_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_WOP3_Bits.S115WOP */
#define IFX_DMU_HP_PROCON_WOP3_S115WOP_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_WOP3_Bits.S115WOP */
#define IFX_DMU_HP_PROCON_WOP3_S115WOP_OFF (19u)

/** \brief  Length for Ifx_DMU_HP_PROCON_WOP3_Bits.S116WOP */
#define IFX_DMU_HP_PROCON_WOP3_S116WOP_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_WOP3_Bits.S116WOP */
#define IFX_DMU_HP_PROCON_WOP3_S116WOP_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_WOP3_Bits.S116WOP */
#define IFX_DMU_HP_PROCON_WOP3_S116WOP_OFF (20u)

/** \brief  Length for Ifx_DMU_HP_PROCON_WOP3_Bits.S117WOP */
#define IFX_DMU_HP_PROCON_WOP3_S117WOP_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_WOP3_Bits.S117WOP */
#define IFX_DMU_HP_PROCON_WOP3_S117WOP_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_WOP3_Bits.S117WOP */
#define IFX_DMU_HP_PROCON_WOP3_S117WOP_OFF (21u)

/** \brief  Length for Ifx_DMU_HP_PROCON_WOP3_Bits.S118WOP */
#define IFX_DMU_HP_PROCON_WOP3_S118WOP_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_WOP3_Bits.S118WOP */
#define IFX_DMU_HP_PROCON_WOP3_S118WOP_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_WOP3_Bits.S118WOP */
#define IFX_DMU_HP_PROCON_WOP3_S118WOP_OFF (22u)

/** \brief  Length for Ifx_DMU_HP_PROCON_WOP3_Bits.S119WOP */
#define IFX_DMU_HP_PROCON_WOP3_S119WOP_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_WOP3_Bits.S119WOP */
#define IFX_DMU_HP_PROCON_WOP3_S119WOP_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_WOP3_Bits.S119WOP */
#define IFX_DMU_HP_PROCON_WOP3_S119WOP_OFF (23u)

/** \brief  Length for Ifx_DMU_HP_PROCON_WOP3_Bits.S120WOP */
#define IFX_DMU_HP_PROCON_WOP3_S120WOP_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_WOP3_Bits.S120WOP */
#define IFX_DMU_HP_PROCON_WOP3_S120WOP_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_WOP3_Bits.S120WOP */
#define IFX_DMU_HP_PROCON_WOP3_S120WOP_OFF (24u)

/** \brief  Length for Ifx_DMU_HP_PROCON_WOP3_Bits.S121WOP */
#define IFX_DMU_HP_PROCON_WOP3_S121WOP_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_WOP3_Bits.S121WOP */
#define IFX_DMU_HP_PROCON_WOP3_S121WOP_MSK (0x1u)

