Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxDmu_bf.h
/** \brief  Offset for Ifx_DMU_HP_PROCON_WOP3_Bits.S121WOP */
#define IFX_DMU_HP_PROCON_WOP3_S121WOP_OFF (25u)

/** \brief  Length for Ifx_DMU_HP_PROCON_WOP3_Bits.S122WOP */
#define IFX_DMU_HP_PROCON_WOP3_S122WOP_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_WOP3_Bits.S122WOP */
#define IFX_DMU_HP_PROCON_WOP3_S122WOP_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_WOP3_Bits.S122WOP */
#define IFX_DMU_HP_PROCON_WOP3_S122WOP_OFF (26u)

/** \brief  Length for Ifx_DMU_HP_PROCON_WOP3_Bits.S123WOP */
#define IFX_DMU_HP_PROCON_WOP3_S123WOP_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_WOP3_Bits.S123WOP */
#define IFX_DMU_HP_PROCON_WOP3_S123WOP_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_WOP3_Bits.S123WOP */
#define IFX_DMU_HP_PROCON_WOP3_S123WOP_OFF (27u)

/** \brief  Length for Ifx_DMU_HP_PROCON_WOP3_Bits.S124WOP */
#define IFX_DMU_HP_PROCON_WOP3_S124WOP_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_WOP3_Bits.S124WOP */
#define IFX_DMU_HP_PROCON_WOP3_S124WOP_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_WOP3_Bits.S124WOP */
#define IFX_DMU_HP_PROCON_WOP3_S124WOP_OFF (28u)

/** \brief  Length for Ifx_DMU_HP_PROCON_WOP3_Bits.S125WOP */
#define IFX_DMU_HP_PROCON_WOP3_S125WOP_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_WOP3_Bits.S125WOP */
#define IFX_DMU_HP_PROCON_WOP3_S125WOP_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_WOP3_Bits.S125WOP */
#define IFX_DMU_HP_PROCON_WOP3_S125WOP_OFF (29u)

/** \brief  Length for Ifx_DMU_HP_PROCON_WOP3_Bits.S126WOP */
#define IFX_DMU_HP_PROCON_WOP3_S126WOP_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_WOP3_Bits.S126WOP */
#define IFX_DMU_HP_PROCON_WOP3_S126WOP_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_WOP3_Bits.S126WOP */
#define IFX_DMU_HP_PROCON_WOP3_S126WOP_OFF (30u)

/** \brief  Length for Ifx_DMU_HP_PROCON_WOP3_Bits.S127WOP */
#define IFX_DMU_HP_PROCON_WOP3_S127WOP_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_WOP3_Bits.S127WOP */
#define IFX_DMU_HP_PROCON_WOP3_S127WOP_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_WOP3_Bits.S127WOP */
#define IFX_DMU_HP_PROCON_WOP3_S127WOP_OFF (31u)

/** \brief  Length for Ifx_DMU_HP_PROCON_WOP3_Bits.S96WOP */
#define IFX_DMU_HP_PROCON_WOP3_S96WOP_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_WOP3_Bits.S96WOP */
#define IFX_DMU_HP_PROCON_WOP3_S96WOP_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_WOP3_Bits.S96WOP */
#define IFX_DMU_HP_PROCON_WOP3_S96WOP_OFF (0u)

/** \brief  Length for Ifx_DMU_HP_PROCON_WOP3_Bits.S97WOP */
#define IFX_DMU_HP_PROCON_WOP3_S97WOP_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_WOP3_Bits.S97WOP */
#define IFX_DMU_HP_PROCON_WOP3_S97WOP_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_WOP3_Bits.S97WOP */
#define IFX_DMU_HP_PROCON_WOP3_S97WOP_OFF (1u)

/** \brief  Length for Ifx_DMU_HP_PROCON_WOP3_Bits.S98WOP */
#define IFX_DMU_HP_PROCON_WOP3_S98WOP_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_WOP3_Bits.S98WOP */
#define IFX_DMU_HP_PROCON_WOP3_S98WOP_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_WOP3_Bits.S98WOP */
#define IFX_DMU_HP_PROCON_WOP3_S98WOP_OFF (2u)

/** \brief  Length for Ifx_DMU_HP_PROCON_WOP3_Bits.S99WOP */
#define IFX_DMU_HP_PROCON_WOP3_S99WOP_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_WOP3_Bits.S99WOP */
#define IFX_DMU_HP_PROCON_WOP3_S99WOP_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_WOP3_Bits.S99WOP */
#define IFX_DMU_HP_PROCON_WOP3_S99WOP_OFF (3u)

/** \brief  Length for Ifx_DMU_HP_PROCON_WOP4_Bits.S128WOP */
#define IFX_DMU_HP_PROCON_WOP4_S128WOP_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_WOP4_Bits.S128WOP */
#define IFX_DMU_HP_PROCON_WOP4_S128WOP_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_WOP4_Bits.S128WOP */
#define IFX_DMU_HP_PROCON_WOP4_S128WOP_OFF (0u)

/** \brief  Length for Ifx_DMU_HP_PROCON_WOP4_Bits.S129WOP */
#define IFX_DMU_HP_PROCON_WOP4_S129WOP_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_WOP4_Bits.S129WOP */
#define IFX_DMU_HP_PROCON_WOP4_S129WOP_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_WOP4_Bits.S129WOP */
#define IFX_DMU_HP_PROCON_WOP4_S129WOP_OFF (1u)

/** \brief  Length for Ifx_DMU_HP_PROCON_WOP4_Bits.S130WOP */
#define IFX_DMU_HP_PROCON_WOP4_S130WOP_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_WOP4_Bits.S130WOP */
#define IFX_DMU_HP_PROCON_WOP4_S130WOP_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_WOP4_Bits.S130WOP */
#define IFX_DMU_HP_PROCON_WOP4_S130WOP_OFF (2u)

/** \brief  Length for Ifx_DMU_HP_PROCON_WOP4_Bits.S131WOP */
#define IFX_DMU_HP_PROCON_WOP4_S131WOP_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_WOP4_Bits.S131WOP */
#define IFX_DMU_HP_PROCON_WOP4_S131WOP_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_WOP4_Bits.S131WOP */
#define IFX_DMU_HP_PROCON_WOP4_S131WOP_OFF (3u)

/** \brief  Length for Ifx_DMU_HP_PROCON_WOP4_Bits.S132WOP */
#define IFX_DMU_HP_PROCON_WOP4_S132WOP_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_WOP4_Bits.S132WOP */
#define IFX_DMU_HP_PROCON_WOP4_S132WOP_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_WOP4_Bits.S132WOP */
#define IFX_DMU_HP_PROCON_WOP4_S132WOP_OFF (4u)

/** \brief  Length for Ifx_DMU_HP_PROCON_WOP4_Bits.S133WOP */
#define IFX_DMU_HP_PROCON_WOP4_S133WOP_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_WOP4_Bits.S133WOP */
#define IFX_DMU_HP_PROCON_WOP4_S133WOP_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_WOP4_Bits.S133WOP */
#define IFX_DMU_HP_PROCON_WOP4_S133WOP_OFF (5u)

/** \brief  Length for Ifx_DMU_HP_PROCON_WOP4_Bits.S134WOP */
#define IFX_DMU_HP_PROCON_WOP4_S134WOP_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_WOP4_Bits.S134WOP */
#define IFX_DMU_HP_PROCON_WOP4_S134WOP_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_WOP4_Bits.S134WOP */
#define IFX_DMU_HP_PROCON_WOP4_S134WOP_OFF (6u)

/** \brief  Length for Ifx_DMU_HP_PROCON_WOP4_Bits.S135WOP */
#define IFX_DMU_HP_PROCON_WOP4_S135WOP_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_WOP4_Bits.S135WOP */
#define IFX_DMU_HP_PROCON_WOP4_S135WOP_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_WOP4_Bits.S135WOP */
#define IFX_DMU_HP_PROCON_WOP4_S135WOP_OFF (7u)

