Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxDmu_bf.h
/** \brief  Length for Ifx_DMU_HP_PROCON_WOP4_Bits.S136WOP */
#define IFX_DMU_HP_PROCON_WOP4_S136WOP_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_WOP4_Bits.S136WOP */
#define IFX_DMU_HP_PROCON_WOP4_S136WOP_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_WOP4_Bits.S136WOP */
#define IFX_DMU_HP_PROCON_WOP4_S136WOP_OFF (8u)

/** \brief  Length for Ifx_DMU_HP_PROCON_WOP4_Bits.S137WOP */
#define IFX_DMU_HP_PROCON_WOP4_S137WOP_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_WOP4_Bits.S137WOP */
#define IFX_DMU_HP_PROCON_WOP4_S137WOP_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_WOP4_Bits.S137WOP */
#define IFX_DMU_HP_PROCON_WOP4_S137WOP_OFF (9u)

/** \brief  Length for Ifx_DMU_HP_PROCON_WOP4_Bits.S138WOP */
#define IFX_DMU_HP_PROCON_WOP4_S138WOP_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_WOP4_Bits.S138WOP */
#define IFX_DMU_HP_PROCON_WOP4_S138WOP_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_WOP4_Bits.S138WOP */
#define IFX_DMU_HP_PROCON_WOP4_S138WOP_OFF (10u)

/** \brief  Length for Ifx_DMU_HP_PROCON_WOP4_Bits.S139WOP */
#define IFX_DMU_HP_PROCON_WOP4_S139WOP_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_WOP4_Bits.S139WOP */
#define IFX_DMU_HP_PROCON_WOP4_S139WOP_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_WOP4_Bits.S139WOP */
#define IFX_DMU_HP_PROCON_WOP4_S139WOP_OFF (11u)

/** \brief  Length for Ifx_DMU_HP_PROCON_WOP4_Bits.S140WOP */
#define IFX_DMU_HP_PROCON_WOP4_S140WOP_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_WOP4_Bits.S140WOP */
#define IFX_DMU_HP_PROCON_WOP4_S140WOP_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_WOP4_Bits.S140WOP */
#define IFX_DMU_HP_PROCON_WOP4_S140WOP_OFF (12u)

/** \brief  Length for Ifx_DMU_HP_PROCON_WOP4_Bits.S141WOP */
#define IFX_DMU_HP_PROCON_WOP4_S141WOP_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_WOP4_Bits.S141WOP */
#define IFX_DMU_HP_PROCON_WOP4_S141WOP_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_WOP4_Bits.S141WOP */
#define IFX_DMU_HP_PROCON_WOP4_S141WOP_OFF (13u)

/** \brief  Length for Ifx_DMU_HP_PROCON_WOP4_Bits.S142WOP */
#define IFX_DMU_HP_PROCON_WOP4_S142WOP_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_WOP4_Bits.S142WOP */
#define IFX_DMU_HP_PROCON_WOP4_S142WOP_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_WOP4_Bits.S142WOP */
#define IFX_DMU_HP_PROCON_WOP4_S142WOP_OFF (14u)

/** \brief  Length for Ifx_DMU_HP_PROCON_WOP4_Bits.S143WOP */
#define IFX_DMU_HP_PROCON_WOP4_S143WOP_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_WOP4_Bits.S143WOP */
#define IFX_DMU_HP_PROCON_WOP4_S143WOP_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_WOP4_Bits.S143WOP */
#define IFX_DMU_HP_PROCON_WOP4_S143WOP_OFF (15u)

/** \brief  Length for Ifx_DMU_HP_PROCON_WOP4_Bits.S144WOP */
#define IFX_DMU_HP_PROCON_WOP4_S144WOP_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_WOP4_Bits.S144WOP */
#define IFX_DMU_HP_PROCON_WOP4_S144WOP_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_WOP4_Bits.S144WOP */
#define IFX_DMU_HP_PROCON_WOP4_S144WOP_OFF (16u)

/** \brief  Length for Ifx_DMU_HP_PROCON_WOP4_Bits.S145WOP */
#define IFX_DMU_HP_PROCON_WOP4_S145WOP_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_WOP4_Bits.S145WOP */
#define IFX_DMU_HP_PROCON_WOP4_S145WOP_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_WOP4_Bits.S145WOP */
#define IFX_DMU_HP_PROCON_WOP4_S145WOP_OFF (17u)

/** \brief  Length for Ifx_DMU_HP_PROCON_WOP4_Bits.S146WOP */
#define IFX_DMU_HP_PROCON_WOP4_S146WOP_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_WOP4_Bits.S146WOP */
#define IFX_DMU_HP_PROCON_WOP4_S146WOP_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_WOP4_Bits.S146WOP */
#define IFX_DMU_HP_PROCON_WOP4_S146WOP_OFF (18u)

/** \brief  Length for Ifx_DMU_HP_PROCON_WOP4_Bits.S147WOP */
#define IFX_DMU_HP_PROCON_WOP4_S147WOP_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_WOP4_Bits.S147WOP */
#define IFX_DMU_HP_PROCON_WOP4_S147WOP_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_WOP4_Bits.S147WOP */
#define IFX_DMU_HP_PROCON_WOP4_S147WOP_OFF (19u)

/** \brief  Length for Ifx_DMU_HP_PROCON_WOP4_Bits.S148WOP */
#define IFX_DMU_HP_PROCON_WOP4_S148WOP_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_WOP4_Bits.S148WOP */
#define IFX_DMU_HP_PROCON_WOP4_S148WOP_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_WOP4_Bits.S148WOP */
#define IFX_DMU_HP_PROCON_WOP4_S148WOP_OFF (20u)

/** \brief  Length for Ifx_DMU_HP_PROCON_WOP4_Bits.S149WOP */
#define IFX_DMU_HP_PROCON_WOP4_S149WOP_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_WOP4_Bits.S149WOP */
#define IFX_DMU_HP_PROCON_WOP4_S149WOP_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_WOP4_Bits.S149WOP */
#define IFX_DMU_HP_PROCON_WOP4_S149WOP_OFF (21u)

/** \brief  Length for Ifx_DMU_HP_PROCON_WOP4_Bits.S150WOP */
#define IFX_DMU_HP_PROCON_WOP4_S150WOP_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_WOP4_Bits.S150WOP */
#define IFX_DMU_HP_PROCON_WOP4_S150WOP_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_WOP4_Bits.S150WOP */
#define IFX_DMU_HP_PROCON_WOP4_S150WOP_OFF (22u)

/** \brief  Length for Ifx_DMU_HP_PROCON_WOP4_Bits.S151WOP */
#define IFX_DMU_HP_PROCON_WOP4_S151WOP_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_WOP4_Bits.S151WOP */
#define IFX_DMU_HP_PROCON_WOP4_S151WOP_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_WOP4_Bits.S151WOP */
#define IFX_DMU_HP_PROCON_WOP4_S151WOP_OFF (23u)

/** \brief  Length for Ifx_DMU_HP_PROCON_WOP4_Bits.S152WOP */
#define IFX_DMU_HP_PROCON_WOP4_S152WOP_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_WOP4_Bits.S152WOP */
#define IFX_DMU_HP_PROCON_WOP4_S152WOP_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_WOP4_Bits.S152WOP */
#define IFX_DMU_HP_PROCON_WOP4_S152WOP_OFF (24u)

/** \brief  Length for Ifx_DMU_HP_PROCON_WOP4_Bits.S153WOP */
#define IFX_DMU_HP_PROCON_WOP4_S153WOP_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_WOP4_Bits.S153WOP */
#define IFX_DMU_HP_PROCON_WOP4_S153WOP_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_WOP4_Bits.S153WOP */
#define IFX_DMU_HP_PROCON_WOP4_S153WOP_OFF (25u)

/** \brief  Length for Ifx_DMU_HP_PROCON_WOP4_Bits.S154WOP */
#define IFX_DMU_HP_PROCON_WOP4_S154WOP_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_WOP4_Bits.S154WOP */
#define IFX_DMU_HP_PROCON_WOP4_S154WOP_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_WOP4_Bits.S154WOP */
#define IFX_DMU_HP_PROCON_WOP4_S154WOP_OFF (26u)

/** \brief  Length for Ifx_DMU_HP_PROCON_WOP4_Bits.S155WOP */
#define IFX_DMU_HP_PROCON_WOP4_S155WOP_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_WOP4_Bits.S155WOP */
#define IFX_DMU_HP_PROCON_WOP4_S155WOP_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_WOP4_Bits.S155WOP */
#define IFX_DMU_HP_PROCON_WOP4_S155WOP_OFF (27u)

/** \brief  Length for Ifx_DMU_HP_PROCON_WOP4_Bits.S156WOP */
#define IFX_DMU_HP_PROCON_WOP4_S156WOP_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_WOP4_Bits.S156WOP */
#define IFX_DMU_HP_PROCON_WOP4_S156WOP_MSK (0x1u)

