Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxDmu_bf.h
/** \brief  Offset for Ifx_DMU_HP_PROCON_WOP4_Bits.S156WOP */
#define IFX_DMU_HP_PROCON_WOP4_S156WOP_OFF (28u)

/** \brief  Length for Ifx_DMU_HP_PROCON_WOP4_Bits.S157WOP */
#define IFX_DMU_HP_PROCON_WOP4_S157WOP_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_WOP4_Bits.S157WOP */
#define IFX_DMU_HP_PROCON_WOP4_S157WOP_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_WOP4_Bits.S157WOP */
#define IFX_DMU_HP_PROCON_WOP4_S157WOP_OFF (29u)

/** \brief  Length for Ifx_DMU_HP_PROCON_WOP4_Bits.S158WOP */
#define IFX_DMU_HP_PROCON_WOP4_S158WOP_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_WOP4_Bits.S158WOP */
#define IFX_DMU_HP_PROCON_WOP4_S158WOP_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_WOP4_Bits.S158WOP */
#define IFX_DMU_HP_PROCON_WOP4_S158WOP_OFF (30u)

/** \brief  Length for Ifx_DMU_HP_PROCON_WOP4_Bits.S159WOP */
#define IFX_DMU_HP_PROCON_WOP4_S159WOP_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_WOP4_Bits.S159WOP */
#define IFX_DMU_HP_PROCON_WOP4_S159WOP_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_WOP4_Bits.S159WOP */
#define IFX_DMU_HP_PROCON_WOP4_S159WOP_OFF (31u)

/** \brief  Length for Ifx_DMU_HP_PROCON_WOP5_Bits.S160WOP */
#define IFX_DMU_HP_PROCON_WOP5_S160WOP_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_WOP5_Bits.S160WOP */
#define IFX_DMU_HP_PROCON_WOP5_S160WOP_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_WOP5_Bits.S160WOP */
#define IFX_DMU_HP_PROCON_WOP5_S160WOP_OFF (0u)

/** \brief  Length for Ifx_DMU_HP_PROCON_WOP5_Bits.S161WOP */
#define IFX_DMU_HP_PROCON_WOP5_S161WOP_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_WOP5_Bits.S161WOP */
#define IFX_DMU_HP_PROCON_WOP5_S161WOP_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_WOP5_Bits.S161WOP */
#define IFX_DMU_HP_PROCON_WOP5_S161WOP_OFF (1u)

/** \brief  Length for Ifx_DMU_HP_PROCON_WOP5_Bits.S162WOP */
#define IFX_DMU_HP_PROCON_WOP5_S162WOP_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_WOP5_Bits.S162WOP */
#define IFX_DMU_HP_PROCON_WOP5_S162WOP_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_WOP5_Bits.S162WOP */
#define IFX_DMU_HP_PROCON_WOP5_S162WOP_OFF (2u)

/** \brief  Length for Ifx_DMU_HP_PROCON_WOP5_Bits.S163WOP */
#define IFX_DMU_HP_PROCON_WOP5_S163WOP_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_WOP5_Bits.S163WOP */
#define IFX_DMU_HP_PROCON_WOP5_S163WOP_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_WOP5_Bits.S163WOP */
#define IFX_DMU_HP_PROCON_WOP5_S163WOP_OFF (3u)

/** \brief  Length for Ifx_DMU_HP_PROCON_WOP5_Bits.S164WOP */
#define IFX_DMU_HP_PROCON_WOP5_S164WOP_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_WOP5_Bits.S164WOP */
#define IFX_DMU_HP_PROCON_WOP5_S164WOP_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_WOP5_Bits.S164WOP */
#define IFX_DMU_HP_PROCON_WOP5_S164WOP_OFF (4u)

/** \brief  Length for Ifx_DMU_HP_PROCON_WOP5_Bits.S165WOP */
#define IFX_DMU_HP_PROCON_WOP5_S165WOP_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_WOP5_Bits.S165WOP */
#define IFX_DMU_HP_PROCON_WOP5_S165WOP_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_WOP5_Bits.S165WOP */
#define IFX_DMU_HP_PROCON_WOP5_S165WOP_OFF (5u)

/** \brief  Length for Ifx_DMU_HP_PROCON_WOP5_Bits.S166WOP */
#define IFX_DMU_HP_PROCON_WOP5_S166WOP_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_WOP5_Bits.S166WOP */
#define IFX_DMU_HP_PROCON_WOP5_S166WOP_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_WOP5_Bits.S166WOP */
#define IFX_DMU_HP_PROCON_WOP5_S166WOP_OFF (6u)

/** \brief  Length for Ifx_DMU_HP_PROCON_WOP5_Bits.S167WOP */
#define IFX_DMU_HP_PROCON_WOP5_S167WOP_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_WOP5_Bits.S167WOP */
#define IFX_DMU_HP_PROCON_WOP5_S167WOP_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_WOP5_Bits.S167WOP */
#define IFX_DMU_HP_PROCON_WOP5_S167WOP_OFF (7u)

/** \brief  Length for Ifx_DMU_HP_PROCON_WOP5_Bits.S168WOP */
#define IFX_DMU_HP_PROCON_WOP5_S168WOP_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_WOP5_Bits.S168WOP */
#define IFX_DMU_HP_PROCON_WOP5_S168WOP_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_WOP5_Bits.S168WOP */
#define IFX_DMU_HP_PROCON_WOP5_S168WOP_OFF (8u)

/** \brief  Length for Ifx_DMU_HP_PROCON_WOP5_Bits.S169WOP */
#define IFX_DMU_HP_PROCON_WOP5_S169WOP_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_WOP5_Bits.S169WOP */
#define IFX_DMU_HP_PROCON_WOP5_S169WOP_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_WOP5_Bits.S169WOP */
#define IFX_DMU_HP_PROCON_WOP5_S169WOP_OFF (9u)

/** \brief  Length for Ifx_DMU_HP_PROCON_WOP5_Bits.S170WOP */
#define IFX_DMU_HP_PROCON_WOP5_S170WOP_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_WOP5_Bits.S170WOP */
#define IFX_DMU_HP_PROCON_WOP5_S170WOP_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_WOP5_Bits.S170WOP */
#define IFX_DMU_HP_PROCON_WOP5_S170WOP_OFF (10u)

/** \brief  Length for Ifx_DMU_HP_PROCON_WOP5_Bits.S171WOP */
#define IFX_DMU_HP_PROCON_WOP5_S171WOP_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_WOP5_Bits.S171WOP */
#define IFX_DMU_HP_PROCON_WOP5_S171WOP_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_WOP5_Bits.S171WOP */
#define IFX_DMU_HP_PROCON_WOP5_S171WOP_OFF (11u)

/** \brief  Length for Ifx_DMU_HP_PROCON_WOP5_Bits.S172WOP */
#define IFX_DMU_HP_PROCON_WOP5_S172WOP_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_WOP5_Bits.S172WOP */
#define IFX_DMU_HP_PROCON_WOP5_S172WOP_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_WOP5_Bits.S172WOP */
#define IFX_DMU_HP_PROCON_WOP5_S172WOP_OFF (12u)

/** \brief  Length for Ifx_DMU_HP_PROCON_WOP5_Bits.S173WOP */
#define IFX_DMU_HP_PROCON_WOP5_S173WOP_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_WOP5_Bits.S173WOP */
#define IFX_DMU_HP_PROCON_WOP5_S173WOP_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_WOP5_Bits.S173WOP */
#define IFX_DMU_HP_PROCON_WOP5_S173WOP_OFF (13u)

/** \brief  Length for Ifx_DMU_HP_PROCON_WOP5_Bits.S174WOP */
#define IFX_DMU_HP_PROCON_WOP5_S174WOP_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_WOP5_Bits.S174WOP */
#define IFX_DMU_HP_PROCON_WOP5_S174WOP_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_WOP5_Bits.S174WOP */
#define IFX_DMU_HP_PROCON_WOP5_S174WOP_OFF (14u)

