Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxDmu_bf.h
/** \brief  Length for Ifx_DMU_HP_PROCON_WOP5_Bits.S175WOP */
#define IFX_DMU_HP_PROCON_WOP5_S175WOP_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_WOP5_Bits.S175WOP */
#define IFX_DMU_HP_PROCON_WOP5_S175WOP_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_WOP5_Bits.S175WOP */
#define IFX_DMU_HP_PROCON_WOP5_S175WOP_OFF (15u)

/** \brief  Length for Ifx_DMU_HP_PROCON_WOP5_Bits.S176WOP */
#define IFX_DMU_HP_PROCON_WOP5_S176WOP_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_WOP5_Bits.S176WOP */
#define IFX_DMU_HP_PROCON_WOP5_S176WOP_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_WOP5_Bits.S176WOP */
#define IFX_DMU_HP_PROCON_WOP5_S176WOP_OFF (16u)

/** \brief  Length for Ifx_DMU_HP_PROCON_WOP5_Bits.S177WOP */
#define IFX_DMU_HP_PROCON_WOP5_S177WOP_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_WOP5_Bits.S177WOP */
#define IFX_DMU_HP_PROCON_WOP5_S177WOP_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_WOP5_Bits.S177WOP */
#define IFX_DMU_HP_PROCON_WOP5_S177WOP_OFF (17u)

/** \brief  Length for Ifx_DMU_HP_PROCON_WOP5_Bits.S178WOP */
#define IFX_DMU_HP_PROCON_WOP5_S178WOP_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_WOP5_Bits.S178WOP */
#define IFX_DMU_HP_PROCON_WOP5_S178WOP_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_WOP5_Bits.S178WOP */
#define IFX_DMU_HP_PROCON_WOP5_S178WOP_OFF (18u)

/** \brief  Length for Ifx_DMU_HP_PROCON_WOP5_Bits.S179WOP */
#define IFX_DMU_HP_PROCON_WOP5_S179WOP_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_WOP5_Bits.S179WOP */
#define IFX_DMU_HP_PROCON_WOP5_S179WOP_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_WOP5_Bits.S179WOP */
#define IFX_DMU_HP_PROCON_WOP5_S179WOP_OFF (19u)

/** \brief  Length for Ifx_DMU_HP_PROCON_WOP5_Bits.S180WOP */
#define IFX_DMU_HP_PROCON_WOP5_S180WOP_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_WOP5_Bits.S180WOP */
#define IFX_DMU_HP_PROCON_WOP5_S180WOP_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_WOP5_Bits.S180WOP */
#define IFX_DMU_HP_PROCON_WOP5_S180WOP_OFF (20u)

/** \brief  Length for Ifx_DMU_HP_PROCON_WOP5_Bits.S181WOP */
#define IFX_DMU_HP_PROCON_WOP5_S181WOP_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_WOP5_Bits.S181WOP */
#define IFX_DMU_HP_PROCON_WOP5_S181WOP_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_WOP5_Bits.S181WOP */
#define IFX_DMU_HP_PROCON_WOP5_S181WOP_OFF (21u)

/** \brief  Length for Ifx_DMU_HP_PROCON_WOP5_Bits.S182WOP */
#define IFX_DMU_HP_PROCON_WOP5_S182WOP_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_WOP5_Bits.S182WOP */
#define IFX_DMU_HP_PROCON_WOP5_S182WOP_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_WOP5_Bits.S182WOP */
#define IFX_DMU_HP_PROCON_WOP5_S182WOP_OFF (22u)

/** \brief  Length for Ifx_DMU_HP_PROCON_WOP5_Bits.S183WOP */
#define IFX_DMU_HP_PROCON_WOP5_S183WOP_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_WOP5_Bits.S183WOP */
#define IFX_DMU_HP_PROCON_WOP5_S183WOP_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_WOP5_Bits.S183WOP */
#define IFX_DMU_HP_PROCON_WOP5_S183WOP_OFF (23u)

/** \brief  Length for Ifx_DMU_HP_PROCON_WOP5_Bits.S184WOP */
#define IFX_DMU_HP_PROCON_WOP5_S184WOP_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_WOP5_Bits.S184WOP */
#define IFX_DMU_HP_PROCON_WOP5_S184WOP_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_WOP5_Bits.S184WOP */
#define IFX_DMU_HP_PROCON_WOP5_S184WOP_OFF (24u)

/** \brief  Length for Ifx_DMU_HP_PROCON_WOP5_Bits.S185WOP */
#define IFX_DMU_HP_PROCON_WOP5_S185WOP_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_WOP5_Bits.S185WOP */
#define IFX_DMU_HP_PROCON_WOP5_S185WOP_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_WOP5_Bits.S185WOP */
#define IFX_DMU_HP_PROCON_WOP5_S185WOP_OFF (25u)

/** \brief  Length for Ifx_DMU_HP_PROCON_WOP5_Bits.S186WOP */
#define IFX_DMU_HP_PROCON_WOP5_S186WOP_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_WOP5_Bits.S186WOP */
#define IFX_DMU_HP_PROCON_WOP5_S186WOP_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_WOP5_Bits.S186WOP */
#define IFX_DMU_HP_PROCON_WOP5_S186WOP_OFF (26u)

/** \brief  Length for Ifx_DMU_HP_PROCON_WOP5_Bits.S187WOP */
#define IFX_DMU_HP_PROCON_WOP5_S187WOP_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_WOP5_Bits.S187WOP */
#define IFX_DMU_HP_PROCON_WOP5_S187WOP_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_WOP5_Bits.S187WOP */
#define IFX_DMU_HP_PROCON_WOP5_S187WOP_OFF (27u)

/** \brief  Length for Ifx_DMU_HP_PROCON_WOP5_Bits.S188WOP */
#define IFX_DMU_HP_PROCON_WOP5_S188WOP_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_WOP5_Bits.S188WOP */
#define IFX_DMU_HP_PROCON_WOP5_S188WOP_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_WOP5_Bits.S188WOP */
#define IFX_DMU_HP_PROCON_WOP5_S188WOP_OFF (28u)

/** \brief  Length for Ifx_DMU_HP_PROCON_WOP5_Bits.S189WOP */
#define IFX_DMU_HP_PROCON_WOP5_S189WOP_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_WOP5_Bits.S189WOP */
#define IFX_DMU_HP_PROCON_WOP5_S189WOP_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_WOP5_Bits.S189WOP */
#define IFX_DMU_HP_PROCON_WOP5_S189WOP_OFF (29u)

/** \brief  Length for Ifx_DMU_HP_PROCON_WOP5_Bits.S190WOP */
#define IFX_DMU_HP_PROCON_WOP5_S190WOP_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_WOP5_Bits.S190WOP */
#define IFX_DMU_HP_PROCON_WOP5_S190WOP_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_WOP5_Bits.S190WOP */
#define IFX_DMU_HP_PROCON_WOP5_S190WOP_OFF (30u)

/** \brief  Length for Ifx_DMU_HP_PROCON_WOP5_Bits.S191WOP */
#define IFX_DMU_HP_PROCON_WOP5_S191WOP_LEN (1u)

/** \brief  Mask for Ifx_DMU_HP_PROCON_WOP5_Bits.S191WOP */
#define IFX_DMU_HP_PROCON_WOP5_S191WOP_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_HP_PROCON_WOP5_Bits.S191WOP */
#define IFX_DMU_HP_PROCON_WOP5_S191WOP_OFF (31u)

/** \brief  Length for Ifx_DMU_SF_CLRE_Bits.CEVER */
#define IFX_DMU_SF_CLRE_CEVER_LEN (1u)

/** \brief  Mask for Ifx_DMU_SF_CLRE_Bits.CEVER */
#define IFX_DMU_SF_CLRE_CEVER_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_SF_CLRE_Bits.CEVER */
#define IFX_DMU_SF_CLRE_CEVER_OFF (4u)

/** \brief  Length for Ifx_DMU_SF_CLRE_Bits.CPVER */
#define IFX_DMU_SF_CLRE_CPVER_LEN (1u)

/** \brief  Mask for Ifx_DMU_SF_CLRE_Bits.CPVER */
#define IFX_DMU_SF_CLRE_CPVER_MSK (0x1u)

