Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxDmu_bf.h
/** \brief  Offset for Ifx_DMU_SF_CLRE_Bits.CPVER */
#define IFX_DMU_SF_CLRE_CPVER_OFF (3u)

/** \brief  Length for Ifx_DMU_SF_CLRE_Bits.CSQER */
#define IFX_DMU_SF_CLRE_CSQER_LEN (1u)

/** \brief  Mask for Ifx_DMU_SF_CLRE_Bits.CSQER */
#define IFX_DMU_SF_CLRE_CSQER_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_SF_CLRE_Bits.CSQER */
#define IFX_DMU_SF_CLRE_CSQER_OFF (1u)

/** \brief  Length for Ifx_DMU_SF_CONTROL_Bits.CERASE */
#define IFX_DMU_SF_CONTROL_CERASE_LEN (1u)

/** \brief  Mask for Ifx_DMU_SF_CONTROL_Bits.CERASE */
#define IFX_DMU_SF_CONTROL_CERASE_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_SF_CONTROL_Bits.CERASE */
#define IFX_DMU_SF_CONTROL_CERASE_OFF (17u)

/** \brief  Length for Ifx_DMU_SF_CONTROL_Bits.CPROG */
#define IFX_DMU_SF_CONTROL_CPROG_LEN (1u)

/** \brief  Mask for Ifx_DMU_SF_CONTROL_Bits.CPROG */
#define IFX_DMU_SF_CONTROL_CPROG_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_SF_CONTROL_Bits.CPROG */
#define IFX_DMU_SF_CONTROL_CPROG_OFF (16u)

/** \brief  Length for Ifx_DMU_SF_CONTROL_Bits.CUSER */
#define IFX_DMU_SF_CONTROL_CUSER_LEN (1u)

/** \brief  Mask for Ifx_DMU_SF_CONTROL_Bits.CUSER */
#define IFX_DMU_SF_CONTROL_CUSER_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_SF_CONTROL_Bits.CUSER */
#define IFX_DMU_SF_CONTROL_CUSER_OFF (18u)

/** \brief  Length for Ifx_DMU_SF_CONTROL_Bits.LCKHSMUCB */
#define IFX_DMU_SF_CONTROL_LCKHSMUCB_LEN (2u)

/** \brief  Mask for Ifx_DMU_SF_CONTROL_Bits.LCKHSMUCB */
#define IFX_DMU_SF_CONTROL_LCKHSMUCB_MSK (0x3u)

/** \brief  Offset for Ifx_DMU_SF_CONTROL_Bits.LCKHSMUCB */
#define IFX_DMU_SF_CONTROL_LCKHSMUCB_OFF (0u)

/** \brief  Length for Ifx_DMU_SF_ECCC_Bits.CLR */
#define IFX_DMU_SF_ECCC_CLR_LEN (2u)

/** \brief  Mask for Ifx_DMU_SF_ECCC_Bits.CLR */
#define IFX_DMU_SF_ECCC_CLR_MSK (0x3u)

/** \brief  Offset for Ifx_DMU_SF_ECCC_Bits.CLR */
#define IFX_DMU_SF_ECCC_CLR_OFF (0u)

/** \brief  Length for Ifx_DMU_SF_ECCC_Bits.ECCCORDIS */
#define IFX_DMU_SF_ECCC_ECCCORDIS_LEN (2u)

/** \brief  Mask for Ifx_DMU_SF_ECCC_Bits.ECCCORDIS */
#define IFX_DMU_SF_ECCC_ECCCORDIS_MSK (0x3u)

/** \brief  Offset for Ifx_DMU_SF_ECCC_Bits.ECCCORDIS */
#define IFX_DMU_SF_ECCC_ECCCORDIS_OFF (28u)

/** \brief  Length for Ifx_DMU_SF_ECCC_Bits.TRAPDIS */
#define IFX_DMU_SF_ECCC_TRAPDIS_LEN (2u)

/** \brief  Mask for Ifx_DMU_SF_ECCC_Bits.TRAPDIS */
#define IFX_DMU_SF_ECCC_TRAPDIS_MSK (0x3u)

/** \brief  Offset for Ifx_DMU_SF_ECCC_Bits.TRAPDIS */
#define IFX_DMU_SF_ECCC_TRAPDIS_OFF (30u)

/** \brief  Length for Ifx_DMU_SF_ECCR_Bits.RCODE */
#define IFX_DMU_SF_ECCR_RCODE_LEN (22u)

/** \brief  Mask for Ifx_DMU_SF_ECCR_Bits.RCODE */
#define IFX_DMU_SF_ECCR_RCODE_MSK (0x3fffffu)

/** \brief  Offset for Ifx_DMU_SF_ECCR_Bits.RCODE */
#define IFX_DMU_SF_ECCR_RCODE_OFF (0u)

/** \brief  Length for Ifx_DMU_SF_ECCR_Bits.RED */
#define IFX_DMU_SF_ECCR_RED_LEN (2u)

/** \brief  Mask for Ifx_DMU_SF_ECCR_Bits.RED */
#define IFX_DMU_SF_ECCR_RED_MSK (0x3u)

/** \brief  Offset for Ifx_DMU_SF_ECCR_Bits.RED */
#define IFX_DMU_SF_ECCR_RED_OFF (22u)

/** \brief  Length for Ifx_DMU_SF_ECCS_Bits.ABLANKA */
#define IFX_DMU_SF_ECCS_ABLANKA_LEN (1u)

/** \brief  Mask for Ifx_DMU_SF_ECCS_Bits.ABLANKA */
#define IFX_DMU_SF_ECCS_ABLANKA_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_SF_ECCS_Bits.ABLANKA */
#define IFX_DMU_SF_ECCS_ABLANKA_OFF (25u)

/** \brief  Length for Ifx_DMU_SF_ECCS_Bits.ABLANKD */
#define IFX_DMU_SF_ECCS_ABLANKD_LEN (1u)

/** \brief  Mask for Ifx_DMU_SF_ECCS_Bits.ABLANKD */
#define IFX_DMU_SF_ECCS_ABLANKD_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_SF_ECCS_Bits.ABLANKD */
#define IFX_DMU_SF_ECCS_ABLANKD_OFF (24u)

/** \brief  Length for Ifx_DMU_SF_ECCS_Bits.AER1 */
#define IFX_DMU_SF_ECCS_AER1_LEN (1u)

/** \brief  Mask for Ifx_DMU_SF_ECCS_Bits.AER1 */
#define IFX_DMU_SF_ECCS_AER1_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_SF_ECCS_Bits.AER1 */
#define IFX_DMU_SF_ECCS_AER1_OFF (16u)

/** \brief  Length for Ifx_DMU_SF_ECCS_Bits.AER2 */
#define IFX_DMU_SF_ECCS_AER2_LEN (1u)

/** \brief  Mask for Ifx_DMU_SF_ECCS_Bits.AER2 */
#define IFX_DMU_SF_ECCS_AER2_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_SF_ECCS_Bits.AER2 */
#define IFX_DMU_SF_ECCS_AER2_OFF (17u)

/** \brief  Length for Ifx_DMU_SF_ECCS_Bits.AER3 */
#define IFX_DMU_SF_ECCS_AER3_LEN (1u)

/** \brief  Mask for Ifx_DMU_SF_ECCS_Bits.AER3 */
#define IFX_DMU_SF_ECCS_AER3_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_SF_ECCS_Bits.AER3 */
#define IFX_DMU_SF_ECCS_AER3_OFF (18u)

/** \brief  Length for Ifx_DMU_SF_ECCS_Bits.AERANY */
#define IFX_DMU_SF_ECCS_AERANY_LEN (1u)

/** \brief  Mask for Ifx_DMU_SF_ECCS_Bits.AERANY */
#define IFX_DMU_SF_ECCS_AERANY_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_SF_ECCS_Bits.AERANY */
#define IFX_DMU_SF_ECCS_AERANY_OFF (23u)

/** \brief  Length for Ifx_DMU_SF_ECCS_Bits.AERM */
#define IFX_DMU_SF_ECCS_AERM_LEN (1u)

/** \brief  Mask for Ifx_DMU_SF_ECCS_Bits.AERM */
#define IFX_DMU_SF_ECCS_AERM_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_SF_ECCS_Bits.AERM */
#define IFX_DMU_SF_ECCS_AERM_OFF (19u)

/** \brief  Length for Ifx_DMU_SF_ECCS_Bits.BLANKA */
#define IFX_DMU_SF_ECCS_BLANKA_LEN (1u)

/** \brief  Mask for Ifx_DMU_SF_ECCS_Bits.BLANKA */
#define IFX_DMU_SF_ECCS_BLANKA_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_SF_ECCS_Bits.BLANKA */
#define IFX_DMU_SF_ECCS_BLANKA_OFF (9u)

/** \brief  Length for Ifx_DMU_SF_ECCS_Bits.BLANKD */
#define IFX_DMU_SF_ECCS_BLANKD_LEN (1u)

/** \brief  Mask for Ifx_DMU_SF_ECCS_Bits.BLANKD */
#define IFX_DMU_SF_ECCS_BLANKD_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_SF_ECCS_Bits.BLANKD */
#define IFX_DMU_SF_ECCS_BLANKD_OFF (8u)

/** \brief  Length for Ifx_DMU_SF_ECCS_Bits.ERR1 */
#define IFX_DMU_SF_ECCS_ERR1_LEN (1u)

/** \brief  Mask for Ifx_DMU_SF_ECCS_Bits.ERR1 */
#define IFX_DMU_SF_ECCS_ERR1_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_SF_ECCS_Bits.ERR1 */
#define IFX_DMU_SF_ECCS_ERR1_OFF (0u)

/** \brief  Length for Ifx_DMU_SF_ECCS_Bits.ERR2 */
#define IFX_DMU_SF_ECCS_ERR2_LEN (1u)

/** \brief  Mask for Ifx_DMU_SF_ECCS_Bits.ERR2 */
#define IFX_DMU_SF_ECCS_ERR2_MSK (0x1u)

