Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxDmu_bf.h
/** \brief  Offset for Ifx_DMU_SF_ECCS_Bits.ERR2 */
#define IFX_DMU_SF_ECCS_ERR2_OFF (1u)

/** \brief  Length for Ifx_DMU_SF_ECCS_Bits.ERR3 */
#define IFX_DMU_SF_ECCS_ERR3_LEN (1u)

/** \brief  Mask for Ifx_DMU_SF_ECCS_Bits.ERR3 */
#define IFX_DMU_SF_ECCS_ERR3_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_SF_ECCS_Bits.ERR3 */
#define IFX_DMU_SF_ECCS_ERR3_OFF (2u)

/** \brief  Length for Ifx_DMU_SF_ECCS_Bits.ERRANY */
#define IFX_DMU_SF_ECCS_ERRANY_LEN (1u)

/** \brief  Mask for Ifx_DMU_SF_ECCS_Bits.ERRANY */
#define IFX_DMU_SF_ECCS_ERRANY_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_SF_ECCS_Bits.ERRANY */
#define IFX_DMU_SF_ECCS_ERRANY_OFF (7u)

/** \brief  Length for Ifx_DMU_SF_ECCS_Bits.ERRM */
#define IFX_DMU_SF_ECCS_ERRM_LEN (1u)

/** \brief  Mask for Ifx_DMU_SF_ECCS_Bits.ERRM */
#define IFX_DMU_SF_ECCS_ERRM_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_SF_ECCS_Bits.ERRM */
#define IFX_DMU_SF_ECCS_ERRM_OFF (3u)

/** \brief  Length for Ifx_DMU_SF_ECCW_Bits.ECCENCDIS */
#define IFX_DMU_SF_ECCW_ECCENCDIS_LEN (2u)

/** \brief  Mask for Ifx_DMU_SF_ECCW_Bits.ECCENCDIS */
#define IFX_DMU_SF_ECCW_ECCENCDIS_MSK (0x3u)

/** \brief  Offset for Ifx_DMU_SF_ECCW_Bits.ECCENCDIS */
#define IFX_DMU_SF_ECCW_ECCENCDIS_OFF (30u)

/** \brief  Length for Ifx_DMU_SF_ECCW_Bits.WCODE */
#define IFX_DMU_SF_ECCW_WCODE_LEN (22u)

/** \brief  Mask for Ifx_DMU_SF_ECCW_Bits.WCODE */
#define IFX_DMU_SF_ECCW_WCODE_MSK (0x3fffffu)

/** \brief  Offset for Ifx_DMU_SF_ECCW_Bits.WCODE */
#define IFX_DMU_SF_ECCW_WCODE_OFF (0u)

/** \brief  Length for Ifx_DMU_SF_EER_Bits.EOBM */
#define IFX_DMU_SF_EER_EOBM_LEN (1u)

/** \brief  Mask for Ifx_DMU_SF_EER_Bits.EOBM */
#define IFX_DMU_SF_EER_EOBM_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_SF_EER_Bits.EOBM */
#define IFX_DMU_SF_EER_EOBM_OFF (31u)

/** \brief  Length for Ifx_DMU_SF_EER_Bits.EVERM */
#define IFX_DMU_SF_EER_EVERM_LEN (1u)

/** \brief  Mask for Ifx_DMU_SF_EER_Bits.EVERM */
#define IFX_DMU_SF_EER_EVERM_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_SF_EER_Bits.EVERM */
#define IFX_DMU_SF_EER_EVERM_OFF (4u)

/** \brief  Length for Ifx_DMU_SF_EER_Bits.OPERM */
#define IFX_DMU_SF_EER_OPERM_LEN (1u)

/** \brief  Mask for Ifx_DMU_SF_EER_Bits.OPERM */
#define IFX_DMU_SF_EER_OPERM_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_SF_EER_Bits.OPERM */
#define IFX_DMU_SF_EER_OPERM_OFF (0u)

/** \brief  Length for Ifx_DMU_SF_EER_Bits.PVERM */
#define IFX_DMU_SF_EER_PVERM_LEN (1u)

/** \brief  Mask for Ifx_DMU_SF_EER_Bits.PVERM */
#define IFX_DMU_SF_EER_PVERM_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_SF_EER_Bits.PVERM */
#define IFX_DMU_SF_EER_PVERM_OFF (3u)

/** \brief  Length for Ifx_DMU_SF_EER_Bits.SQERM */
#define IFX_DMU_SF_EER_SQERM_LEN (1u)

/** \brief  Mask for Ifx_DMU_SF_EER_Bits.SQERM */
#define IFX_DMU_SF_EER_SQERM_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_SF_EER_Bits.SQERM */
#define IFX_DMU_SF_EER_SQERM_OFF (1u)

/** \brief  Length for Ifx_DMU_SF_ERRSR_Bits.EVER */
#define IFX_DMU_SF_ERRSR_EVER_LEN (1u)

/** \brief  Mask for Ifx_DMU_SF_ERRSR_Bits.EVER */
#define IFX_DMU_SF_ERRSR_EVER_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_SF_ERRSR_Bits.EVER */
#define IFX_DMU_SF_ERRSR_EVER_OFF (4u)

/** \brief  Length for Ifx_DMU_SF_ERRSR_Bits.OPER */
#define IFX_DMU_SF_ERRSR_OPER_LEN (1u)

/** \brief  Mask for Ifx_DMU_SF_ERRSR_Bits.OPER */
#define IFX_DMU_SF_ERRSR_OPER_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_SF_ERRSR_Bits.OPER */
#define IFX_DMU_SF_ERRSR_OPER_OFF (0u)

/** \brief  Length for Ifx_DMU_SF_ERRSR_Bits.PVER */
#define IFX_DMU_SF_ERRSR_PVER_LEN (1u)

/** \brief  Mask for Ifx_DMU_SF_ERRSR_Bits.PVER */
#define IFX_DMU_SF_ERRSR_PVER_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_SF_ERRSR_Bits.PVER */
#define IFX_DMU_SF_ERRSR_PVER_OFF (3u)

/** \brief  Length for Ifx_DMU_SF_ERRSR_Bits.SQER */
#define IFX_DMU_SF_ERRSR_SQER_LEN (1u)

/** \brief  Mask for Ifx_DMU_SF_ERRSR_Bits.SQER */
#define IFX_DMU_SF_ERRSR_SQER_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_SF_ERRSR_Bits.SQER */
#define IFX_DMU_SF_ERRSR_SQER_OFF (1u)

/** \brief  Length for Ifx_DMU_SF_MARGIN_Bits.SELD1 */
#define IFX_DMU_SF_MARGIN_SELD1_LEN (2u)

/** \brief  Mask for Ifx_DMU_SF_MARGIN_Bits.SELD1 */
#define IFX_DMU_SF_MARGIN_SELD1_MSK (0x3u)

/** \brief  Offset for Ifx_DMU_SF_MARGIN_Bits.SELD1 */
#define IFX_DMU_SF_MARGIN_SELD1_OFF (0u)

/** \brief  Length for Ifx_DMU_SF_OPERATION_Bits.ERASE */
#define IFX_DMU_SF_OPERATION_ERASE_LEN (1u)

/** \brief  Mask for Ifx_DMU_SF_OPERATION_Bits.ERASE */
#define IFX_DMU_SF_OPERATION_ERASE_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_SF_OPERATION_Bits.ERASE */
#define IFX_DMU_SF_OPERATION_ERASE_OFF (1u)

/** \brief  Length for Ifx_DMU_SF_OPERATION_Bits.PROG */
#define IFX_DMU_SF_OPERATION_PROG_LEN (1u)

/** \brief  Mask for Ifx_DMU_SF_OPERATION_Bits.PROG */
#define IFX_DMU_SF_OPERATION_PROG_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_SF_OPERATION_Bits.PROG */
#define IFX_DMU_SF_OPERATION_PROG_OFF (0u)

/** \brief  Length for Ifx_DMU_SF_OPERATION_Bits.USER */
#define IFX_DMU_SF_OPERATION_USER_LEN (1u)

/** \brief  Mask for Ifx_DMU_SF_OPERATION_Bits.USER */
#define IFX_DMU_SF_OPERATION_USER_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_SF_OPERATION_Bits.USER */
#define IFX_DMU_SF_OPERATION_USER_OFF (2u)

/** \brief  Length for Ifx_DMU_SF_PROCONUSR_Bits.MODE */
#define IFX_DMU_SF_PROCONUSR_MODE_LEN (2u)

/** \brief  Mask for Ifx_DMU_SF_PROCONUSR_Bits.MODE */
#define IFX_DMU_SF_PROCONUSR_MODE_MSK (0x3u)

/** \brief  Offset for Ifx_DMU_SF_PROCONUSR_Bits.MODE */
#define IFX_DMU_SF_PROCONUSR_MODE_OFF (0u)

/** \brief  Length for Ifx_DMU_SF_PROCONUSR_Bits.UCB */
#define IFX_DMU_SF_PROCONUSR_UCB_LEN (30u)

/** \brief  Mask for Ifx_DMU_SF_PROCONUSR_Bits.UCB */
#define IFX_DMU_SF_PROCONUSR_UCB_MSK (0x3fffffffu)

/** \brief  Offset for Ifx_DMU_SF_PROCONUSR_Bits.UCB */
#define IFX_DMU_SF_PROCONUSR_UCB_OFF (2u)

/** \brief  Length for Ifx_DMU_SF_STATUS_Bits.D1BUSY */
#define IFX_DMU_SF_STATUS_D1BUSY_LEN (1u)

/** \brief  Mask for Ifx_DMU_SF_STATUS_Bits.D1BUSY */
#define IFX_DMU_SF_STATUS_D1BUSY_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_SF_STATUS_Bits.D1BUSY */
#define IFX_DMU_SF_STATUS_D1BUSY_OFF (1u)

