Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxDmu_bf.h
/** \brief  Length for Ifx_DMU_SF_STATUS_Bits.DFPAGE */
#define IFX_DMU_SF_STATUS_DFPAGE_LEN (1u)

/** \brief  Mask for Ifx_DMU_SF_STATUS_Bits.DFPAGE */
#define IFX_DMU_SF_STATUS_DFPAGE_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_SF_STATUS_Bits.DFPAGE */
#define IFX_DMU_SF_STATUS_DFPAGE_OFF (20u)

/** \brief  Length for Ifx_DMU_SF_SUSPEND_Bits.CLR */
#define IFX_DMU_SF_SUSPEND_CLR_LEN (1u)

/** \brief  Mask for Ifx_DMU_SF_SUSPEND_Bits.CLR */
#define IFX_DMU_SF_SUSPEND_CLR_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_SF_SUSPEND_Bits.CLR */
#define IFX_DMU_SF_SUSPEND_CLR_OFF (1u)

/** \brief  Length for Ifx_DMU_SF_SUSPEND_Bits.ERR */
#define IFX_DMU_SF_SUSPEND_ERR_LEN (1u)

/** \brief  Mask for Ifx_DMU_SF_SUSPEND_Bits.ERR */
#define IFX_DMU_SF_SUSPEND_ERR_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_SF_SUSPEND_Bits.ERR */
#define IFX_DMU_SF_SUSPEND_ERR_OFF (17u)

/** \brief  Length for Ifx_DMU_SF_SUSPEND_Bits.REQ */
#define IFX_DMU_SF_SUSPEND_REQ_LEN (1u)

/** \brief  Mask for Ifx_DMU_SF_SUSPEND_Bits.REQ */
#define IFX_DMU_SF_SUSPEND_REQ_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_SF_SUSPEND_Bits.REQ */
#define IFX_DMU_SF_SUSPEND_REQ_OFF (0u)

/** \brief  Length for Ifx_DMU_SF_SUSPEND_Bits.SPND */
#define IFX_DMU_SF_SUSPEND_SPND_LEN (1u)

/** \brief  Mask for Ifx_DMU_SF_SUSPEND_Bits.SPND */
#define IFX_DMU_SF_SUSPEND_SPND_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_SF_SUSPEND_Bits.SPND */
#define IFX_DMU_SF_SUSPEND_SPND_OFF (16u)

/** \brief  Length for Ifx_DMU_SP_PROCONHSM_Bits.DBGIFLCK */
#define IFX_DMU_SP_PROCONHSM_DBGIFLCK_LEN (1u)

/** \brief  Mask for Ifx_DMU_SP_PROCONHSM_Bits.DBGIFLCK */
#define IFX_DMU_SP_PROCONHSM_DBGIFLCK_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_SP_PROCONHSM_Bits.DBGIFLCK */
#define IFX_DMU_SP_PROCONHSM_DBGIFLCK_OFF (1u)

/** \brief  Length for Ifx_DMU_SP_PROCONHSM_Bits.HSMDBGDIS */
#define IFX_DMU_SP_PROCONHSM_HSMDBGDIS_LEN (1u)

/** \brief  Mask for Ifx_DMU_SP_PROCONHSM_Bits.HSMDBGDIS */
#define IFX_DMU_SP_PROCONHSM_HSMDBGDIS_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_SP_PROCONHSM_Bits.HSMDBGDIS */
#define IFX_DMU_SP_PROCONHSM_HSMDBGDIS_OFF (0u)

/** \brief  Length for Ifx_DMU_SP_PROCONHSM_Bits.HSMTRDIS */
#define IFX_DMU_SP_PROCONHSM_HSMTRDIS_LEN (2u)

/** \brief  Mask for Ifx_DMU_SP_PROCONHSM_Bits.HSMTRDIS */
#define IFX_DMU_SP_PROCONHSM_HSMTRDIS_MSK (0x3u)

/** \brief  Offset for Ifx_DMU_SP_PROCONHSM_Bits.HSMTRDIS */
#define IFX_DMU_SP_PROCONHSM_HSMTRDIS_OFF (4u)

/** \brief  Length for Ifx_DMU_SP_PROCONHSM_Bits.HSMTRTYPE */
#define IFX_DMU_SP_PROCONHSM_HSMTRTYPE_LEN (1u)

/** \brief  Mask for Ifx_DMU_SP_PROCONHSM_Bits.HSMTRTYPE */
#define IFX_DMU_SP_PROCONHSM_HSMTRTYPE_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_SP_PROCONHSM_Bits.HSMTRTYPE */
#define IFX_DMU_SP_PROCONHSM_HSMTRTYPE_OFF (6u)

/** \brief  Length for Ifx_DMU_SP_PROCONHSM_Bits.HSMTSTDIS */
#define IFX_DMU_SP_PROCONHSM_HSMTSTDIS_LEN (1u)

/** \brief  Mask for Ifx_DMU_SP_PROCONHSM_Bits.HSMTSTDIS */
#define IFX_DMU_SP_PROCONHSM_HSMTSTDIS_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_SP_PROCONHSM_Bits.HSMTSTDIS */
#define IFX_DMU_SP_PROCONHSM_HSMTSTDIS_OFF (3u)

/** \brief  Length for Ifx_DMU_SP_PROCONHSM_Bits.TSTIFLCK */
#define IFX_DMU_SP_PROCONHSM_TSTIFLCK_LEN (1u)

/** \brief  Mask for Ifx_DMU_SP_PROCONHSM_Bits.TSTIFLCK */
#define IFX_DMU_SP_PROCONHSM_TSTIFLCK_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_SP_PROCONHSM_Bits.TSTIFLCK */
#define IFX_DMU_SP_PROCONHSM_TSTIFLCK_OFF (2u)

/** \brief  Length for Ifx_DMU_SP_PROCONHSM_Bits.UCB */
#define IFX_DMU_SP_PROCONHSM_UCB_LEN (9u)

/** \brief  Mask for Ifx_DMU_SP_PROCONHSM_Bits.UCB */
#define IFX_DMU_SP_PROCONHSM_UCB_MSK (0x1ffu)

/** \brief  Offset for Ifx_DMU_SP_PROCONHSM_Bits.UCB */
#define IFX_DMU_SP_PROCONHSM_UCB_OFF (7u)

/** \brief  Length for Ifx_DMU_SP_PROCONHSMCBS_Bits.BOOTSEL0 */
#define IFX_DMU_SP_PROCONHSMCBS_BOOTSEL0_LEN (6u)

/** \brief  Mask for Ifx_DMU_SP_PROCONHSMCBS_Bits.BOOTSEL0 */
#define IFX_DMU_SP_PROCONHSMCBS_BOOTSEL0_MSK (0x3fu)

/** \brief  Offset for Ifx_DMU_SP_PROCONHSMCBS_Bits.BOOTSEL0 */
#define IFX_DMU_SP_PROCONHSMCBS_BOOTSEL0_OFF (0u)

/** \brief  Length for Ifx_DMU_SP_PROCONHSMCBS_Bits.BOOTSEL1 */
#define IFX_DMU_SP_PROCONHSMCBS_BOOTSEL1_LEN (6u)

/** \brief  Mask for Ifx_DMU_SP_PROCONHSMCBS_Bits.BOOTSEL1 */
#define IFX_DMU_SP_PROCONHSMCBS_BOOTSEL1_MSK (0x3fu)

/** \brief  Offset for Ifx_DMU_SP_PROCONHSMCBS_Bits.BOOTSEL1 */
#define IFX_DMU_SP_PROCONHSMCBS_BOOTSEL1_OFF (8u)

/** \brief  Length for Ifx_DMU_SP_PROCONHSMCBS_Bits.BOOTSEL2 */
#define IFX_DMU_SP_PROCONHSMCBS_BOOTSEL2_LEN (6u)

/** \brief  Mask for Ifx_DMU_SP_PROCONHSMCBS_Bits.BOOTSEL2 */
#define IFX_DMU_SP_PROCONHSMCBS_BOOTSEL2_MSK (0x3fu)

/** \brief  Offset for Ifx_DMU_SP_PROCONHSMCBS_Bits.BOOTSEL2 */
#define IFX_DMU_SP_PROCONHSMCBS_BOOTSEL2_OFF (16u)

/** \brief  Length for Ifx_DMU_SP_PROCONHSMCBS_Bits.BOOTSEL3 */
#define IFX_DMU_SP_PROCONHSMCBS_BOOTSEL3_LEN (6u)

/** \brief  Mask for Ifx_DMU_SP_PROCONHSMCBS_Bits.BOOTSEL3 */
#define IFX_DMU_SP_PROCONHSMCBS_BOOTSEL3_MSK (0x3fu)

/** \brief  Offset for Ifx_DMU_SP_PROCONHSMCBS_Bits.BOOTSEL3 */
#define IFX_DMU_SP_PROCONHSMCBS_BOOTSEL3_OFF (24u)

/** \brief  Length for Ifx_DMU_SP_PROCONHSMCBS_Bits.UCB */
#define IFX_DMU_SP_PROCONHSMCBS_UCB_LEN (2u)

/** \brief  Mask for Ifx_DMU_SP_PROCONHSMCBS_Bits.UCB */
#define IFX_DMU_SP_PROCONHSMCBS_UCB_MSK (0x3u)

/** \brief  Offset for Ifx_DMU_SP_PROCONHSMCBS_Bits.UCB */
#define IFX_DMU_SP_PROCONHSMCBS_UCB_OFF (6u)

/** \brief  Length for Ifx_DMU_SP_PROCONHSMCFG_Bits.BLKFLAN */
#define IFX_DMU_SP_PROCONHSMCFG_BLKFLAN_LEN (1u)

/** \brief  Mask for Ifx_DMU_SP_PROCONHSMCFG_Bits.BLKFLAN */
#define IFX_DMU_SP_PROCONHSMCFG_BLKFLAN_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_SP_PROCONHSMCFG_Bits.BLKFLAN */
#define IFX_DMU_SP_PROCONHSMCFG_BLKFLAN_OFF (13u)

/** \brief  Length for Ifx_DMU_SP_PROCONHSMCFG_Bits.DESTDBG */
#define IFX_DMU_SP_PROCONHSMCFG_DESTDBG_LEN (2u)

/** \brief  Mask for Ifx_DMU_SP_PROCONHSMCFG_Bits.DESTDBG */
#define IFX_DMU_SP_PROCONHSMCFG_DESTDBG_MSK (0x3u)

/** \brief  Offset for Ifx_DMU_SP_PROCONHSMCFG_Bits.DESTDBG */
#define IFX_DMU_SP_PROCONHSMCFG_DESTDBG_OFF (11u)

/** \brief  Length for Ifx_DMU_SP_PROCONHSMCFG_Bits.HSMBOOTEN */
#define IFX_DMU_SP_PROCONHSMCFG_HSMBOOTEN_LEN (1u)

/** \brief  Mask for Ifx_DMU_SP_PROCONHSMCFG_Bits.HSMBOOTEN */
#define IFX_DMU_SP_PROCONHSMCFG_HSMBOOTEN_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_SP_PROCONHSMCFG_Bits.HSMBOOTEN */
#define IFX_DMU_SP_PROCONHSMCFG_HSMBOOTEN_OFF (0u)

/** \brief  Length for Ifx_DMU_SP_PROCONHSMCFG_Bits.HSMDX */
#define IFX_DMU_SP_PROCONHSMCFG_HSMDX_LEN (1u)

/** \brief  Mask for Ifx_DMU_SP_PROCONHSMCFG_Bits.HSMDX */
#define IFX_DMU_SP_PROCONHSMCFG_HSMDX_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_SP_PROCONHSMCFG_Bits.HSMDX */
#define IFX_DMU_SP_PROCONHSMCFG_HSMDX_OFF (2u)

