Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxDmu_bf.h
/** \brief  Length for Ifx_DMU_SP_PROCONHSMCFG_Bits.HSMENPINS */
#define IFX_DMU_SP_PROCONHSMCFG_HSMENPINS_LEN (2u)

/** \brief  Mask for Ifx_DMU_SP_PROCONHSMCFG_Bits.HSMENPINS */
#define IFX_DMU_SP_PROCONHSMCFG_HSMENPINS_MSK (0x3u)

/** \brief  Offset for Ifx_DMU_SP_PROCONHSMCFG_Bits.HSMENPINS */
#define IFX_DMU_SP_PROCONHSMCFG_HSMENPINS_OFF (7u)

/** \brief  Length for Ifx_DMU_SP_PROCONHSMCFG_Bits.HSMENRES */
#define IFX_DMU_SP_PROCONHSMCFG_HSMENRES_LEN (2u)

/** \brief  Mask for Ifx_DMU_SP_PROCONHSMCFG_Bits.HSMENRES */
#define IFX_DMU_SP_PROCONHSMCFG_HSMENRES_MSK (0x3u)

/** \brief  Offset for Ifx_DMU_SP_PROCONHSMCFG_Bits.HSMENRES */
#define IFX_DMU_SP_PROCONHSMCFG_HSMENRES_OFF (9u)

/** \brief  Length for Ifx_DMU_SP_PROCONHSMCFG_Bits.HSMRAMKEEP */
#define IFX_DMU_SP_PROCONHSMCFG_HSMRAMKEEP_LEN (2u)

/** \brief  Mask for Ifx_DMU_SP_PROCONHSMCFG_Bits.HSMRAMKEEP */
#define IFX_DMU_SP_PROCONHSMCFG_HSMRAMKEEP_MSK (0x3u)

/** \brief  Offset for Ifx_DMU_SP_PROCONHSMCFG_Bits.HSMRAMKEEP */
#define IFX_DMU_SP_PROCONHSMCFG_HSMRAMKEEP_OFF (4u)

/** \brief  Length for Ifx_DMU_SP_PROCONHSMCFG_Bits.SSWWAIT */
#define IFX_DMU_SP_PROCONHSMCFG_SSWWAIT_LEN (1u)

/** \brief  Mask for Ifx_DMU_SP_PROCONHSMCFG_Bits.SSWWAIT */
#define IFX_DMU_SP_PROCONHSMCFG_SSWWAIT_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_SP_PROCONHSMCFG_Bits.SSWWAIT */
#define IFX_DMU_SP_PROCONHSMCFG_SSWWAIT_OFF (1u)

/** \brief  Length for Ifx_DMU_SP_PROCONHSMCFG_Bits.UCB */
#define IFX_DMU_SP_PROCONHSMCFG_UCB_LEN (1u)

/** \brief  Mask for Ifx_DMU_SP_PROCONHSMCFG_Bits.UCB */
#define IFX_DMU_SP_PROCONHSMCFG_UCB_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_SP_PROCONHSMCFG_Bits.UCB */
#define IFX_DMU_SP_PROCONHSMCFG_UCB_OFF (3u)

/** \brief  Length for Ifx_DMU_SP_PROCONHSMCOTP0_Bits.HSM0ROM */
#define IFX_DMU_SP_PROCONHSMCOTP0_HSM0ROM_LEN (1u)

/** \brief  Mask for Ifx_DMU_SP_PROCONHSMCOTP0_Bits.HSM0ROM */
#define IFX_DMU_SP_PROCONHSMCOTP0_HSM0ROM_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_SP_PROCONHSMCOTP0_Bits.HSM0ROM */
#define IFX_DMU_SP_PROCONHSMCOTP0_HSM0ROM_OFF (0u)

/** \brief  Length for Ifx_DMU_SP_PROCONHSMCOTP0_Bits.HSM10ROM */
#define IFX_DMU_SP_PROCONHSMCOTP0_HSM10ROM_LEN (1u)

/** \brief  Mask for Ifx_DMU_SP_PROCONHSMCOTP0_Bits.HSM10ROM */
#define IFX_DMU_SP_PROCONHSMCOTP0_HSM10ROM_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_SP_PROCONHSMCOTP0_Bits.HSM10ROM */
#define IFX_DMU_SP_PROCONHSMCOTP0_HSM10ROM_OFF (10u)

/** \brief  Length for Ifx_DMU_SP_PROCONHSMCOTP0_Bits.HSM11ROM */
#define IFX_DMU_SP_PROCONHSMCOTP0_HSM11ROM_LEN (1u)

/** \brief  Mask for Ifx_DMU_SP_PROCONHSMCOTP0_Bits.HSM11ROM */
#define IFX_DMU_SP_PROCONHSMCOTP0_HSM11ROM_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_SP_PROCONHSMCOTP0_Bits.HSM11ROM */
#define IFX_DMU_SP_PROCONHSMCOTP0_HSM11ROM_OFF (11u)

/** \brief  Length for Ifx_DMU_SP_PROCONHSMCOTP0_Bits.HSM12ROM */
#define IFX_DMU_SP_PROCONHSMCOTP0_HSM12ROM_LEN (1u)

/** \brief  Mask for Ifx_DMU_SP_PROCONHSMCOTP0_Bits.HSM12ROM */
#define IFX_DMU_SP_PROCONHSMCOTP0_HSM12ROM_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_SP_PROCONHSMCOTP0_Bits.HSM12ROM */
#define IFX_DMU_SP_PROCONHSMCOTP0_HSM12ROM_OFF (12u)

/** \brief  Length for Ifx_DMU_SP_PROCONHSMCOTP0_Bits.HSM13ROM */
#define IFX_DMU_SP_PROCONHSMCOTP0_HSM13ROM_LEN (1u)

/** \brief  Mask for Ifx_DMU_SP_PROCONHSMCOTP0_Bits.HSM13ROM */
#define IFX_DMU_SP_PROCONHSMCOTP0_HSM13ROM_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_SP_PROCONHSMCOTP0_Bits.HSM13ROM */
#define IFX_DMU_SP_PROCONHSMCOTP0_HSM13ROM_OFF (13u)

/** \brief  Length for Ifx_DMU_SP_PROCONHSMCOTP0_Bits.HSM14ROM */
#define IFX_DMU_SP_PROCONHSMCOTP0_HSM14ROM_LEN (1u)

/** \brief  Mask for Ifx_DMU_SP_PROCONHSMCOTP0_Bits.HSM14ROM */
#define IFX_DMU_SP_PROCONHSMCOTP0_HSM14ROM_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_SP_PROCONHSMCOTP0_Bits.HSM14ROM */
#define IFX_DMU_SP_PROCONHSMCOTP0_HSM14ROM_OFF (14u)

/** \brief  Length for Ifx_DMU_SP_PROCONHSMCOTP0_Bits.HSM15ROM */
#define IFX_DMU_SP_PROCONHSMCOTP0_HSM15ROM_LEN (1u)

/** \brief  Mask for Ifx_DMU_SP_PROCONHSMCOTP0_Bits.HSM15ROM */
#define IFX_DMU_SP_PROCONHSMCOTP0_HSM15ROM_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_SP_PROCONHSMCOTP0_Bits.HSM15ROM */
#define IFX_DMU_SP_PROCONHSMCOTP0_HSM15ROM_OFF (15u)

/** \brief  Length for Ifx_DMU_SP_PROCONHSMCOTP0_Bits.HSM16ROM */
#define IFX_DMU_SP_PROCONHSMCOTP0_HSM16ROM_LEN (1u)

/** \brief  Mask for Ifx_DMU_SP_PROCONHSMCOTP0_Bits.HSM16ROM */
#define IFX_DMU_SP_PROCONHSMCOTP0_HSM16ROM_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_SP_PROCONHSMCOTP0_Bits.HSM16ROM */
#define IFX_DMU_SP_PROCONHSMCOTP0_HSM16ROM_OFF (16u)

/** \brief  Length for Ifx_DMU_SP_PROCONHSMCOTP0_Bits.HSM17ROM */
#define IFX_DMU_SP_PROCONHSMCOTP0_HSM17ROM_LEN (1u)

/** \brief  Mask for Ifx_DMU_SP_PROCONHSMCOTP0_Bits.HSM17ROM */
#define IFX_DMU_SP_PROCONHSMCOTP0_HSM17ROM_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_SP_PROCONHSMCOTP0_Bits.HSM17ROM */
#define IFX_DMU_SP_PROCONHSMCOTP0_HSM17ROM_OFF (17u)

/** \brief  Length for Ifx_DMU_SP_PROCONHSMCOTP0_Bits.HSM18ROM */
#define IFX_DMU_SP_PROCONHSMCOTP0_HSM18ROM_LEN (1u)

/** \brief  Mask for Ifx_DMU_SP_PROCONHSMCOTP0_Bits.HSM18ROM */
#define IFX_DMU_SP_PROCONHSMCOTP0_HSM18ROM_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_SP_PROCONHSMCOTP0_Bits.HSM18ROM */
#define IFX_DMU_SP_PROCONHSMCOTP0_HSM18ROM_OFF (18u)

/** \brief  Length for Ifx_DMU_SP_PROCONHSMCOTP0_Bits.HSM19ROM */
#define IFX_DMU_SP_PROCONHSMCOTP0_HSM19ROM_LEN (1u)

/** \brief  Mask for Ifx_DMU_SP_PROCONHSMCOTP0_Bits.HSM19ROM */
#define IFX_DMU_SP_PROCONHSMCOTP0_HSM19ROM_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_SP_PROCONHSMCOTP0_Bits.HSM19ROM */
#define IFX_DMU_SP_PROCONHSMCOTP0_HSM19ROM_OFF (19u)

/** \brief  Length for Ifx_DMU_SP_PROCONHSMCOTP0_Bits.HSM1ROM */
#define IFX_DMU_SP_PROCONHSMCOTP0_HSM1ROM_LEN (1u)

/** \brief  Mask for Ifx_DMU_SP_PROCONHSMCOTP0_Bits.HSM1ROM */
#define IFX_DMU_SP_PROCONHSMCOTP0_HSM1ROM_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_SP_PROCONHSMCOTP0_Bits.HSM1ROM */
#define IFX_DMU_SP_PROCONHSMCOTP0_HSM1ROM_OFF (1u)

/** \brief  Length for Ifx_DMU_SP_PROCONHSMCOTP0_Bits.HSM20ROM */
#define IFX_DMU_SP_PROCONHSMCOTP0_HSM20ROM_LEN (1u)

/** \brief  Mask for Ifx_DMU_SP_PROCONHSMCOTP0_Bits.HSM20ROM */
#define IFX_DMU_SP_PROCONHSMCOTP0_HSM20ROM_MSK (0x1u)

