Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxDmu_bf.h
/** \brief  Offset for Ifx_DMU_SP_PROCONHSMCOTP0_Bits.HSM20ROM */
#define IFX_DMU_SP_PROCONHSMCOTP0_HSM20ROM_OFF (20u)

/** \brief  Length for Ifx_DMU_SP_PROCONHSMCOTP0_Bits.HSM21ROM */
#define IFX_DMU_SP_PROCONHSMCOTP0_HSM21ROM_LEN (1u)

/** \brief  Mask for Ifx_DMU_SP_PROCONHSMCOTP0_Bits.HSM21ROM */
#define IFX_DMU_SP_PROCONHSMCOTP0_HSM21ROM_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_SP_PROCONHSMCOTP0_Bits.HSM21ROM */
#define IFX_DMU_SP_PROCONHSMCOTP0_HSM21ROM_OFF (21u)

/** \brief  Length for Ifx_DMU_SP_PROCONHSMCOTP0_Bits.HSM22ROM */
#define IFX_DMU_SP_PROCONHSMCOTP0_HSM22ROM_LEN (1u)

/** \brief  Mask for Ifx_DMU_SP_PROCONHSMCOTP0_Bits.HSM22ROM */
#define IFX_DMU_SP_PROCONHSMCOTP0_HSM22ROM_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_SP_PROCONHSMCOTP0_Bits.HSM22ROM */
#define IFX_DMU_SP_PROCONHSMCOTP0_HSM22ROM_OFF (22u)

/** \brief  Length for Ifx_DMU_SP_PROCONHSMCOTP0_Bits.HSM23ROM */
#define IFX_DMU_SP_PROCONHSMCOTP0_HSM23ROM_LEN (1u)

/** \brief  Mask for Ifx_DMU_SP_PROCONHSMCOTP0_Bits.HSM23ROM */
#define IFX_DMU_SP_PROCONHSMCOTP0_HSM23ROM_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_SP_PROCONHSMCOTP0_Bits.HSM23ROM */
#define IFX_DMU_SP_PROCONHSMCOTP0_HSM23ROM_OFF (23u)

/** \brief  Length for Ifx_DMU_SP_PROCONHSMCOTP0_Bits.HSM24ROM */
#define IFX_DMU_SP_PROCONHSMCOTP0_HSM24ROM_LEN (1u)

/** \brief  Mask for Ifx_DMU_SP_PROCONHSMCOTP0_Bits.HSM24ROM */
#define IFX_DMU_SP_PROCONHSMCOTP0_HSM24ROM_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_SP_PROCONHSMCOTP0_Bits.HSM24ROM */
#define IFX_DMU_SP_PROCONHSMCOTP0_HSM24ROM_OFF (24u)

/** \brief  Length for Ifx_DMU_SP_PROCONHSMCOTP0_Bits.HSM25ROM */
#define IFX_DMU_SP_PROCONHSMCOTP0_HSM25ROM_LEN (1u)

/** \brief  Mask for Ifx_DMU_SP_PROCONHSMCOTP0_Bits.HSM25ROM */
#define IFX_DMU_SP_PROCONHSMCOTP0_HSM25ROM_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_SP_PROCONHSMCOTP0_Bits.HSM25ROM */
#define IFX_DMU_SP_PROCONHSMCOTP0_HSM25ROM_OFF (25u)

/** \brief  Length for Ifx_DMU_SP_PROCONHSMCOTP0_Bits.HSM26ROM */
#define IFX_DMU_SP_PROCONHSMCOTP0_HSM26ROM_LEN (1u)

/** \brief  Mask for Ifx_DMU_SP_PROCONHSMCOTP0_Bits.HSM26ROM */
#define IFX_DMU_SP_PROCONHSMCOTP0_HSM26ROM_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_SP_PROCONHSMCOTP0_Bits.HSM26ROM */
#define IFX_DMU_SP_PROCONHSMCOTP0_HSM26ROM_OFF (26u)

/** \brief  Length for Ifx_DMU_SP_PROCONHSMCOTP0_Bits.HSM27ROM */
#define IFX_DMU_SP_PROCONHSMCOTP0_HSM27ROM_LEN (1u)

/** \brief  Mask for Ifx_DMU_SP_PROCONHSMCOTP0_Bits.HSM27ROM */
#define IFX_DMU_SP_PROCONHSMCOTP0_HSM27ROM_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_SP_PROCONHSMCOTP0_Bits.HSM27ROM */
#define IFX_DMU_SP_PROCONHSMCOTP0_HSM27ROM_OFF (27u)

/** \brief  Length for Ifx_DMU_SP_PROCONHSMCOTP0_Bits.HSM28ROM */
#define IFX_DMU_SP_PROCONHSMCOTP0_HSM28ROM_LEN (1u)

/** \brief  Mask for Ifx_DMU_SP_PROCONHSMCOTP0_Bits.HSM28ROM */
#define IFX_DMU_SP_PROCONHSMCOTP0_HSM28ROM_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_SP_PROCONHSMCOTP0_Bits.HSM28ROM */
#define IFX_DMU_SP_PROCONHSMCOTP0_HSM28ROM_OFF (28u)

/** \brief  Length for Ifx_DMU_SP_PROCONHSMCOTP0_Bits.HSM29ROM */
#define IFX_DMU_SP_PROCONHSMCOTP0_HSM29ROM_LEN (1u)

/** \brief  Mask for Ifx_DMU_SP_PROCONHSMCOTP0_Bits.HSM29ROM */
#define IFX_DMU_SP_PROCONHSMCOTP0_HSM29ROM_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_SP_PROCONHSMCOTP0_Bits.HSM29ROM */
#define IFX_DMU_SP_PROCONHSMCOTP0_HSM29ROM_OFF (29u)

/** \brief  Length for Ifx_DMU_SP_PROCONHSMCOTP0_Bits.HSM2ROM */
#define IFX_DMU_SP_PROCONHSMCOTP0_HSM2ROM_LEN (1u)

/** \brief  Mask for Ifx_DMU_SP_PROCONHSMCOTP0_Bits.HSM2ROM */
#define IFX_DMU_SP_PROCONHSMCOTP0_HSM2ROM_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_SP_PROCONHSMCOTP0_Bits.HSM2ROM */
#define IFX_DMU_SP_PROCONHSMCOTP0_HSM2ROM_OFF (2u)

/** \brief  Length for Ifx_DMU_SP_PROCONHSMCOTP0_Bits.HSM30ROM */
#define IFX_DMU_SP_PROCONHSMCOTP0_HSM30ROM_LEN (1u)

/** \brief  Mask for Ifx_DMU_SP_PROCONHSMCOTP0_Bits.HSM30ROM */
#define IFX_DMU_SP_PROCONHSMCOTP0_HSM30ROM_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_SP_PROCONHSMCOTP0_Bits.HSM30ROM */
#define IFX_DMU_SP_PROCONHSMCOTP0_HSM30ROM_OFF (30u)

/** \brief  Length for Ifx_DMU_SP_PROCONHSMCOTP0_Bits.HSM31ROM */
#define IFX_DMU_SP_PROCONHSMCOTP0_HSM31ROM_LEN (1u)

/** \brief  Mask for Ifx_DMU_SP_PROCONHSMCOTP0_Bits.HSM31ROM */
#define IFX_DMU_SP_PROCONHSMCOTP0_HSM31ROM_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_SP_PROCONHSMCOTP0_Bits.HSM31ROM */
#define IFX_DMU_SP_PROCONHSMCOTP0_HSM31ROM_OFF (31u)

/** \brief  Length for Ifx_DMU_SP_PROCONHSMCOTP0_Bits.HSM3ROM */
#define IFX_DMU_SP_PROCONHSMCOTP0_HSM3ROM_LEN (1u)

/** \brief  Mask for Ifx_DMU_SP_PROCONHSMCOTP0_Bits.HSM3ROM */
#define IFX_DMU_SP_PROCONHSMCOTP0_HSM3ROM_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_SP_PROCONHSMCOTP0_Bits.HSM3ROM */
#define IFX_DMU_SP_PROCONHSMCOTP0_HSM3ROM_OFF (3u)

/** \brief  Length for Ifx_DMU_SP_PROCONHSMCOTP0_Bits.HSM4ROM */
#define IFX_DMU_SP_PROCONHSMCOTP0_HSM4ROM_LEN (1u)

/** \brief  Mask for Ifx_DMU_SP_PROCONHSMCOTP0_Bits.HSM4ROM */
#define IFX_DMU_SP_PROCONHSMCOTP0_HSM4ROM_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_SP_PROCONHSMCOTP0_Bits.HSM4ROM */
#define IFX_DMU_SP_PROCONHSMCOTP0_HSM4ROM_OFF (4u)

/** \brief  Length for Ifx_DMU_SP_PROCONHSMCOTP0_Bits.HSM5ROM */
#define IFX_DMU_SP_PROCONHSMCOTP0_HSM5ROM_LEN (1u)

/** \brief  Mask for Ifx_DMU_SP_PROCONHSMCOTP0_Bits.HSM5ROM */
#define IFX_DMU_SP_PROCONHSMCOTP0_HSM5ROM_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_SP_PROCONHSMCOTP0_Bits.HSM5ROM */
#define IFX_DMU_SP_PROCONHSMCOTP0_HSM5ROM_OFF (5u)

/** \brief  Length for Ifx_DMU_SP_PROCONHSMCOTP0_Bits.HSM6ROM */
#define IFX_DMU_SP_PROCONHSMCOTP0_HSM6ROM_LEN (1u)

/** \brief  Mask for Ifx_DMU_SP_PROCONHSMCOTP0_Bits.HSM6ROM */
#define IFX_DMU_SP_PROCONHSMCOTP0_HSM6ROM_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_SP_PROCONHSMCOTP0_Bits.HSM6ROM */
#define IFX_DMU_SP_PROCONHSMCOTP0_HSM6ROM_OFF (6u)

/** \brief  Length for Ifx_DMU_SP_PROCONHSMCOTP0_Bits.HSM7ROM */
#define IFX_DMU_SP_PROCONHSMCOTP0_HSM7ROM_LEN (1u)

/** \brief  Mask for Ifx_DMU_SP_PROCONHSMCOTP0_Bits.HSM7ROM */
#define IFX_DMU_SP_PROCONHSMCOTP0_HSM7ROM_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_SP_PROCONHSMCOTP0_Bits.HSM7ROM */
#define IFX_DMU_SP_PROCONHSMCOTP0_HSM7ROM_OFF (7u)

/** \brief  Length for Ifx_DMU_SP_PROCONHSMCOTP0_Bits.HSM8ROM */
#define IFX_DMU_SP_PROCONHSMCOTP0_HSM8ROM_LEN (1u)

