Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxDmu_bf.h
/** \brief  Mask for Ifx_DMU_SP_PROCONHSMCOTP0_Bits.HSM8ROM */
#define IFX_DMU_SP_PROCONHSMCOTP0_HSM8ROM_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_SP_PROCONHSMCOTP0_Bits.HSM8ROM */
#define IFX_DMU_SP_PROCONHSMCOTP0_HSM8ROM_OFF (8u)

/** \brief  Length for Ifx_DMU_SP_PROCONHSMCOTP0_Bits.HSM9ROM */
#define IFX_DMU_SP_PROCONHSMCOTP0_HSM9ROM_LEN (1u)

/** \brief  Mask for Ifx_DMU_SP_PROCONHSMCOTP0_Bits.HSM9ROM */
#define IFX_DMU_SP_PROCONHSMCOTP0_HSM9ROM_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_SP_PROCONHSMCOTP0_Bits.HSM9ROM */
#define IFX_DMU_SP_PROCONHSMCOTP0_HSM9ROM_OFF (9u)

/** \brief  Length for Ifx_DMU_SP_PROCONHSMCOTP1_Bits.HSM32ROM */
#define IFX_DMU_SP_PROCONHSMCOTP1_HSM32ROM_LEN (1u)

/** \brief  Mask for Ifx_DMU_SP_PROCONHSMCOTP1_Bits.HSM32ROM */
#define IFX_DMU_SP_PROCONHSMCOTP1_HSM32ROM_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_SP_PROCONHSMCOTP1_Bits.HSM32ROM */
#define IFX_DMU_SP_PROCONHSMCOTP1_HSM32ROM_OFF (0u)

/** \brief  Length for Ifx_DMU_SP_PROCONHSMCOTP1_Bits.HSM33ROM */
#define IFX_DMU_SP_PROCONHSMCOTP1_HSM33ROM_LEN (1u)

/** \brief  Mask for Ifx_DMU_SP_PROCONHSMCOTP1_Bits.HSM33ROM */
#define IFX_DMU_SP_PROCONHSMCOTP1_HSM33ROM_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_SP_PROCONHSMCOTP1_Bits.HSM33ROM */
#define IFX_DMU_SP_PROCONHSMCOTP1_HSM33ROM_OFF (1u)

/** \brief  Length for Ifx_DMU_SP_PROCONHSMCOTP1_Bits.HSM34ROM */
#define IFX_DMU_SP_PROCONHSMCOTP1_HSM34ROM_LEN (1u)

/** \brief  Mask for Ifx_DMU_SP_PROCONHSMCOTP1_Bits.HSM34ROM */
#define IFX_DMU_SP_PROCONHSMCOTP1_HSM34ROM_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_SP_PROCONHSMCOTP1_Bits.HSM34ROM */
#define IFX_DMU_SP_PROCONHSMCOTP1_HSM34ROM_OFF (2u)

/** \brief  Length for Ifx_DMU_SP_PROCONHSMCOTP1_Bits.HSM35ROM */
#define IFX_DMU_SP_PROCONHSMCOTP1_HSM35ROM_LEN (1u)

/** \brief  Mask for Ifx_DMU_SP_PROCONHSMCOTP1_Bits.HSM35ROM */
#define IFX_DMU_SP_PROCONHSMCOTP1_HSM35ROM_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_SP_PROCONHSMCOTP1_Bits.HSM35ROM */
#define IFX_DMU_SP_PROCONHSMCOTP1_HSM35ROM_OFF (3u)

/** \brief  Length for Ifx_DMU_SP_PROCONHSMCOTP1_Bits.HSM36ROM */
#define IFX_DMU_SP_PROCONHSMCOTP1_HSM36ROM_LEN (1u)

/** \brief  Mask for Ifx_DMU_SP_PROCONHSMCOTP1_Bits.HSM36ROM */
#define IFX_DMU_SP_PROCONHSMCOTP1_HSM36ROM_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_SP_PROCONHSMCOTP1_Bits.HSM36ROM */
#define IFX_DMU_SP_PROCONHSMCOTP1_HSM36ROM_OFF (4u)

/** \brief  Length for Ifx_DMU_SP_PROCONHSMCOTP1_Bits.HSM37ROM */
#define IFX_DMU_SP_PROCONHSMCOTP1_HSM37ROM_LEN (1u)

/** \brief  Mask for Ifx_DMU_SP_PROCONHSMCOTP1_Bits.HSM37ROM */
#define IFX_DMU_SP_PROCONHSMCOTP1_HSM37ROM_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_SP_PROCONHSMCOTP1_Bits.HSM37ROM */
#define IFX_DMU_SP_PROCONHSMCOTP1_HSM37ROM_OFF (5u)

/** \brief  Length for Ifx_DMU_SP_PROCONHSMCOTP1_Bits.HSM38ROM */
#define IFX_DMU_SP_PROCONHSMCOTP1_HSM38ROM_LEN (1u)

/** \brief  Mask for Ifx_DMU_SP_PROCONHSMCOTP1_Bits.HSM38ROM */
#define IFX_DMU_SP_PROCONHSMCOTP1_HSM38ROM_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_SP_PROCONHSMCOTP1_Bits.HSM38ROM */
#define IFX_DMU_SP_PROCONHSMCOTP1_HSM38ROM_OFF (6u)

/** \brief  Length for Ifx_DMU_SP_PROCONHSMCOTP1_Bits.HSM39ROM */
#define IFX_DMU_SP_PROCONHSMCOTP1_HSM39ROM_LEN (1u)

/** \brief  Mask for Ifx_DMU_SP_PROCONHSMCOTP1_Bits.HSM39ROM */
#define IFX_DMU_SP_PROCONHSMCOTP1_HSM39ROM_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_SP_PROCONHSMCOTP1_Bits.HSM39ROM */
#define IFX_DMU_SP_PROCONHSMCOTP1_HSM39ROM_OFF (7u)

/** \brief  Length for Ifx_DMU_SP_PROCONHSMCOTP1_Bits.UCB */
#define IFX_DMU_SP_PROCONHSMCOTP1_UCB_LEN (24u)

/** \brief  Mask for Ifx_DMU_SP_PROCONHSMCOTP1_Bits.UCB */
#define IFX_DMU_SP_PROCONHSMCOTP1_UCB_MSK (0xffffffu)

/** \brief  Offset for Ifx_DMU_SP_PROCONHSMCOTP1_Bits.UCB */
#define IFX_DMU_SP_PROCONHSMCOTP1_UCB_OFF (8u)

/** \brief  Length for Ifx_DMU_SP_PROCONHSMCX0_Bits.HSM0X */
#define IFX_DMU_SP_PROCONHSMCX0_HSM0X_LEN (1u)

/** \brief  Mask for Ifx_DMU_SP_PROCONHSMCX0_Bits.HSM0X */
#define IFX_DMU_SP_PROCONHSMCX0_HSM0X_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_SP_PROCONHSMCX0_Bits.HSM0X */
#define IFX_DMU_SP_PROCONHSMCX0_HSM0X_OFF (0u)

/** \brief  Length for Ifx_DMU_SP_PROCONHSMCX0_Bits.HSM10X */
#define IFX_DMU_SP_PROCONHSMCX0_HSM10X_LEN (1u)

/** \brief  Mask for Ifx_DMU_SP_PROCONHSMCX0_Bits.HSM10X */
#define IFX_DMU_SP_PROCONHSMCX0_HSM10X_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_SP_PROCONHSMCX0_Bits.HSM10X */
#define IFX_DMU_SP_PROCONHSMCX0_HSM10X_OFF (10u)

/** \brief  Length for Ifx_DMU_SP_PROCONHSMCX0_Bits.HSM11X */
#define IFX_DMU_SP_PROCONHSMCX0_HSM11X_LEN (1u)

/** \brief  Mask for Ifx_DMU_SP_PROCONHSMCX0_Bits.HSM11X */
#define IFX_DMU_SP_PROCONHSMCX0_HSM11X_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_SP_PROCONHSMCX0_Bits.HSM11X */
#define IFX_DMU_SP_PROCONHSMCX0_HSM11X_OFF (11u)

/** \brief  Length for Ifx_DMU_SP_PROCONHSMCX0_Bits.HSM12X */
#define IFX_DMU_SP_PROCONHSMCX0_HSM12X_LEN (1u)

/** \brief  Mask for Ifx_DMU_SP_PROCONHSMCX0_Bits.HSM12X */
#define IFX_DMU_SP_PROCONHSMCX0_HSM12X_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_SP_PROCONHSMCX0_Bits.HSM12X */
#define IFX_DMU_SP_PROCONHSMCX0_HSM12X_OFF (12u)

/** \brief  Length for Ifx_DMU_SP_PROCONHSMCX0_Bits.HSM13X */
#define IFX_DMU_SP_PROCONHSMCX0_HSM13X_LEN (1u)

/** \brief  Mask for Ifx_DMU_SP_PROCONHSMCX0_Bits.HSM13X */
#define IFX_DMU_SP_PROCONHSMCX0_HSM13X_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_SP_PROCONHSMCX0_Bits.HSM13X */
#define IFX_DMU_SP_PROCONHSMCX0_HSM13X_OFF (13u)

/** \brief  Length for Ifx_DMU_SP_PROCONHSMCX0_Bits.HSM14X */
#define IFX_DMU_SP_PROCONHSMCX0_HSM14X_LEN (1u)

/** \brief  Mask for Ifx_DMU_SP_PROCONHSMCX0_Bits.HSM14X */
#define IFX_DMU_SP_PROCONHSMCX0_HSM14X_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_SP_PROCONHSMCX0_Bits.HSM14X */
#define IFX_DMU_SP_PROCONHSMCX0_HSM14X_OFF (14u)

/** \brief  Length for Ifx_DMU_SP_PROCONHSMCX0_Bits.HSM15X */
#define IFX_DMU_SP_PROCONHSMCX0_HSM15X_LEN (1u)

/** \brief  Mask for Ifx_DMU_SP_PROCONHSMCX0_Bits.HSM15X */
#define IFX_DMU_SP_PROCONHSMCX0_HSM15X_MSK (0x1u)

/** \brief  Offset for Ifx_DMU_SP_PROCONHSMCX0_Bits.HSM15X */
#define IFX_DMU_SP_PROCONHSMCX0_HSM15X_OFF (15u)

/** \brief  Length for Ifx_DMU_SP_PROCONHSMCX0_Bits.HSM16X */
#define IFX_DMU_SP_PROCONHSMCX0_HSM16X_LEN (1u)

/** \brief  Mask for Ifx_DMU_SP_PROCONHSMCX0_Bits.HSM16X */
#define IFX_DMU_SP_PROCONHSMCX0_HSM16X_MSK (0x1u)

